[{"index":3,"title":"Pelosi’s big decision: ‘There’s a life out there, right?’","shortDescription":"","url":"https://www.apnews.com/article/san-francisco-nancy-pelosi-congress-government-and-politics-a9c6b5e7c01989f1f9cb78bc853ba830","source":"AP News","slug":"apnews","imageUrl":"","date":"November 17, 2022"},{"index":5,"title":"The AP Interview: Whitmer has ‘no interest in going to DC’","shortDescription":"LANSING, Mich. (AP) — Fresh off a commanding reelection victory in one of the nation's premier swing states, Democratic Michigan Gov. Gretchen Whitmer says she will remain focused on her post and not growing speculation she could mount a future presidential run.","url":"https://www.apnews.com/article/abortion-gretchen-whitmer-michigan-only-on-ap-ef5e1dda1b7fe5cbb24a08ea1a1d4b42","source":"AP News","slug":"apnews","imageUrl":"","date":"November 17, 2022"},{"index":6,"title":"Lengthy vote counts frustrate, but don’t signal problems","shortDescription":"ATLANTA (AP) — Four days after Election Day, with a bitter, high-profile race for Arizona governor still up in the air, Ohio's secretary of state broke an unspoken protocol among top election officials.","url":"https://www.apnews.com/article/2022-midterm-elections-arizona-race-and-ethnicity-congress-c56023627a22ca81cd99fee4b2fb0897","source":"AP News","slug":"apnews","imageUrl":"","date":"November 18, 2022"},{"index":8,"title":"Difficulties again put Houston at center of Texas elections","shortDescription":"HOUSTON (AP) — A Democrat who is the top official in Texas' largest county on Thursday acknowledged problems around Houston on Election Day that included paper ballot shortages and delayed openings of polling locations, but waved off an unfolding investigation by state police as political.","url":"https://www.apnews.com/article/texas-state-elections-houston-4db88098bbf9eff4a1437e64d686cc46","source":"AP News","slug":"apnews","imageUrl":"","date":"November 17, 2022"},{"index":10,"title":"US House win by ex-combat pilot cements Republican control","shortDescription":"LOS ANGELES (AP) — Republican Rep. Mike Garcia, a former Navy fighter pilot, scored a U.S. House win in a strongly Democratic district Wednesday, handing the GOP control of the chamber and giving the party a rare reason to celebrate in a state dominated by Democrats.","url":"https://www.apnews.com/article/2022-midterm-elections-gop-california-house-win-6f63ce40257c35c25e798a6dc6988af3","source":"AP News","slug":"apnews","imageUrl":"","date":"November 17, 2022"},{"index":14,"title":"‘Democracy voters’ delivered for Democrats in tightest races","shortDescription":"WASHINGTON (AP) — President Joe Biden tried to shape the midterm elections not as a verdict on his time in office, but rather on the contrast between Democrats and Republicans on American democracy.","url":"https://www.apnews.com/article/2022-midterm-elections-democracy-voters-89776d32a3d8746faee14c1ed94ba60e","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":15,"title":"Leading Republicans try to ignore Trump campaign launch","shortDescription":"TALLAHASSEE, Fla. (AP) — Leading Republican officials on Wednesday sought to ignore Donald Trump's formal step into the 2024 presidential contest, insisting there were more pressing priorities as GOP leaders grappled with the fallout of a major midterm disappointment.","url":"https://www.apnews.com/article/2022-midterm-elections-ron-desantis-donald-trump-f908368105634b659f6ca117fa3548b6","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":16,"title":"Same-sex marriage legislation clears key Senate hurdle","shortDescription":"WASHINGTON (AP) — Legislation to protect same-sex and interracial marriages crossed a major Senate hurdle Wednesday, putting Congress on track to take the historic step of ensuring that such unions are enshrined in federal law.","url":"https://www.apnews.com/article/same-sex-marriage-senate-democrats-d09d4716102cf003212bab1f970e6a41","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":17,"title":"Faith groups split over bill to protect same-sex marriage","shortDescription":"Among U.S. faith leaders and denominations, there are sharp differences over the bill advancing in the Senate that would protect same-sex and interracial marriages in federal law. The measure, a high priority for congressional Democrats, won a key test vote Wednesday when 12 Senate Republicans joined all Democrats to forward the bill for a final vote in the coming days.","url":"https://www.apnews.com/article/religion-relationships-gay-rights-marriage-a6d9a92c4a5cda6e4b977f516a9a71a7","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":20,"title":"Storming Capitol was ‘really stupid,’ Oath Keeper testifies","shortDescription":"WASHINGTON (AP) — A former Ohio bar owner who stormed the U.S. Capitol in a military-style stack formation with fellow members of the far-right Oath Keepers extremist group told jurors Wednesday that it was a “really stupid\" decision, saying she got swept up in what seemed to be a \"very American moment.\"","url":"https://www.apnews.com/article/capitol-siege-ohio-veterans-government-and-politics-20f5b6007d9363bcf70ecf3e78bd7fd4","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":21,"title":"Feds, tech fall short on watching extremists, Senate says","shortDescription":"The FBI and the Department of Homeland Security are failing to adequately monitor domestic extremists, according to a new Senate report that also faulted social media platforms for encouraging the spread of violent and antigovernment content.","url":"https://www.apnews.com/article/technology-social-media-terrorism-gary-peters-02d26cfc708d1bcae834732426bcbab3","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":24,"title":"Trump seeks White House again amid GOP losses, legal probes","shortDescription":"PALM BEACH, Fla. (AP) — Former President Donald Trump on Tuesday launched his third campaign for the White House just one week after a disappointing midterm showing for Republicans, forcing the party to again decide whether to embrace a candidate whose refusal to accept defeat in 2020 sparked an insurrection and pushed American democracy to the brink.","url":"https://www.apnews.com/article/donald-trump-2024-updates-cd5339d48064a149527e8f9a1aa7614e","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":25,"title":"Why the AP hasn’t called control of the House yet","shortDescription":"The GOP's wait for a U.S. House majority dragged into a second week, as the amount of votes still to be counted after Tuesday in California and elsewhere kept The Associated Press from calling the final seat Republicans need for control.","url":"https://www.apnews.com/article/control-of-house-2022-midterms-explained-3bfe62ea428aebfd54d5593d9f96e71e","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":27,"title":"McCarthy passes 1st House speaker test, but hurdles remain","shortDescription":"WASHINGTON (AP) — Republican leader Kevin McCarthy won the nomination Tuesday for House speaker, clearing a first step with majority support from his colleagues, but he now faces a weeks-long slog to quell right-flank objections before a final vote in the new year.","url":"https://www.apnews.com/article/kevin-mccarthy-nancy-pelosi-congress-government-and-politics-dc947aadd41de192e4d1f018d0eaf193","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":29,"title":"Fight over election tally threatens Arizona certification","shortDescription":"PHOENIX (AP) — The two Republicans who control the elected board in a rural Arizona county have sued their own elections director to force her to conduct a greatly expanded hand-count of ballots cast in the Nov.","url":"https://www.apnews.com/article/2022-midterm-elections-arizona-government-and-politics-3f61a9901101e72b1af39fb56caac854","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":30,"title":"Florida’s Scott takes on McConnell in bid for Senate leader","shortDescription":"WASHINGTON (AP) — Florida Sen. Rick Scott said Tuesday that he will mount a long-shot bid to unseat Senate Republican leader Mitch McConnell, opening the latest front in an intraparty battle between allies of McConnell and former President Donald Trump over the direction of the GOP following a disappointing showing in last week's midterm elections.","url":"https://www.apnews.com/article/florida-mitch-mcconnell-congress-3592c4d35d125619d935f09b1d00dc5e","source":"AP News","slug":"apnews","imageUrl":"","date":"November 16, 2022"},{"index":32,"title":"Masters concedes Senate race, Hobbs celebrates governor win","shortDescription":"PHOENIX (AP) — Republican Blake Masters called Democratic Sen. Mark Kelly Tuesday to concede in the Arizona Senate race, joining other vanquished Republicans around the country who cast doubt on the 2020 election but still acknowledged their own defeat.","url":"https://www.apnews.com/article/2022-midterm-elections-arizona-phoenix-89d6378b397f54d94a0b5141359a496a","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":33,"title":"Judge says Michael Flynn must testify in Ga. election probe","shortDescription":"SARASOTA, Fla. (AP) — A Florida judge on Tuesday said former national security adviser Michael Flynn must testify before a special grand jury in Atlanta that's looking into whether then-President Donald Trump and his allies illegally tried to influence the 2020 election in Georgia.","url":"https://www.apnews.com/article/florida-donald-trump-georgia-af1bc7ae04f6bad9fcf97d8889fb15aa","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":34,"title":"Oath Keepers defendant downplays ‘heavy weapons’ message","shortDescription":"WASHINGTON (AP) — A defendant charged alongside members of the far-right Oath Keepers militia group in the Jan. 6 riot at the U.S. Capitol played down his message about ferrying “heavy weapons” across the Potomac River, calling it “creative writing\" in testimony Tuesday.","url":"https://www.apnews.com/article/capitol-siege-biden-donald-trump-government-and-politics-ca0fac7c1b33c5621eedff9edc3aa1f7","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":35,"title":"Biden facing pressure to extend student loan payment pause","shortDescription":"WASHINGTON (AP) — In the days and weeks before the midterm election, President Joe Biden trumpeted his plan to cancel billions in student loans as he rallied young people to support Democrats. But now the entire initiative is in jeopardy because of legal challenges that could ensure no one receives a dollar of debt relief.","url":"https://www.apnews.com/article/biden-business-education-government-and-politics-3f7971456f690281326a2f27b3772b30","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":37,"title":"Trump-backed Nevada GOP Senate candidate concedes loss","shortDescription":"LAS VEGAS (AP) — The Republican challenger to Democratic Sen. Catherine Cortez Masto in Nevada conceded on Tuesday that he lost, issuing statements saying that he won’t contest the result but calling mail-in balloting a “tactic” that tilted the balance.","url":"https://www.apnews.com/article/2022-midterm-elections-nevada-donald-trump-las-vegas-8cc38e3f5235222ec3561aa9ef75a47f","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":40,"title":"Voters OK drastic overhaul of City Hall in Portland, Oregon","shortDescription":"PORTLAND, Ore. (AP) — Voters in Portland, Oregon, driven by frustration with surging homelessness and a desire to make government more inclusive, have approved a ballot measure that will completely reinvent City Hall, ushering in seismic changes that local officials will have just two years to put in place.","url":"https://www.apnews.com/article/2022-midterm-elections-oregon-portland-homelessness-cc258eec39d938dab7dfa0e35972d7f7","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":42,"title":"‘Did not end well’: New Pence book details split with Trump","shortDescription":"NEW YORK (AP) — Former Vice President Mike Pence blames Donald Trump for endangering his family “and all those serving at the Capitol” on Jan.","url":"https://www.apnews.com/article/entertainment-donald-trump-14a7cef45932a38a57f2ed98601a7acd","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":44,"title":"Democrats sue for Saturday voting in Georgia Senate runoff","shortDescription":"ATLANTA (AP) — U.S. Sen. Raphael Warnock's campaign and Democratic groups are suing the state of Georgia to overturn guidance by Republican Secretary of State Brad Raffensperger that counties can't offer Saturday voting ahead of next month's Senate runoff election.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-lawsuits-georgia-958586396db5ed82c4d1291e9abe3690","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":45,"title":"Record 12 women to serve as governors, with notable firsts","shortDescription":"DES MOINES, Iowa (AP) — A record 12 women will take their seats as their state's highest-ranking elected officials when the nation's governors are sworn in this winter. The number tops the high mark set in 2004 of nine, with The Associated Press' calling the Arizona governor's election for Democrat Katie Hobbs on Monday, as well as Democrat Maura Healey in Massachusetts and Republican Sarah Huckabee Sanders in Arkansas winning last week's elections.","url":"https://www.apnews.com/article/2022-midterm-elections-sarah-huckabee-sanders-mike-congress-government-and-politics-4ecca44fdadbdb190b7daeda012bd536","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":46,"title":"Senate won for Democrats, ‘It’s the year of Chuck Schumer’","shortDescription":"WASHINGTON (AP) — Senate Majority Leader Chuck Schumer was eating Peking duck at a Chinese restaurant with family and friends on Manhattan’s West side on Saturday evening when an aide called with urgent news: Democrats would win Nevada’s Senate seat and keep their majority.","url":"https://www.apnews.com/article/congress-senate-control-schumer-f4ec767f528843858c42b2c90945dda6","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":47,"title":"Shapiro to take office with mandate from Pennsylvania voters","shortDescription":"HARRISBURG, Pa. (AP) — Josh Shapiro, the Democratic governor-elect of Pennsylvania, will take office with a decisive mandate from voters, who overwhelmingly rejected a Republican drive to pare back abortion rights and voting laws in the premier battleground state.","url":"https://www.apnews.com/article/2022-midterm-elections-abortion-voting-rights-josh-shapiro-health-5dcf8043b4d0cd0f33691ba4071f4a9c","source":"AP News","slug":"apnews","imageUrl":"","date":"November 15, 2022"},{"index":0,"title":"Ohio Republicans revive bill to change state election laws","shortDescription":"A sweeping overhaul to Ohio election law would change voter ID requirements and eliminate in-person early voting the Monday before Election Day.","url":"https://www.usatoday.com/story/news/politics/2022/11/18/bill-change-ohio-election-laws-voter-access/10726953002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/18"},{"index":1,"title":"Nancy Pelosi steps down as Speaker of the House","shortDescription":"Washington Bureau chief Susan Page reflects on Nancy Pelosi's career after she stepped down from her role as Speaker of the House.","url":"https://www.usatoday.com/videos/news/politics/2022/11/18/washington-bureau-chief-susan-page-reflects-pelosis-career/10726692002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/18"},{"index":3,"title":"Former Trump CFO on verge of tears as he testifies during tax fraud trial","shortDescription":"Former President Trump, who recently announced a 2024 White House bid, isn't charged in the case against two of his companies.","url":"https://www.usatoday.com/story/news/politics/2022/11/17/ex-trump-cfo-weisselberg-admits-breach-trust-during-tax-fraud-trial/10718544002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/17"},{"index":7,"title":"Biden slams Republicans on student debt plan","shortDescription":"President Joe Biden called Republican efforts to block student debt relief \"hypocritical.\"","url":"https://www.usatoday.com/videos/news/politics/2022/11/03/biden-slams-republican-outrage-against-student-debt-relief-plan/8260404001/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/03"},{"index":12,"title":"In a disappointing midterm, Republicans still captured the House; How?","shortDescription":"The GOP's most high-profile win was ousting New York Rep. Sean Patrick Maloney, who chaired party efforts through the Democratic Congressional Campaign Committee.","url":"https://www.usatoday.com/story/news/politics/2022/11/17/gop-wins-house-congress-biden/10718565002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/17"},{"index":13,"title":"Ending historic run, Nancy Pelosi ready to let other Democrats lead","shortDescription":"The groundbreaking House speaker says the attack on her husband made her more open to remaining in the House while stepping back from the leadership.","url":"https://www.usatoday.com/story/news/politics/2022/11/17/pelosi-house-democrats-speaker-future/10719286002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/17"},{"index":21,"title":"Marriage equality passes Senate procedural vote","shortDescription":"Twelve Republican senators voted with Democrats to break the filibuster for the Respect for Marriage Act.","url":"https://www.usatoday.com/videos/news/politics/2022/11/17/marriage-equality-bill-passes-key-senate-procedural-vote/10718972002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/17"},{"index":22,"title":"Analysis: How neither Warnock nor Walker won U.S. Senate race outright","shortDescription":"Georgia's midterm Senate race will go to a runoff Dec. 6. Democrat Sen. Raphael Warnock will face off against Republican Herschel Walker.","url":"https://www.usatoday.com/story/news/politics/elections/2022/11/17/georgia-senate-race-raphael-warnock-herschel-walker/10718569002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/17"},{"index":24,"title":"House GOP picks McCarthy as leader, Scott challenging McConnell: recap","shortDescription":"House Republicans kept Kevin McCarthy as their leader, making him the favorite to succeed Democrat Nancy Pelosi as the next House Speaker.","url":"https://www.usatoday.com/story/news/politics/2022/11/15/election-2022-congress-live-updates/10698859002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/15"},{"index":26,"title":"GOP Rep. Madison Cawthorn vacates offices weeks before end of term","shortDescription":"Rep. Madison Cawthorn, R-N.C., has apparently vacated his Washington and district offices nearly two months before the end of his term.","url":"https://www.usatoday.com/story/news/politics/2022/11/17/madison-cawthorn-nc-empty-offices/10718258002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/17"},{"index":27,"title":"House goes Red; Senate GOP sticks with Mitch McConnell as leader","shortDescription":"Republicans neared control of the House, as their GOP Senate counterparts were set to pick a new leader between Rick Scott and Mitch McConnell.","url":"https://www.usatoday.com/story/news/politics/2022/11/16/midterm-election-results-live-updates/10707397002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/16"},{"index":28,"title":"GOP reaches 218 set threshold to control House","shortDescription":"Following California’s House District 27 race, which was called for  Republican Mike Garcia, Republicans gained control of the House of Representatives.","url":"https://www.usatoday.com/videos/news/politics/2022/11/17/gop-gains-control-house-rep-kevin-mccarthy-poised-speaker/10716386002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/17"},{"index":29,"title":"Probes, impeachment, what else? The steps a GOP House might pursue","shortDescription":"When the GOP ends up taking at least some control of Congress, expect to see investigations, conservative legislation and possibly, impeachment.","url":"https://www.usatoday.com/story/news/politics/2022/11/07/republicans-congress-mccarthy-mcconnell-impeach-investigations/8265364001/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/07"},{"index":31,"title":"Senate defeats gay marriage filibuster, setting up final vote in near future","shortDescription":"Like abortion access, gay marriage was never codified by Congress because supporters wrongly believed the Supreme Court would never reverse precedent.","url":"https://www.usatoday.com/story/news/politics/2022/11/16/schumer-senate-vote-gay-marriage/10704463002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/16"},{"index":3,"title":"“We Need to Defend This Law”: Inside an Anti-Abortion Meeting With Tennessee’s GOP Lawmakers","shortDescription":"Anti-abortion groups helped write and pass laws that kicked in to ban abortion when Roe v. Wade was overturned. The groups see Tennessee’s ban as the country’s strongest — and they want to keep it that way, according to audio reviewed by ProPublica.","url":"https://www.propublica.org/article/inside-anti-abortion-meeting-with-tennessee-republican-lawmakers","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221114-Tennessee-Abortion-Lead-01.JPG","date":"Nov. 15"},{"index":14,"title":"Report Finds “Code of Silence” at Mental Health Facility Where Staff Abused and Neglected Patients","shortDescription":"A newly released report from an agency watchdog echoes reporting published earlier this year that revealed widespread collusion to cover up misconduct at the Illinois facility.","url":"https://www.propublica.org/article/illinois-choate-abuse-code-of-silence","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221111-Choate-OIG-Lead-01.JPG","date":"Nov. 11"},{"index":2,"title":"N.Y. Democrats Blame Eric Adams for Election Losses. He Doesn’t Care.","shortDescription":"The New York City mayor focuses relentlessly on crime, and critics say he lent legitimacy to Republicans who played up the issue in their midterms campaigns.By Emma G. Fitzsimmons and Jeffery C. Mays","url":"https://www.nytimes.com/2022/11/18/nyregion/eric-adams-midterms-democrats-crime.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/18/nyregion/18adams-midterms1/merlin_216286257_5054496a-c45f-4110-9c9a-7abc0c2f176b-thumbWide.jpg","date":"2022/11/18"},{"index":3,"title":"Pelosi’s Decision to Step Aside Paves Path for a New Generation of Democrats","shortDescription":"Representatives Hakeem Jeffries of New York, Katherine Clark of Massachusetts and Pete Aguilar of California were widely expected to seek the top three slots.By Emily Cochrane and Annie Karni","url":"https://www.nytimes.com/2022/11/17/us/politics/pelosi-jeffries-clark-house-democrats.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/17/us/politics/17dc-dems-1/merlin_216812013_833deef0-5054-4ccb-8cac-3d69fdf4c0e0-thumbWide.jpg","date":"2022/11/17"},{"index":4,"title":"Why Republicans’ Wafer-Thin House Majority Is a Gift for Democrats","shortDescription":"Democrats would have loved to keep the chamber. But politically, being in the minority will have its benefits.By Blake Hounshell","url":"https://www.nytimes.com/2022/11/17/us/politics/republicans-house-biden-democrats.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/17/multimedia/17onpolitics-gop-1-3867/17onpolitics-gop-1-3867-thumbWide.jpg","date":"2022/11/17"},{"index":0,"title":"Dems get in array on future leadership after Pelosi departs","shortDescription":"Lawmakers have managed to stealthily defuse rivalries for nearly every position at the top of the House caucus, despite their three major leadership retirements.","url":"https://www.politico.com/news/2022/11/18/house-dems-leadership-roles-pelosi-00069334","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/18"},{"index":8,"title":"Victorious House Republicans describe plans to investigate Biden","shortDescription":"","url":"https://www.politico.com/news/2022/11/16/victorious-house-republicans-investigate-biden-00068702","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/16"},{"index":11,"title":"GOP civil war spreads to Georgia runoff","shortDescription":"","url":"https://www.politico.com/news/2022/11/17/trump-georgia-senate-race-00068079","source":"Politico","slug":"politico","imageUrl":"","date":"2022/11/17"},{"index":14,"title":"Zeldin moves closer to bid for GOP chair","shortDescription":"","url":"https://www.politico.com/news/2022/11/17/zeldin-moves-closer-to-bid-for-gop-chair-00069254","source":"Politico","slug":"politico","imageUrl":"","date":"2022/11/17"}]