[{"index":0,"title":"Young voters’ enthusiasm for Democrats waned during midterms","shortDescription":"WASHINGTON (AP) — Young voters who have been critical to Democratic successes in recent elections showed signs in November's midterms that their enthusiasm may be waning, a potential warning sign for a party that will need their strong backing heading into the 2024 presidential race.","url":"https://www.apnews.com/article/2022-midterm-elections-biden-politics-pennsylvania-state-government-a42e61b5a9fa590dabd1e61762fac31b","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":1,"title":"China casts long shadow over US-Africa Leaders Summit","shortDescription":"WASHINGTON (AP) — With dozens of African leaders descending on Washington this week, the Biden administration is offering a not-so-subtle pitch in its economic competition with China on the continent: The U.S.","url":"https://www.apnews.com/article/g-20-summit-politics-covid-china-government-united-states-46a01f4190fae4ca260f0ab5beaa59a5","source":"AP News","slug":"apnews","imageUrl":"","date":"December 13, 2022"},{"index":3,"title":"Supreme Court won’t block California flavored tobacco ban","shortDescription":"WASHINGTON (AP) — The Supreme Court on Monday refused a request from tobacco companies to stop California from enforcing a ban on flavored tobacco products that was overwhelmingly approved by voters in November.","url":"https://www.apnews.com/article/business-california-state-government-and-politics-4f637d4495268919f8e6593442ae5724","source":"AP News","slug":"apnews","imageUrl":"","date":"December 13, 2022"},{"index":5,"title":"Congress eyes one week of funding to avoid gov’t shutdown","shortDescription":"WASHINGTON (AP) — Lawmakers should be prepared to act quickly to pass a resolution funding the federal government for one week as negotiators continue to work on a longer-term spending bill, Senate Majority Leader Chuck Schumer said Monday.","url":"https://www.apnews.com/article/ukraine-government-united-states-and-politics-2bf19611ab2ec40425a62d1a848f0a46","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":6,"title":"Trump probe subpoena served on Georgia secretary of state","shortDescription":"ATLANTA (AP) — Nevada’s most populous county and Georgia Secretary of State Brad Raffensperger have received subpoenas related to special counsel Jack Smith’s investigation of former President Donald Trump, who focused strongly on the states as he sought to overturn his 2020 election loss.","url":"https://www.apnews.com/article/capitol-siege-politics-georgia-atlanta-subpoenas-07a6acf3de8ecaf50c60b32a1e653981","source":"AP News","slug":"apnews","imageUrl":"","date":"December 13, 2022"},{"index":7,"title":"Recount confirms Lauren Boebert narrowly held her House seat","shortDescription":"DENVER (AP) — An automatic recount confirmed Monday that Republican Rep. Lauren Boebert won her reelection bid against Democrat Adam Frisch. The nail-biter race showed the congresswoman's combative style is wearying voters in her conservative Colorado district.","url":"https://www.apnews.com/article/2022-midterm-elections-colorado-race-and-ethnicity-united-states-government-56e2e40f33117db7eca957fac7f0a8db","source":"AP News","slug":"apnews","imageUrl":"","date":"December 13, 2022"},{"index":8,"title":"Youngkin sets special election to fill Rep. McEachin’s seat","shortDescription":"RICHMOND, Va. (AP) — Virginia Gov. Glenn Youngkin set a special election for Feb. 21 to fill the 4th Congressional District seat of the late Democratic Rep. A. Donald McEachin, as the field of candidates seeking the post grew on Monday.","url":"https://www.apnews.com/article/richmond-north-carolina-state-government-virginia-445f33254e8e7f15a533f05c77f75881","source":"AP News","slug":"apnews","imageUrl":"","date":"December 13, 2022"},{"index":9,"title":"Prosecutor: Oath Keepers saw Jan. 6 as ‘first battle’ in war","shortDescription":"WASHINGTON (AP) — Four Oath Keepers charged with plotting to stop the transfer of presidential power from Donald Trump to Joe Biden accepted an “invitation to sedition” issued by the far-right extremist group’s founder, a federal prosecutor said Monday at the start of a second trial for group leaders and members.","url":"https://www.apnews.com/article/biden-us-department-of-justice-united-states-government-and-politics-1cb813cae5a11ca8df8cd1c08a170328","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":10,"title":"Anger in rural areas fuel protests against Peru government","shortDescription":"ANDAHUAYLAS, Peru (AP) — The anger of Peruvians against their government is nowhere more visible than in Andahuaylas, a remote rural Andean community where the poor have struggled for years and where voters' support helped elect now-ousted President Pedro Castillo, himself a peasant like them.","url":"https://www.apnews.com/article/politics-peru-caribbean-covid-6921c3c8bcf95f654b70d8de39dfc550","source":"AP News","slug":"apnews","imageUrl":"","date":"December 13, 2022"},{"index":11,"title":"Senators want answers in wake of AP’s prison investigations","shortDescription":"The chairman of the Senate Judiciary Committee said he plans to question the director of the federal Bureau of Prisons this week about an Associated Press investigation that found the agency has repeatedly promoted and continues to stand by a high-ranking official who beat Black inmates in the 1990s.","url":"https://www.apnews.com/article/politics-prisons-california-merrick-garland-us-department-of-justice-d04a61e7582305ac0b3b3a5e21df4e70","source":"AP News","slug":"apnews","imageUrl":"","date":"December 13, 2022"},{"index":14,"title":"Biden forms interagency group to draft antisemitism strategy","shortDescription":"WASHINGTON (AP) — Amid a surge in hateful rhetoric and violence, President Joe Biden on Monday formed a new interagency group to develop a national strategy to combat antisemitism, the White House announced.","url":"https://www.apnews.com/article/biden-charlottesville-united-states-government-and-politics-0a043c16af6aa026a588633000150e9c","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":17,"title":"West Virginia health secretary Crouch to retire in December","shortDescription":"CHARLESTON, W.Va. (AP) — West Virginia Department of Health and Human Resources Cabinet Secretary Bill Crouch is retiring at the end of the year, Gov. Jim Justice said Monday. Dr. Jeffrey Coben will step in as interim secretary, the Republican governor announced.","url":"https://www.apnews.com/article/politics-health-west-virginia-us-department-of-and-human-services-jim-justice-7b0df81dcedf3cfda7990e84ae1fa89b","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":21,"title":"US hits Zimbabwe president’s son with sanctions","shortDescription":"WASHINGTON (AP) — The Biden administration on Monday slapped corruption sanctions on the son of Zimbabwe’s president as the U.S. prepares to host a major summit of African leaders in Washington.","url":"https://www.apnews.com/article/politics-zimbabwe-democracy-emmerson-mnangagwa-united-states-government-c93f23ede458b5ecacf86dc6014cdf8e","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":22,"title":"Bidens spread holiday cheer at Toys for Tots event","shortDescription":"ARLINGTON, Va. (AP) — President Joe Biden and first lady Jill Biden helped pack presents for children and encouraged holiday cheer as the White House marked the 75th anniversary of Toys for Tots at an event hosted by the U.S.","url":"https://www.apnews.com/article/biden-children-united-states-government-and-politics-86199ae96dc4ef0c1b8b313079d62262","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":24,"title":"House panel OKs voting law rewrite, 60% ballot question","shortDescription":"COLUMBUS, Ohio (AP) — Over the strenuous objections of voting rights groups, Ohio House Republicans advanced two proposals Monday that would add a host of new restrictions to voting and place an issue on next year's ballot that calls for requiring a 60% supermajority to pass future constitutional amendments.","url":"https://www.apnews.com/article/politics-ohio-state-government-and-d986d0a7842778d8571ce72938f6ba2f","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":27,"title":"Biden restarts task force on immigrants’ success in US","shortDescription":"WASHINGTON (AP) — The Biden administration is reinstating a task force that is aimed at helping immigrants and refugees integrate into the United States.The Task Force on New Americans will be run by the Domestic Policy Council and the focus will be workforce training, education and financial access as well as language learning and the health of immigrants who have green cards and other types of legal status, according to the White House.","url":"https://www.apnews.com/article/politics-donald-trump-covid-barack-obama-united-states-government-7352574ad61c313bee0a46973581474d","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":33,"title":"Young voters’ enthusiasm for Democrats waned during midterms","shortDescription":"WASHINGTON (AP) — Young voters who have been critical to Democratic successes in recent elections showed signs in November’s midterms that their enthusiasm may be waning, a potential warning sign for a party that will need their strong backing heading into the 2024 presidential race.","url":"https://www.apnews.com/article/2022-midterm-elections-biden-pennsylvania-state-government-united-states-b050facf837de805d82f480fbdf6a8ea","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":36,"title":"Democratic lawmakers visit Havana, meet with Cuban president","shortDescription":"HAVANA (AP) — A delegation of at least three U.S. lawmakers visited Havana and met with Cuba’s government this week, American and Cuban officials confirmed.Reps. James McGovern (D-MA), Mark Pocan (D-WI) and Troy Carter (D-LA) met with Cuban President Miguel Díaz-Canel, leaders in Cuba’s congress and its foreign minister, the U.S.","url":"https://www.apnews.com/article/politics-cuba-caribbean-havana-james-mcgovern-298c8d13d2cf44ca536c403ab44a336c","source":"AP News","slug":"apnews","imageUrl":"","date":"December 11, 2022"},{"index":39,"title":"Shreveport elects its first Republican mayor in 28 years","shortDescription":"SHREVEPORT, La. (AP) — Voters in Louisiana's third-largest city have elected a Republican mayor for the first time in 28 years.Tom Arceneaux, 71, won a runoff election Saturday to become the next mayor of Shreveport.","url":"https://www.apnews.com/article/shreveport-c1d2d698db67396098b0beda4488024b","source":"AP News","slug":"apnews","imageUrl":"","date":"December 11, 2022"},{"index":40,"title":"Election nonprofit that drew GOP ire in 2020 renews grants","shortDescription":"MADISON, Wis. (AP) — A nonprofit group that became a point of controversy for distributing hundreds of millions of dollars in election grants during the 2020 presidential campaign is releasing a fresh round of money to local election offices, including in states where Republican lawmakers tried to ban the practice.","url":"https://www.apnews.com/article/2022-midterm-elections-united-states-government-and-politics-78e0e0d548df9023aeac1c9c690b48f8","source":"AP News","slug":"apnews","imageUrl":"","date":"December 11, 2022"},{"index":41,"title":"Biden aims to narrow trust gap with US-Africa leaders summit","shortDescription":"WASHINGTON (AP) — President Joe Biden is set to play host to dozens of African leaders in Washington this week as the White House looks to narrow a gaping trust gap with Africa — one that has grown wider over years of frustration about America's commitment to the continent.","url":"https://www.apnews.com/article/biden-politics-china-africa-covid-D91f14e95e592802dc056bef6ac72024","source":"AP News","slug":"apnews","imageUrl":"","date":"December 11, 2022"},{"index":42,"title":"Biden aims to narrow trust gap with US-Africa leaders summit","shortDescription":"WASHINGTON (AP) — President Joe Biden is set to play host to dozens of African leaders in Washington this week as the White House looks to narrow a gaping trust gap with Africa — one that has grown wider over years of frustration about America's commitment to the continent.","url":"https://www.apnews.com/article/biden-politics-china-africa-covid-d91f14e95e592802dc056bef6ac72024","source":"AP News","slug":"apnews","imageUrl":"","date":"December 11, 2022"},{"index":47,"title":"Kosovo postpones election in ethnic-Serb-dominated north","shortDescription":"PRISTINA, Kosovo (AP) — Kosovo on Saturday postponed a local election due Dec. 18 in four municipalities with a predominantly ethnic Serb population, in an effort to defuse recent tensions there that have also caused relations with neighboring Serbia to deteriorate further.","url":"https://www.apnews.com/article/politics-serbia-kosovo-government-cb97bdd10963181461cc76a312d31a32","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":49,"title":"Nobel Peace Prize winners blast Putin’s invasion of Ukraine","shortDescription":"OSLO, Norway (AP) — The winners of this year's Nobel Peace Prize from Belarus, Russia and Ukraine shared their visions of a fairer world and denounced Russian President Vladimir Putin's war in Ukraine during Saturday’s award ceremony in the Norwegian capital.","url":"https://www.apnews.com/article/russia-ukraine-putin-politics-nobel-prizes-government-a4b373795a5d709b3ed59405aba67818","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":0,"title":"Judge tosses Trump's lawsuit, ending special master review of Mar-a-Lago records","shortDescription":"A federal judge dismissed Donald Trump's lawsuit seeking a special master review of documents seized at Mar-a-Lago, based on an appeals court order.","url":"https://www.usatoday.com/story/news/politics/2022/12/12/judge-dismisses-trump-lawsuit-mar-a-lago/10852139002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/12"},{"index":8,"title":"White House slams Marjorie Taylor Greene's 'abhorrent' Jan. 6 remarks","shortDescription":"Rep. Marjorie Taylor Greene, R-Ga., said if she and Steve Bannon had organized the Jan. 6 riot \"we would have won\" and \"it would've been armed.\"","url":"https://www.usatoday.com/story/news/politics/2022/12/12/white-house-condemns-marjorie-taylor-greenes-comments-jan-6/10882142002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/12"},{"index":9,"title":"Sam Bankman-Fried, ex-crypto exchange CEO, to testify before Congress Tuesday","shortDescription":"Sam Bankman-Fried oversaw the downfall of the FTX crypto exchange before resigning as CEO. The hearing Tuesday is at 10 a.m. EST.","url":"https://www.usatoday.com/story/news/2022/12/09/sbf-ftx-congress-committee/10864901002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":10,"title":"Supreme Court to hear second case on Biden's student loan forgiveness","shortDescription":"The latest emergency appeal from the Biden administration means there are now two separate cases on the loan forgiveness plan at the Supreme Court.","url":"https://www.usatoday.com/story/news/politics/2022/12/12/biden-supreme-court-student-loan-forgiveness/10809902002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/12"},{"index":15,"title":"White House defends Brittney Griner swap with Russian arms dealer Bout","shortDescription":"Brittney Griner returned to the United States after being detained in Russia since February. The White House is negotiating Paul Whelan's return.","url":"https://www.usatoday.com/story/news/politics/2022/12/11/brittney-griner-paul-whelan-viktor-bout-white-house/10877741002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/11"},{"index":16,"title":"Biden hopes to draw Africa closer during Washington summit despite China and Russia influence","shortDescription":"President Biden would use the summit of African leaders to declare his support for adding the African Union as a permanent member of the G-20 nations.","url":"https://www.usatoday.com/story/news/politics/2022/12/11/amid-growing-china-russia-influence-biden-hopes-draw-africa-closer/10877757002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/11"},{"index":19,"title":"Nonfatal opioid overdoses by state: White House launches new data map","shortDescription":"The data dashboard on nonfatal opioid overdoses will target specific regions to help fight the epidemic, which left 81,000 dead in the US this year.","url":"https://www.usatoday.com/story/news/health/2022/12/08/opioid-epidemic-white-house-launches-dashboard-tracking-overdoses/10850708002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":20,"title":"Did Georgia voting law affect midterm election turnout? It's not clear.","shortDescription":"Civil rights groups said Georgia's new voting laws passed by the GOP-controlled legislature amounted to suppression, even as voter turnout peaked.","url":"https://www.usatoday.com/story/news/politics/2022/12/10/georgia-runoff-midterm-law-voting-changes/10871937002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/10"},{"index":22,"title":"Democrats in 'tight spot' after Sinema's departure from national party","shortDescription":"Political experts told USA TODAY that Sinema's move complicates Democrats' ability to hold onto the Arizona Senate seat, and Senate control, in 2024.","url":"https://www.usatoday.com/story/news/politics/2022/12/10/2024-senate-democrats-presidency-sinema/10865317002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/10"},{"index":24,"title":"Supreme Court to hear First Amendment case on immigration fraud","shortDescription":"The case arrives at the Supreme Court two years after the justices settled a similar dispute over the immigration law on procedural grounds.","url":"https://www.usatoday.com/story/news/politics/2022/12/09/supreme-court-first-amendment-immigration-fraud/10863828002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":26,"title":"Incoming member of Congress denied for DC apartment","shortDescription":"Maxwell Frost made history as the first member of Gen Z to be elected to Congress.  That didn’t help him get an apartment in the nation’s capital.","url":"https://www.usatoday.com/story/news/politics/2022/12/09/florida-congressman-maxwell-frost-washington-dc-apartment/10866222002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":27,"title":"What Sinema's announcement and Warnock's win mean for the Senate","shortDescription":"Democratic Sen. Raphael Warnock won a Georgia Senate runoff Tuesday. Days later, Arizona's Kyrsten Sinema said she was leaving the Democratic Party.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/09/senate-biden-warnock-manchin-sinema/10846300002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":31,"title":"A shakeup in the Senate; Sinema switches party from Dem to independent","shortDescription":"Sen. Kyrsten Sinema, who has voted with both parties, will keep her committee assignments, but wouldn't say if she will caucus with Democrats.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/09/senator-kyrsten-sinema-independent-senate-impact/10864561002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":2,"title":"Lauren Boebert, Far-Right Firebrand, Wins Re-election After Recount","shortDescription":"Ms. Boebert defeated Adam Frisch in Colorado’s Republican-leaning Third District to win a second term in the House.By Jazmine Ulloa and Neil Vigdor","url":"https://www.nytimes.com/2022/12/12/us/politics/lauren-boebert-colorado-elected.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/12/multimedia/12pol-boebert-1-aa32/12pol-boebert-1-aa32-thumbWide.jpg","date":"2022/12/12"},{"index":3,"title":"Two Decades After 9/11 Inquiry, a Similar Plan for Covid Stalls in Congress","shortDescription":"The 9/11 Commission prompted a national reckoning over the Sept. 11 attacks. But some experts fear that the chance to create an independent panel to investigate the pandemic response is slipping away.By Sheryl Gay Stolberg","url":"https://www.nytimes.com/2022/12/12/us/politics/covid-commission-congress.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/09/multimedia/00DC-VIRUS-COMMISSION--1-ce6c/00DC-VIRUS-COMMISSION--1-ce6c-thumbWide.jpg","date":"2022/12/09"},{"index":5,"title":"Alexandra Pelosi on Filming Her Mother, Nancy Pelosi, During the Jan. 6 Attack","shortDescription":"The documentary had long been in the works and was nearly finished before Paul Pelosi was assaulted at home. The events together have left the director shaken.By Melena Ryzik","url":"https://www.nytimes.com/2022/12/12/movies/pelosi-jan-6-attack-alexandra.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/13/multimedia/pelosi-doc-1-e3e4/pelosi-doc-1-e3e4-thumbWide.jpg","date":"2022/12/13"},{"index":6,"title":"Indian Country Needs Money to Protect Its Wildlife Heritage. Congress Must Help.","shortDescription":"Losses of animals and plants represent a fundamental threat to how Native peoples practice their religions and pass on their cultures.By Gloria Tom","url":"https://www.nytimes.com/2022/12/12/opinion/congress-native-american-widlife.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/12/multimedia/12tom-top-1-0848/12tom-top-1-0848-thumbWide.jpg","date":"2022/12/12"},{"index":9,"title":"Sinema Adds Intrigue and Democratic Fury to Arizona’s 2024 Senate Race","shortDescription":"Senator Kyrsten Sinema’s announcement that she would become an independent left Democrats in her state, many of whom have long wanted to defeat her in a primary, facing a new political calculus.By Reid J. Epstein, Jennifer Medina and Katie Glueck","url":"https://www.nytimes.com/2022/12/09/us/politics/kyrsten-sinema-arizona-senate-democrats.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/09/multimedia/09POL-ARIZONA-1-9ea1/09POL-ARIZONA-1-9ea1-thumbWide.jpg","date":"2022/12/09"},{"index":10,"title":"Leaders Back Away From Raising Debt Ceiling, Punting Clash to New Congress","shortDescription":"Some Democrats had hoped to act on the issue before their party loses unified control of Congress, but a lack of political will and time appears to have sapped momentum for doing so.By Emily Cochrane","url":"https://www.nytimes.com/2022/12/09/us/politics/congress-debt-ceiling.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/09/multimedia/09DC-DEBT-1-4dc5/09DC-DEBT-1-4dc5-thumbWide.jpg","date":"2022/12/09"},{"index":0,"title":"Dems agonize over Sinema 2024","shortDescription":"If the newly minted Arizona independent seeks reelection, she could set up a three-way race that puts her former party in a perilous position in a swing state.","url":"https://www.politico.com/news/2022/12/12/2024-sinema-dems-senate-00073594","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/12"},{"index":1,"title":"Spending talks closer to a deal — but still lacking DeLauro’s buy-in","shortDescription":"","url":"https://www.politico.com/news/2022/12/12/delauro-spending-deal-budget-shutdown-00073570","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/12"},{"index":2,"title":"Schumer warns antisemitism is on the rise, calls out Trump at event","shortDescription":"","url":"https://www.politico.com/video/2022/12/12/schumer-warns-antisemitism-is-on-the-rise-calls-out-trump-at-event-794075","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/12"},{"index":3,"title":"Trump who? GOP senators rave over a potential Tim Scott presidential run.","shortDescription":"","url":"https://www.politico.com/news/2022/12/12/trump-gop-senators-tim-scott-presidential-00073280","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/12"},{"index":4,"title":"Term-limit plan sparks generational battle among House Dems","shortDescription":"","url":"https://www.politico.com/news/2022/12/12/house-dems-term-limits-generational-shift-00073306","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/12"},{"index":5,"title":"What the Jan. 6 select committee’s final report will look like","shortDescription":"","url":"https://www.politico.com/news/2022/12/12/jan-6-select-committee-final-report-00073402","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/12"},{"index":6,"title":"‘It’s not a principle change’: Lawmakers dissect Sinema switch","shortDescription":"","url":"https://www.politico.com/news/2022/12/11/sinema-arizona-independent-party-switch-00073383","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/11"},{"index":7,"title":"Wanted by McCarthy critics: 1 qualified alternative speaker","shortDescription":"","url":"https://www.politico.com/news/2022/12/11/mccarthy-speaker-alternatives-republicans-00073319","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/11"},{"index":8,"title":"Don’t worry, be a majority: Dems shrug off Sinema’s switch","shortDescription":"","url":"https://www.politico.com/news/2022/12/09/kyrsten-sinemas-switch-democrats-00073327","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/09"},{"index":9,"title":"Sinema party switch jumpstarts Arizona's 2024 Senate battle","shortDescription":"","url":"https://www.politico.com/news/2022/12/09/sinema-party-arizona-senate-2024-00073301","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/09"},{"index":10,"title":"Trump who? GOP senators rave over a potential Tim Scott presidential run.","shortDescription":"","url":"https://www.politico.com/news/2022/12/12/trump-gop-senators-tim-scott-presidential-00073280","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/12"},{"index":12,"title":"Why the Republican Party Just Can’t Quit Trump","shortDescription":"","url":"https://www.politico.com/news/magazine/2022/12/11/rnc-trump-mcdaniel-election-losses-00073343","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/11"},{"index":13,"title":"Christie blasts Trump over Georgia Senate loss","shortDescription":"","url":"https://www.politico.com/news/2022/12/11/christie-trump-herschel-walker-georgia-runoff-00073380","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/11"}]