[{"index":0,"title":"Ga. Senate runoff between Warnock, Walker has bitter closing","shortDescription":"WARNER ROBINS, Ga. (AP) — Ads with the candidates’ ex-wives. Cries of “liar” flying in both directions. Stories of a squalid apartment building and abortions under pressure.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-sports-religion-georgia-9ba48d67d6c4d18c9a11e5dc852bba9f","source":"AP News","slug":"apnews","imageUrl":"","date":"November 27, 2022"},{"index":1,"title":"Jon Batiste to sing for Macron at Biden’s 1st state dinner","shortDescription":"NANTUCKET, Mass. (AP) — Musician Jon Batiste is on tap to perform at President Joe Biden's first White House state dinner on Thursday that will highlight long-standing ties between the United States and France and honor President Emmanuel Macron.","url":"https://www.apnews.com/article/biden-entertainment-tv-jill-a83a59aaec274cc630681f808c53c4d5","source":"AP News","slug":"apnews","imageUrl":"","date":"November 27, 2022"},{"index":2,"title":"Trump faulted for dinner with white nationalist, rapper Ye","shortDescription":"NEW YORK (AP) — Former President Donald Trump is renewing attention to his long history of turning a blind eye to bigotry after dining with a Holocaust-denying white nationalist and the rapper formerly known as Kanye West just days into his third campaign for the White House.","url":"https://www.apnews.com/article/2022-midterm-elections-kanye-west-entertainment-donald-trump-21ea30fc30a9a97074581015b25e18bf","source":"AP News","slug":"apnews","imageUrl":"","date":"November 26, 2022"},{"index":3,"title":"New state voter fraud units finding few cases from midterms","shortDescription":"WASHINGTON (AP) — State-level law enforcement units created after the 2020 presidential election to investigate voter fraud are looking into scattered complaints more than two weeks after the midterms but have provided no indication of systemic problems.","url":"https://www.apnews.com/article/2022-midterm-elections-voting-rights-florida-georgia-4db14ddccf37e4597cb9b7f20ec499b4","source":"AP News","slug":"apnews","imageUrl":"","date":"November 26, 2022"},{"index":4,"title":"Hawaii Gov. Ige looks back on coronavirus, tourism shutdown","shortDescription":"HONOLULU (AP) — As Hawaii's governor, David Ige faced a volcanic eruption that destroyed 700 homes, protests blocking construction of a cutting-edge multibillion-dollar telescope and a false alert about an incoming ballistic missile.","url":"https://www.apnews.com/article/health-covid-hawaii-honolulu-david-ige-bddd7d7c00b1d1e5c6fd60e3dc40130e","source":"AP News","slug":"apnews","imageUrl":"","date":"November 27, 2022"},{"index":5,"title":"Biden eases Venezuela sanctions as opposition talks resume","shortDescription":"WASHINGTON (AP) — The Biden administration on Saturday eased some oil sanctions on Venezuela in an effort to support newly restarted negotiations between President Nicolás Maduro’s government and its opposition.","url":"https://www.apnews.com/article/business-government-and-politics-1ed77687eb907d61cfaf4ba377daf516","source":"AP News","slug":"apnews","imageUrl":"","date":"November 26, 2022"},{"index":6,"title":"Biden, family hit Nantucket stores for some holiday shopping","shortDescription":"NANTUCKET, Mass. (AP) — President Joe Biden went holiday shopping on the Massachusetts resort island where he spends Thanksgiving, patronizing smaller independently owned stores on what the retail industry has called “Small Business Saturday.”","url":"https://www.apnews.com/article/biden-massachusetts-holidays-thanksgiving-c31b2ed7f034042665f55c73d4a5f8a5","source":"AP News","slug":"apnews","imageUrl":"","date":"November 26, 2022"},{"index":7,"title":"Emboldened Biden, Dems push ban on so-called assault weapons","shortDescription":"WASHINGTON (AP) — When President Joe Biden speaks about the “scourge” of gun violence, his go-to answer is to zero in on so-called assault weapons.","url":"https://www.apnews.com/article/biden-gun-violence-colorado-shootings-f85b4b9a59e3852868950d797f79a351","source":"AP News","slug":"apnews","imageUrl":"","date":"November 25, 2022"},{"index":8,"title":"Biden, family attend Christmas tree lighting on Nantucket","shortDescription":"NANTUCKET, Mass. (AP) — The Biden family's tradition of eating lunch, shopping and watching a Christmas tree lighting in downtown Nantucket on Friday became mostly about keeping the president's 2-year-old grandson from having a meltdown.","url":"https://www.apnews.com/article/biden-shopping-christmas-government-and-politics-b469b25acfa62767d2539ce222815913","source":"AP News","slug":"apnews","imageUrl":"","date":"November 26, 2022"},{"index":9,"title":"Midterms free of feared chaos as voting experts look to 2024","shortDescription":"Before Election Day, anxiety mounted over potential chaos at the polls.","url":"https://www.apnews.com/article/2022-midterm-elections-voting-rights-biden-donald-trump-georgia-f8c71ee4eaa313c30459a1646b8aa871","source":"AP News","slug":"apnews","imageUrl":"","date":"November 25, 2022"},{"index":10,"title":"Lake seeks election records in suit against Arizona county","shortDescription":"PHOENIX (AP) — Kari Lake, the defeated Republican candidate for Arizona governor, has filed a public records lawsuit demanding Maricopa County hand over a variety of documents related to the election.","url":"https://www.apnews.com/article/2022-midterm-elections-lawsuits-arizona-phoenix-3d11510fc4130cba1640ef702486b536","source":"AP News","slug":"apnews","imageUrl":"","date":"November 25, 2022"},{"index":11,"title":"Murkowski withstands another conservative GOP challenger","shortDescription":"JUNEAU, Alaska (AP) — U.S. Sen. Lisa Murkowski, a moderate Republican, has twice withstood challenges from more conservative factions of her party; more than a decade ago, she mounted a historical write-in campaign to beat a tea party favorite, and this year she won reelection after inflaming the ire of former President Donald Trump.","url":"https://www.apnews.com/article/2022-midterm-elections-donald-trump-alaska-b2ea0aa87460b0d5bee6565acf05288d","source":"AP News","slug":"apnews","imageUrl":"","date":"November 25, 2022"},{"index":12,"title":"EU, US edging toward trade spat when both want unity instead","shortDescription":"BRUSSELS (AP) — The European Union and the United States are treading precariously close to a major trans-Atlantic trade dispute at a time when the two Western giants want to show unity in the face of challenges from Russia and China.","url":"https://www.apnews.com/article/inflation-business-china-united-states-global-trade-658d22381599d9266646a1f169a9c922","source":"AP News","slug":"apnews","imageUrl":"","date":"November 25, 2022"},{"index":13,"title":"Biden brings Thanksgiving pies to Nantucket first responders","shortDescription":"NANTUCKET, Mass. (AP) — President Joe Biden on Thursday delivered at least half a dozen pumpkin pies to Massachusetts firefighters during a Thanksgiving Day show of appreciation and his toddler grandson walked away with a red fire hat topping his blond curls.","url":"https://www.apnews.com/article/biden-massachusetts-holidays-thanksgiving-7dea2cb8de7321b180b2581592e61214","source":"AP News","slug":"apnews","imageUrl":"","date":"November 25, 2022"},{"index":15,"title":"Next act for Palin unclear after Alaska House losses","shortDescription":"JUNEAU, Alaska (AP) — Republican Sarah Palin re-emerged in Alaska politics over a decade after resigning as governor with hopes of winning the state’s U.S. House seat. She had a lot going for her: unbeatable name recognition, the backing of former President Donald Trump in a state he carried twice, an unrivaled ability to attract national media attention.","url":"https://www.apnews.com/article/2022-midterm-elections-sarah-palin-donald-trump-4d8a0ed7845288d67adb3970a67e9ff9","source":"AP News","slug":"apnews","imageUrl":"","date":"November 24, 2022"},{"index":16,"title":"US aid to Ukraine puts pressure on Pentagon’s arms stockpile","shortDescription":"WASHINGTON (AP) — The intense firefight over Ukraine has the Pentagon rethinking its weapons stockpiles.","url":"https://www.apnews.com/article/russia-ukraine-europe-business-china-united-states-5c742d2b4775fb98c175f9c93ceda5fb","source":"AP News","slug":"apnews","imageUrl":"","date":"November 24, 2022"},{"index":17,"title":"GOP’s Lisa Murkowski wins reelection in Alaska Senate race","shortDescription":"JUNEAU, Alaska (AP) — Alaska Republican U.S. Sen. Lisa Murkowski has won reelection, defeating Donald Trump-endorsed GOP rival Kelly Tshibaka.Murkowski beat Tshibaka in the Nov. 8 ranked choice election.","url":"https://www.apnews.com/article/2022-midterm-elections-donald-trump-alaska-223ea5a590c1b9c4f7905ab4b7849e6f","source":"AP News","slug":"apnews","imageUrl":"","date":"November 24, 2022"},{"index":18,"title":"Mike Dunleavy is 1st Alaska governor reelected since ’98","shortDescription":"JUNEAU, Alaska (AP) — Alaska Republican Gov. Mike Dunleavy has won reelection, becoming the first governor in the state since 1998 to win back-to-back terms.Dunleavy received over 50% of the vote after final tallies were released Wednesday, and the race did not go to ranked choice voting.","url":"https://www.apnews.com/article/2022-midterm-elections-business-alaska-bill-walker-acfca581940b7d4045df3f2e13f1538d","source":"AP News","slug":"apnews","imageUrl":"","date":"November 24, 2022"},{"index":19,"title":"GOP Gov Ducey welcomes Dem Hobbs though no Lake concession","shortDescription":"PHOENIX (AP) — Outgoing Arizona Gov. Doug Ducey said Wednesday his Republican administration will ensure an orderly transition to Democrat Katie Hobbs, his first public statement on her victory.","url":"https://www.apnews.com/article/2022-midterm-elections-arizona-phoenix-doug-ducey-government-and-politics-1424be6b938d47a27a81c007aab5bade","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":21,"title":"US sending Ukraine $400 million in ammunition, generators","shortDescription":"WASHINGTON (AP) — The U.S. is sending an additional $400 million in ammunition and generators to Ukraine, the White House announced Wednesday, and is pulling the gear from its own stockpiles to get the support to Kyiv as fast as possible as Russia continues to target Ukraine's energy sources and winter sets in.","url":"https://www.apnews.com/article/russia-ukraine-kyiv-europe-government-and-politics-06f7d7958e3a0f44746918c2d6c5dab1","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":22,"title":"Doubts about candidates tipped the scales in tightest races","shortDescription":"ATLANTA (AP) — Casting his vote this month in one of the most politically competitive states in the U.S., Seung Lee happily backed Georgia Republican Gov. Brian Kemp's reelection.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-atlanta-congress-6313787298bbd5102435ae1228045ab2","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":23,"title":"Georgia high court allows Saturday voting for Senate runoff","shortDescription":"ATLANTA (AP) — Georgia counties will be allowed to hold early voting this Saturday in the U.S. Senate runoff election between Democratic incumbent Raphael Warnock and Republican challenger Herschel Walker, under a Wednesday ruling from the state Supreme Court.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-georgia-atlanta-a870eec371b1713c8b71dd12518114fc","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":24,"title":"US sanctions more Iranian officials as crackdowns continue","shortDescription":"WASHINGTON (AP) — The United States on Wednesday imposed sanctions against three more Iranian security officials in response to the Tehran government's continued crackdown on protests after 22-year-old Mahsa Amini died while being held by the morality police for violating the country’s strictly enforced Islamic dress code.","url":"https://www.apnews.com/article/iran-middle-east-arrests-united-states-tehran-f5bed4b066d09098011950ad8dbc40ca","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":25,"title":"Trump’s long-teased White House bid is low key in 1st week","shortDescription":"NEW YORK (AP) — From the moment he left the White House in defeat last year, Donald Trump has teased the prospect of a third presidential campaign.","url":"https://www.apnews.com/article/2022-midterm-elections-donald-trump-552f3666e5bff552096cdfd3252239dc","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":26,"title":"Supreme Court OKs handover of Trump tax returns to Congress","shortDescription":"WASHINGTON (AP) — The Supreme Court on Tuesday cleared the way for the imminent handover of former President Donald Trump's tax returns to a congressional committee after a three-year legal fight.","url":"https://www.apnews.com/article/us-supreme-court-donald-trump-business-john-roberts-congress-8ea516dace48875ad7c5dd472dd16dcf","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":27,"title":"GOP’s McCarthy threatens to impeach Mayorkas over border","shortDescription":"WASHINGTON (AP) — House Republican leader Kevin McCarthy on Tuesday called on Homeland Security Secretary Alejandro Mayorkas to resign over management of the U.S.","url":"https://www.apnews.com/article/biden-kevin-mccarthy-impeachments-alejandro-mayorkas-border-security-5b2a8fa00a8cc724922b89c328fe6609","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":28,"title":"Biden at 80: A ‘respecter of fate’ mulls 2nd White House bid","shortDescription":"WASHINGTON (AP) — People in their 80s lead countries, create majestic art and perform feats of endurance. One entered the record books for scaling Mount Everest. It's soon time for Joe Biden, 80 on Sunday, to decide whether he has one more mountain to climb — the one to a second term as president.","url":"https://www.apnews.com/article/biden-us-supreme-court-health-climate-and-environment-1fc6c7a33a3d31121b5c040e14686fa7","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":29,"title":"Biden to continue family tradition of Nantucket Thanksgiving","shortDescription":"WASHINGTON (AP) — President Joe Biden 's family tradition of spending the Thanksgiving holiday on Nantucket may take on a more serious tone this year.","url":"https://www.apnews.com/article/biden-jill-massachusetts-holidays-2bafa2b13ecfef50e6467f63d69bcf56","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":30,"title":"Biden to extend student loan pause as court battle drags on","shortDescription":"WASHINGTON (AP) — President Joe Biden announced Tuesday that his administration will extend a pause on federal student loan payments while the White House fights a legal battle to save his plan to cancel portions of the debt.","url":"https://www.apnews.com/article/biden-government-and-politics-f524c55faae26c2066b6795a9d29bc8d","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":31,"title":"Justice Thurgood Marshall’s wife ‘Cissy’ Marshall dies at 94","shortDescription":"WASHINGTON (AP) — Cecilia “Cissy” Suyat Marshall, the wife of the late Supreme Court Justice Thurgood Marshall who worked alongside the civil rights champion at the NAACP, died Tuesday at the age of 94, the Supreme Court announced.","url":"https://www.apnews.com/article/us-supreme-court-race-and-ethnicity-obituaries-thurgood-marshall-john-roberts-7bd4d7cbc5178d6992d381c3c6e90227","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":32,"title":"Court seems skeptical of Trump claims in Mar-a-Lago case","shortDescription":"WASHINGTON (AP) — A federal appeals court appeared deeply skeptical Tuesday that former President Donald Trump was entitled to challenge an FBI search of his Florida estate or to have an independent arbiter review documents that were seized from the home.","url":"https://www.apnews.com/article/donald-trump-mar-a-lago-merrick-garland-government-and-politics-b9a3b57fd7c2039157131b9b4bcb51b2","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":33,"title":"Boost in people seeking HealthCare.gov coverage, HHS says","shortDescription":"WASHINGTON (AP) — The Biden administration announced Tuesday that it’s seeing a big uptick in the number of new customers buying private health insurance for 2023 from the Affordable Care Act’s marketplace.","url":"https://www.apnews.com/article/health-business-xavier-becerra-government-and-politics-79be102177fb1979040118da35f4dd4f","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":34,"title":"Oath Keepers jury home for weekend after deliberations start","shortDescription":"WASHINGTON (AP) — Jurors have gone home for the long Thanksgiving weekend after deliberating most of Tuesday in the Jan. 6 Capitol riot case accusing Oath Keepers founder Stewart Rhodes and four of his extremist group associates of a violent plot to stop the transfer of presidential power from Republican Donald Trump to Democrat Joe Biden.","url":"https://www.apnews.com/article/capitol-siege-biden-donald-trump-conspiracy-congress-92a75247892d2985f0091e31cb8402ca","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":35,"title":"Treasury releases more details of Russian oil price cap plan","shortDescription":"WASHINGTON (AP) — The Treasury Department released new details Tuesday of its long-awaited plan to impose a price cap on Russian oil, but the U.S. and its allies are still finalizing how much they'll pay for petroleum exports that have helped fund the war in Ukraine.","url":"https://www.apnews.com/article/europe-business-global-trade-economy-prices-2bf3115cfd28d327a82e49d6f020e525","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":36,"title":"Republicans try to stop Saturday voting in Georgia runoff","shortDescription":"ATLANTA (AP) — Republican groups appealed to Georgia's highest court Tuesday in an attempt to prohibit early voting this Saturday in the U.S.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-georgia-atlanta-83f554285f2740a6fb8b97a862632150","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":37,"title":"US Sen. Lindsey Graham questioned in Georgia election probe","shortDescription":"ATLANTA (AP) — U.S. Sen. Lindsey Graham testified Tuesday before a special grand jury that's investigating whether President Donald Trump and others illegally meddled in the 2020 election in Georgia.","url":"https://www.apnews.com/article/donald-trump-georgia-atlanta-88095d01932c62ee4a6dc2db1786ada9","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":39,"title":"States move to keep court from lifting Trump asylum policy","shortDescription":"WASHINGTON (AP) — A coalition of conservative-leaning states is making a last-ditch effort to keep in place a Trump-era public health rule that allows many asylum seekers to be turned away at the southern U.S.","url":"https://www.apnews.com/article/health-united-states-public-immigration-covid-5d5f77e27cba4a8063d36d0f384aa893","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":40,"title":"Flip of Michigan Legislature highlights role of fair maps","shortDescription":"Democratic candidates for the Michigan House and Senate won a majority of votes this year, translating into their party winning control of both legislative chambers.","url":"https://www.apnews.com/article/michigan-legislature-government-and-politics-1dedf1cfb97cfee9c03d6a96c46fa126","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":41,"title":"In California, 10% of Legislature now identifies as LGBTQ","shortDescription":"SACRAMENTO, Calif. (AP) — While LGBTQ candidates and their supporters celebrated several milestone victories around the nation in this year's midterm elections, California quietly reached its own: At least 10% of its state lawmakers identify publicly as LGBTQ, believed to be a first for any U.S.","url":"https://www.apnews.com/article/2022-midterm-elections-california-legislature-gender-identity-gay-rights-888ff8d45b817800e4c2231f6bb22377","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":42,"title":"Georgia runoff: Why one Senate seat is crucial for Democrats","shortDescription":"WASHINGTON (AP) — Democrats have secured their majority in the Senate for the next two years. But holding on to Democratic Sen.","url":"https://www.apnews.com/article/herschel-walker-georgia-kamala-harris-congress-government-and-politics-0f6cc74d575921e13c19d7569e4e5382","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":43,"title":"Biden opens holidays, pardons turkeys Chocolate and Chip","shortDescription":"WASHINGTON (AP) — President Joe Biden continued a 75-year tradition Monday and pardoned a pair of Thanksgiving turkeys named after his favorite flavor of ice cream while cracking jokes about his political party's better-than-expected performance in this month's midterm elections.","url":"https://www.apnews.com/article/biden-holidays-obituaries-christmas-c98e1ce25e97dbe097f2ed37d9c7a4c2","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":44,"title":"2nd Arizona county delays certifying election, for now","shortDescription":"PHOENIX (AP) — A second Republican-controlled Arizona county on Monday delayed certifying the results of this month's election as a protest against voting issues in Maricopa County that some GOP officials have blamed for their losses in top races including the contest for governor.","url":"https://www.apnews.com/article/2022-midterm-elections-arizona-phoenix-83aa473b9c0549c87d1c2125ddcfb655","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":45,"title":"Georgia court declines to halt Saturday early runoff voting","shortDescription":"ATLANTA (AP) — A Georgia appeals court ruling on Monday means that counties can offer early voting this coming Saturday in the U.S. Senate runoff election between Democratic Sen. Raphael Warnock and Republican Herschel Walker.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-georgia-af163db41a5c4075310f2f00921611b5","source":"AP News","slug":"apnews","imageUrl":"","date":"November 21, 2022"},{"index":46,"title":"Jan. 6 sedition trial of Oath Keepers founder goes to jury","shortDescription":"WASHINGTON (AP) — As angry supporters of President Donald Trump stormed the U.S. Capitol, ready to smash through windows and beat police officers, Oath Keepers founder Stewart Rhodes extolled them as patriots and harkened back to the battle that kicked off the American Revolutionary War.","url":"https://www.apnews.com/article/capitol-siege-biden-government-and-politics-d18cc28d78f0644c967551ba6b429f7c","source":"AP News","slug":"apnews","imageUrl":"","date":"November 21, 2022"},{"index":47,"title":"Woman convicted of storming Pelosi’s office in Jan. 6 attack","shortDescription":"WASHINGTON (AP) — A Pennsylvania woman linked to the far-right “Groyper” extremist movement was convicted Monday of several federal charges after prosecutors said she was part of a group that stormed House Speaker Nancy Pelosi's office during the Jan.","url":"https://www.apnews.com/article/capitol-siege-pennsylvania-riots-donald-trump-nancy-pelosi-34be1139127837ec787ea841a01c784e","source":"AP News","slug":"apnews","imageUrl":"","date":"November 21, 2022"},{"index":48,"title":"Feds offer $1B to keep California’s last nuclear plant open","shortDescription":"WASHINGTON (AP) — The Biden administration on Monday announced preliminary approval to spend up to $1.1 billion to help keep California's last operating nuclear power plant running, even as officials turned down a request for financial aid to restart a closed nuclear plant in Michigan.","url":"https://www.apnews.com/article/business-california-michigan-canyons-nuclear-power-8d7e349a8d7ff9477809d44b57295087","source":"AP News","slug":"apnews","imageUrl":"","date":"November 21, 2022"},{"index":49,"title":"Supreme Court takes Jack Daniel’s case against dog toy maker","shortDescription":"WASHINGTON (AP) — The Supreme Court said Monday it will hear a dispute over a dog toy that got whiskey maker Jack Daniel's barking mad.Jack Daniel's had asked the justices to hear its case against the manufacturer of the plastic Bad Spaniels toy.","url":"https://www.apnews.com/article/us-supreme-court-business-toys-government-and-politics-13165ef0b235a46926e9953b736f4a5c","source":"AP News","slug":"apnews","imageUrl":"","date":"November 21, 2022"},{"index":1,"title":"'Waste, fraud': GOP lawmaker says House committee will investigate COVID funds","shortDescription":"Some Republican lawmakers also said the next Congress will investigate President Joe Biden's family and the withdrawal in Afghanistan.","url":"https://www.usatoday.com/story/news/politics/2022/11/27/republican-congress-oversight-covid-funding/10785492002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/27"},{"index":2,"title":"Is Arizona's mega MAGA GOP party here to stay? Some Republicans urge pivot.","shortDescription":"The Arizona Republican Party is at a crossroads after high-profile midterm defeats. Some Republicans are calling for GOP chair Kelli Ward to resign.","url":"https://www.usatoday.com/story/news/politics/elections/2022/11/27/arizona-republican-party-mega-maga-crossroads/10785556002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/27"},{"index":3,"title":"Trump dinner with white nationalist not 'accidental,' empowers extremists: GOP governor","shortDescription":"Republican Gov. Asa Hutchinson said former President Trump’s meeting with a white nationalist Nick Fuentes is \"troubling\" and empowers 'the extremes.\"","url":"https://www.usatoday.com/story/news/politics/2022/11/27/gop-governor-blasts-trump-dinner-nick-fuentes/10785124002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/27"},{"index":6,"title":"Trump is being slammed for dining with holocaust denier Nick Fuentes","shortDescription":"Former president Donald Trump is facing criticism for hosting white nationalist Nick Fuentes and rapper Ye at Mar-a-Lago this week.","url":"https://www.usatoday.com/story/news/politics/2022/11/26/trump-fuentes-holocaust-denier-rapper-kanye-west-mar-a-lago/10779512002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/26"},{"index":7,"title":"State election units not finding major voter fraud after midterms.","shortDescription":"A number of  GOP-led states formed units to investigate voter fraud after the 2020 election. They are not detecting many cases of improper voting.","url":"https://www.usatoday.com/story/news/politics/2022/11/26/few-cases-state-voter-fraud-probed-after-2022-midterm-election/10779801002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/26"},{"index":8,"title":"In Georgia runoff, voter turnout is \"the top-line game\"","shortDescription":"Early voting is underway in Georgia's crucial Senate runoff election that will determine if Democrats can expand their narrow majority in the Senate.","url":"https://www.usatoday.com/story/news/politics/2022/11/26/georgia-senate-runoff-early-voting/10748343002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/26"},{"index":10,"title":"Kari Lake files lawsuit against Maricopa County election officials","shortDescription":"The lawsuit accuses county officials of breaking election laws and demands information about ballots affected by Election Day printer issues.","url":"https://www.usatoday.com/story/news/politics/elections/2022/11/25/kari-lake-lawsuit-maricopa-county/10771574002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/25"},{"index":11,"title":"Peltola, Murkowski win in Alaska, defeat Trump-backed candidates","shortDescription":"Alaskan voters issued a rebuke of Trump-backed candidates, reelecting Democratic Rep. Mary Peltola and Republican Sen. Lisa Murkowski.","url":"https://www.usatoday.com/story/news/politics/2022/11/25/peltola-murkowski-reelection-alaska-trump/10771406002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/25"},{"index":12,"title":"Joe Biden wants to 'get rid of assault weapons'","shortDescription":"President Biden spoke with reporters about red flag laws during a visit to the Nantucket Fire Department on Thanksgiving Day.","url":"https://www.usatoday.com/videos/news/politics/2022/11/25/president-joe-biden-try-get-rid-assault-weapons-after-latest-mass-shootings/10771350002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/25"},{"index":14,"title":"The week in Trump's legal challenges: Special counsel, tax returns","shortDescription":"Despite the Thanksgiving holiday week, Donald Trump faced several developments - both criminal and civil - in multiple cases and investigations.","url":"https://www.usatoday.com/story/news/politics/2022/11/25/donald-trumps-legal-challenges-special-counsel-e-jean-carroll-sues/10768546002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/25"},{"index":15,"title":"Trump faces new battery lawsuit from assault accuser E. Jean Carroll","shortDescription":"The new lawsuit takes advantage of a New York law that revives previously barred claims for sexual assault. Trump has denied Carroll's allegation.","url":"https://www.usatoday.com/story/news/politics/2022/11/22/donald-trump-accuser-e-jean-carroll-to-add-new-lawsuit-alleging-battery-to-her-defamation-case/10726232002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":19,"title":"Red states slam Biden's student debt relief plan in Supreme Court case","shortDescription":"The Supreme Court could rule quickly on the administration's request to revive the student loan relief effort. A decision could come within days.","url":"https://www.usatoday.com/story/news/politics/2022/11/23/student-debt-loan-relief-supreme-court-states/10761989002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/23"},{"index":20,"title":"Ilhan Omar blasts GOP leader McCarthy on vow to remove her from committee","shortDescription":"Rep. Ilhan Omar, D-Minn., hits back after House GOP leader Kevin McCarthy vows to strip her of her House committee assignments if elected speaker.","url":"https://www.usatoday.com/story/news/politics/2022/11/22/ilhan-omar-mccarthy-committee-greene-republicans/10756857002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":21,"title":"Young voter advocates urge parties to take them seriously after midterms","shortDescription":"Youth voter experts and advocates on both sides of the aisle say the midterm elections prove political parties can't keep discounting the nation's youngest voters.","url":"https://www.usatoday.com/story/news/politics/2022/11/23/gen-z-republican-democrat-midterms/10670331002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/23"},{"index":22,"title":"OnPolitics: Biden extends student loan payment pause through June 2023","shortDescription":"Biden extends student loan payment plan through June 2023 as his student debt plan works through the courts","url":"https://www.usatoday.com/story/news/politics/2022/11/22/onpolitics-biden-extends-student-loan-payment-pause/10751692002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":24,"title":"Appeals court mulls Mar-a-Lago records as special counsel probes Trump","shortDescription":"A federal appeals panel is consdering whether to overturn the special master reviewing documents seized at Donald Trump's Florida estate, Mar-a-Lago.","url":"https://www.usatoday.com/story/news/politics/2022/11/22/appeals-court-review-mar-lago-records-jack-smith-leads-probe/10750508002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":25,"title":"Fauci makes final White House COVID briefing","shortDescription":"After serving the government for over 50 years, Dr. Anthony Fauci gives his last White House briefing on COVID-19.","url":"https://www.usatoday.com/videos/news/politics/2022/11/22/dr-anthony-fauci-gives-final-white-house-covid-19-briefing/10758017002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":26,"title":"Supreme Court denies Trump effort to keep tax returns from House panel","shortDescription":"Trump's record at the Supreme Court is not particularly good, even though he nominated three of the court's current associate justices.","url":"https://www.usatoday.com/story/news/politics/2022/11/22/supreme-court-trump-tax-returns-ways-and-means/8256849001/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":27,"title":"Warnock-Walker runoff: Appeals court rejects challenge to Saturday early voting","shortDescription":"On Monday evening, the Court of Appeals for the State of Georgia denied a  motion to block a ruling allowing Saturday early voting in the runoff.","url":"https://www.usatoday.com/story/news/politics/elections/2022/11/22/georgia-runoff-saturday-voting-possible-after-appeal-court-ruling/10757645002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":28,"title":"Biden thanks Army vet for bravery in helping disarm Club Q gunman","shortDescription":"President Biden offered his support Tuesday to Richard Fierro, an Army vet who helped disarm the Club Q gunman who killed his daughter's boyfriend.","url":"https://www.usatoday.com/story/news/politics/2022/11/22/biden-colorado-shooting-richard-fierro/10756964002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":31,"title":"Michigan GOP leader rebuffs request for election inquiry, calling it a 'stunt'","shortDescription":"The letter shredded the request, using a hypothetical question to suggest the effort is a \"shameless and half-baked political stunt.\"","url":"https://www.usatoday.com/story/news/politics/elections/2022/11/22/michigan-gop-speaker-election-inquiry-request-stunt/10756437002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":32,"title":"Bidens host Thanksgiving dinner for troops","shortDescription":"President Joe Biden and first lady Jill Biden helped serve meals to military troops for Thanksgiving in North Carolina.","url":"https://www.usatoday.com/videos/news/politics/2022/11/22/joe-biden-enjoys-thanksgiving-meal-troops-north-carolina/10755778002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":0,"title":"The U.S. Promised Tribes They Would Always Have Fish, but the Fish They Have Pose Toxic Risks","shortDescription":"For decades, the U.S. government has failed to test for chemicals and metals in fish. So, we did. What we found was alarming for tribes.","url":"https://www.propublica.org/article/how-the-us-broke-promise-to-protect-fish-for-tribes","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221122-salmon-1.jpg","date":"Nov. 22"},{"index":5,"title":"Complaint Filed Against Mississippi Judge for Failing to Hand Over Search Warrants to Clerk","shortDescription":"The judge has signed a number of no-knock search warrants that have been challenged in court, but they weren’t on file at the clerk’s office.","url":"https://www.propublica.org/article/no-knock-warrants-mississippi-judge-complaint","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221117-No-Knock-Folo-1.jpg","date":"Nov. 18"},{"index":7,"title":"More Senate Democrats Seek Investigation of Tech Firm Accused of Colluding With Landlords to Hike Apartment Rents","shortDescription":"Sen. Amy Klobuchar and other leading Democrats have asked the Department of Justice to examine Texas-based RealPage, which sells software to help landlords set apartment rental prices across the country.","url":"https://www.propublica.org/article/yieldstar-rent-increase-realpage-rent-klobuchar","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221116-Rent-Barons-Klobuchar.jpg","date":"Nov. 17"},{"index":8,"title":"Public Schools Are NYC’s Main Youth Mental Health System — and They’re Devastatingly Unequal","shortDescription":"Most kids labeled as having an “emotional disability” and shunted into public special education schools are Black or Latino, and low income — while wealthier families more often access a taxpayer-funded free private education.","url":"https://www.propublica.org/article/nyc-schools-kids-mental-health-special-education","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/ProPublica_Opener_Final_Stapleton.jpg","date":"Nov. 17"},{"index":13,"title":"“We Need to Defend This Law”: Inside an Anti-Abortion Meeting With Tennessee’s GOP Lawmakers","shortDescription":"Anti-abortion groups helped write and pass laws that kicked in to ban abortion when Roe v. Wade was overturned. The groups see Tennessee’s ban as the country’s strongest — and they want to keep it that way, according to audio reviewed by ProPublica.","url":"https://www.propublica.org/article/inside-anti-abortion-meeting-with-tennessee-republican-lawmakers","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221114-Tennessee-Abortion-Lead-01.JPG","date":"Nov. 15"},{"index":3,"title":"Meet the House Republicans Who Will Wield Power in the New Congress","shortDescription":"The G.O.P. lawmakers in line to lead key committees have made it clear they will prioritize investigations of the Biden administration.By Catie Edmondson, Luke Broadwater and Emily Cochrane","url":"https://www.nytimes.com/2022/11/25/us/politics/house-republicans-congress.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/25/us/politics/00dc-repubs-1/merlin_216758481_367aed85-6a0a-4876-879a-8c977fa8e164-thumbWide.jpg","date":"2022/11/25"},{"index":7,"title":"The Expanded Child Tax Credit Is Gone. The Battle Over It Remains.","shortDescription":"A pandemic-era program that sent monthly checks of up to $300 per child to most families drove down poverty rates. Amid new research about its merits, some Democrats are vowing to bring it back.By Jason DeParle","url":"https://www.nytimes.com/2022/11/25/us/politics/child-tax-credit.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/26/us/politics/00dc-childtax-1/00dc-childtax-1-thumbWide.jpg","date":"2022/11/26"},{"index":10,"title":"Lisa Murkowski Wins Re-election in Alaska, Beating a Trump-Backed Rival","shortDescription":"Ms. Murkowski was the only Senate Republican up for re-election this year who voted to convict former President Donald J. Trump in his impeachment trial after the Jan. 6, 2021, riot.By Emily Cochrane","url":"https://www.nytimes.com/2022/11/23/us/politics/lisa-murkowski-alaska-senate-race.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/08/us/politics/08election-day-murkowski/08election-day-murkowski-thumbWide.jpg","date":"2022/11/08"},{"index":11,"title":"Why House Democrats Have Fallen in Line and Republicans Haven’t","shortDescription":"We spoke with Julie Hirschfeld Davis, the congressional editor at The Times, about the latest maneuvering and drama in Washington.By Blake Hounshell and Julie Hirschfeld Davis","url":"https://www.nytimes.com/2022/11/23/us/politics/house-democrats-republicans.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/23/multimedia/23onpolitics-newsletter-1-dbc4/23onpolitics-newsletter-1-dbc4-thumbWide.jpg","date":"2022/11/23"},{"index":0,"title":"Bipartisan band of brothers: The West Point grads coming to Congress","shortDescription":"Cross-aisle bonds between Rep. Pat Ryan (D-N.Y.), Rep.-elect John James (R-Mich.) and Rep.-elect Wesley Hunt (R-Texas) were forged in the same class at the storied military academy.","url":"https://www.politico.com/news/2022/11/26/west-point-grads-congress-midterm-results-00070710","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/26"},{"index":1,"title":"Schumer proposes Dem leadership shake-up","shortDescription":"","url":"https://www.politico.com/news/2022/11/23/senate-schumer-dem-leadership-00070809","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/23"},{"index":2,"title":"Lawmakers fret over another holiday punt on government funding","shortDescription":"","url":"https://www.politico.com/news/2022/11/23/lawmakers-government-funding-house-appropriations-00069409","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/23"},{"index":4,"title":"GOP downplays its Trump wing on the world stage","shortDescription":"","url":"https://www.politico.com/news/2022/11/22/gop-ukraine-aid-halifax-00069709","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/22"},{"index":6,"title":"Democrats confront bleak odds for immigration deal before 2023","shortDescription":"","url":"https://www.politico.com/news/2022/11/21/democrats-immigration-deal-00069464","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/21"},{"index":7,"title":"GOP centrists prepare to ‘flex our muscles’","shortDescription":"","url":"https://www.politico.com/news/2022/11/21/gop-centrists-flex-muscles-00069541","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/21"},{"index":8,"title":"Jeffries on leadership transition: ‘Honor to stand on the shoulders’","shortDescription":"","url":"https://www.politico.com/news/2022/11/20/jeffries-pelosi-leadership-transition-honor-00069620","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/20"},{"index":9,"title":"Jan. 6 panel brushes off Trump 2024 in critical final sprint","shortDescription":"","url":"https://www.politico.com/news/2022/11/18/jan-6-panel-trump-2024-00069275","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/18"},{"index":10,"title":"Newsom Told the White House He Won’t Challenge Biden","shortDescription":"","url":"https://www.politico.com/news/2022/11/26/gavin-newsom-wont-challenge-joe-biden-00070829","source":"Politico","slug":"politico","imageUrl":"","date":"2022/11/26"},{"index":11,"title":"An Early Clue on Trump’s Republican Support","shortDescription":"","url":"https://www.politico.com/news/magazine/2022/11/25/trump-2024-presidential-election-00070677","source":"Politico","slug":"politico","imageUrl":"","date":"2022/11/25"},{"index":12,"title":"Bipartisan band of brothers: The West Point grads coming to Congress","shortDescription":"","url":"https://www.politico.com/news/2022/11/26/west-point-grads-congress-midterm-results-00070710","source":"Politico","slug":"politico","imageUrl":"","date":"2022/11/26"},{"index":14,"title":"Donald Trump dined with white nationalist, Holocaust denier Nick Fuentes","shortDescription":"","url":"https://www.politico.com/news/2022/11/25/trump-white-nationalist-nick-fuentes-kanye-00070825","source":"Politico","slug":"politico","imageUrl":"","date":"2022/11/25"}]