[{"index":0,"title":"Young voters’ enthusiasm for Democrats waned during midterms","shortDescription":"WASHINGTON (AP) — Young voters who have been critical to Democratic successes in recent elections showed signs in November's midterms that their enthusiasm may be waning, a potential warning sign for a party that will need their strong backing heading into the 2024 presidential race.","url":"https://www.apnews.com/article/2022-midterm-elections-biden-politics-pennsylvania-state-government-a42e61b5a9fa590dabd1e61762fac31b","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":1,"title":"2nd Oath Keepers Jan. 6 sedition trial to get underway","shortDescription":"WASHINGTON (AP) — After securing seditious conspiracy convictions against two leaders of the Oath Keepers, the Justice Department will begin Monday to try to make its Capitol riot case against four others affiliated with the far-right extremist group.","url":"https://www.apnews.com/article/biden-us-department-of-justice-united-states-government-and-politics-1cb813cae5a11ca8df8cd1c08a170328","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":3,"title":"Election nonprofit that drew GOP ire in 2020 renews grants","shortDescription":"MADISON, Wis. (AP) — A nonprofit group that became a point of controversy for distributing hundreds of millions of dollars in election grants during the 2020 presidential campaign is releasing a fresh round of money to local election offices, including in states where Republican lawmakers tried to ban the practice.","url":"https://www.apnews.com/article/2022-midterm-elections-united-states-government-and-politics-78e0e0d548df9023aeac1c9c690b48f8","source":"AP News","slug":"apnews","imageUrl":"","date":"December 11, 2022"},{"index":4,"title":"Biden aims to narrow trust gap with US-Africa leaders summit","shortDescription":"WASHINGTON (AP) — President Joe Biden is set to play host to dozens of African leaders in Washington this week as the White House looks to narrow a gaping trust gap with Africa — one that has grown wider over years of frustration about America's commitment to the continent.","url":"https://www.apnews.com/article/biden-politics-china-africa-covid-d91f14e95e592802dc056bef6ac72024","source":"AP News","slug":"apnews","imageUrl":"","date":"December 11, 2022"},{"index":6,"title":"Shreveport elects its first Republican mayor in 28 years","shortDescription":"SHREVEPORT, La. (AP) — Voters in Louisiana's third-largest city have elected a Republican mayor for the first time in 28 years.Tom Arceneaux, 71, won a runoff election Saturday to become the next mayor of Shreveport.","url":"https://www.apnews.com/article/shreveport-c1d2d698db67396098b0beda4488024b","source":"AP News","slug":"apnews","imageUrl":"","date":"December 11, 2022"},{"index":7,"title":"Biden called gay marriage ‘inevitable’ and soon it’ll be law","shortDescription":"WASHINGTON (AP) — A decade ago, then-Vice President Joe Biden shocked the political world and preempted his boss by suddenly declaring his support for gay marriage — one of the country's most contentious issues — on national television.","url":"https://www.apnews.com/article/biden-politics-ohio-state-government-and-texas-4d369bd85e52b030ff1813dcafc9f7bd","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":8,"title":"Democrat Bass takes charge as LA mayor amid homeless crisis","shortDescription":"LOS ANGELES (AP) — Karen Ruth Bass, a former physician assistant who shattered glass ceilings with her rise to a leadership post in the California legislature and later a prominent spot in Congress, took a ceremonial oath of office Sunday as mayor of Los Angeles.","url":"https://www.apnews.com/article/california-los-angeles-kamala-harris-homelessness-state-government-b2cab2d64a0a33ae58141ec3a407db05","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":9,"title":"Sinema party switch highlights 2024 obstacles for Democrats","shortDescription":"PHOENIX (AP) — Less than three days after Democrats celebrated victory in the final Senate contest of the 2022 midterms, the challenges facing the party heading into the next campaign came into sharp relief.","url":"https://www.apnews.com/article/2022-midterm-elections-politics-arizona-kyrsten-sinema-us-republican-party-074c53a0ed0be3baaa80eeaefe21f3f6","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":12,"title":"Young voters’ enthusiasm for Democrats waned during midterms","shortDescription":"WASHINGTON (AP) — Young voters who have been critical to Democratic successes in recent elections showed signs in November’s midterms that their enthusiasm may be waning, a potential warning sign for a party that will need their strong backing heading into the 2024 presidential race.","url":"https://www.apnews.com/article/2022-midterm-elections-biden-pennsylvania-state-government-united-states-b050facf837de805d82f480fbdf6a8ea","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":13,"title":"Peru president proposes moving up elections amid protests","shortDescription":"LIMA, Peru (AP) — Peru's newest president, Dina Boluarte, gave in to protesters' demands early Monday announcing in a nationally televised address that she will send Congress a proposal to move up elections.","url":"https://www.apnews.com/article/politics-peru-caribbean-covid-6921c3c8bcf95f654b70d8de39dfc550","source":"AP News","slug":"apnews","imageUrl":"","date":"December 12, 2022"},{"index":16,"title":"Democratic lawmakers visit Havana, meet with Cuban president","shortDescription":"HAVANA (AP) — A delegation of at least three U.S. lawmakers visited Havana and met with Cuba’s government this week, American and Cuban officials confirmed.Reps. James McGovern (D-MA), Mark Pocan (D-WI) and Troy Carter (D-LA) met with Cuban President Miguel Díaz-Canel, leaders in Cuba’s congress and its foreign minister, the U.S.","url":"https://www.apnews.com/article/politics-cuba-caribbean-havana-james-mcgovern-298c8d13d2cf44ca536c403ab44a336c","source":"AP News","slug":"apnews","imageUrl":"","date":"December 11, 2022"},{"index":23,"title":"Kosovo postpones election in ethnic-Serb-dominated north","shortDescription":"PRISTINA, Kosovo (AP) — Kosovo on Saturday postponed a local election due Dec. 18 in four municipalities with a predominantly ethnic Serb population, in an effort to defuse recent tensions there that have also caused relations with neighboring Serbia to deteriorate further.","url":"https://www.apnews.com/article/politics-serbia-kosovo-government-cb97bdd10963181461cc76a312d31a32","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":25,"title":"Nobel Peace Prize winners blast Putin’s invasion of Ukraine","shortDescription":"OSLO, Norway (AP) — The winners of this year's Nobel Peace Prize from Belarus, Russia and Ukraine shared their visions of a fairer world and denounced Russian President Vladimir Putin's war in Ukraine during Saturday’s award ceremony in the Norwegian capital.","url":"https://www.apnews.com/article/russia-ukraine-putin-politics-nobel-prizes-government-a4b373795a5d709b3ed59405aba67818","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":26,"title":"Effect of Georgia’s voting law unclear, despite high turnout","shortDescription":"WASHINGTON (AP) — Georgia’s 2022 election season ended dramatically this past week, but that was because of the closely watched Senate runoff that solidified Democratic control of the chamber and not for any large-scale problems with voting.","url":"https://www.apnews.com/article/2022-midterm-elections-georgia-state-government-89b374bfafdba5b673a46b240a5e3e1f","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":28,"title":"GOP sues over special elections in Pa. House majority battle","shortDescription":"HARRISBURG, Pa. (AP) — The top-ranking Republican in the Pennsylvania House of Representatives asked a court late Friday to prevent voters from filling three vacant seats in February that will determine majority control of the chamber.","url":"https://www.apnews.com/article/politics-pennsylvania-state-government-us-democratic-party-e649e9dd69fa2267c3b03f689edf2029","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":31,"title":"Rural voters ‘in the trenches’ on climate, leery of Biden","shortDescription":"NEW YORK (AP) — Drought in California meant Raquel Krach, a rice farmer and graduate student in the Sacramento Valley, planted very little. Using groundwater, she and her husband planted 75 acres this year to maintain their markets.","url":"https://www.apnews.com/article/2022-midterm-elections-science-us-department-of-agriculture-climate-and-environment-government-politics-c3b2d4e7b8dbe9891e8a1cf37030fe04","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":32,"title":"Kari Lake challenges her defeat in Arizona governor’s race","shortDescription":"PHOENIX (AP) — Kari Lake, the Republican defeated in Arizona governor’s race, is formally challenging her loss to Democrat Katie Hobbs, asking a court to throw out certified election results from the state's most populous county and either declare her the winner or rerun the governor's election in that county.","url":"https://www.apnews.com/article/2022-midterm-elections-arizona-donald-trump-lawsuits-e8a36e1018f07b2804eba9ac8df0da1b","source":"AP News","slug":"apnews","imageUrl":"","date":"December 10, 2022"},{"index":35,"title":"Trump lawyers in court for sealed hearing in Mar-a-Lago case","shortDescription":"WASHINGTON (AP) — Lawyers for Donald Trump were in court Friday for sealed arguments as part of the ongoing investigation into the presence of classified information at the former president's Florida estate.","url":"https://www.apnews.com/article/florida-mar-a-lago-district-of-columbia-us-department-justice-5199ff51714542c484d5ee3311e6165b","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":37,"title":"US: Russia, Iran moving toward full defense ‘partnership’","shortDescription":"WASHINGTON (AP) — The Biden administration is accusing Russia of moving to provide advanced military assistance to Iran, including air defense systems, helicopters and fighter jets, part of deepening cooperation between the two nations as Tehran provides drones to support Vladimir Putin's invasion of Ukraine.","url":"https://www.apnews.com/article/putin-iran-government-and-politics-drones-933e27218934e7476d1a1524fc8ebf4c","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":39,"title":"Rioter who assaulted cops at Capitol gets 5 years in prison","shortDescription":"WASHINGTON (AP) — A Tennessee man who authorities say came to Washington ahead of the Jan. 6, 2021, riot prepared for violence in a car full of weapons and assaulted officers who were trying to defend the Capitol was sentenced Friday to more than five years behind bars.","url":"https://www.apnews.com/article/capitol-siege-violence-riots-tennessee-united-states-government-15e04d7da99e269e18567f385cddc101","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":40,"title":"Democratic Sen. Kyrsten Sinema switches to independent","shortDescription":"WASHINGTON (AP) — Democratic Sen. Kyrsten Sinema of Arizona announced Friday she has registered as an independent, a renegade move that could bolster her political brand but won't upend the Democrats' narrow Senate majority. She says she will not caucus with Republicans.","url":"https://www.apnews.com/article/kyrsten-sinema-democrats-2eed01350622364a86c56000ca249bb1","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":49,"title":"1st Gen Z congressman-elect denied apartment over bad credit","shortDescription":"WASHINGTON (AP) — Rep.-elect Maxwell Frost of Florida, the first member of Generation Z elected to Congress, says he is struggling to get an apartment in Washington and lost an application fee because his credit is “really bad.”","url":"https://www.apnews.com/article/florida-united-states-government-and-politics-8af2bd84a9132bec35495ccb2553adcc","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":2,"title":"White House defends Brittney Griner swap with Russian arms dealer Bout","shortDescription":"Brittney Griner returned to the United States after being detained in Russia since February. The White House is negotiating Paul Whelan's return.","url":"https://www.usatoday.com/story/news/politics/2022/12/11/brittney-griner-paul-whelan-viktor-bout-white-house/10877741002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/11"},{"index":3,"title":"Biden hopes to draw Africa closer during Washington summit despite China and Russia influence","shortDescription":"President Biden would use the summit of African leaders to declare his support for adding the African Union as a permanent member of the G-20 nations.","url":"https://www.usatoday.com/story/news/politics/2022/12/11/amid-growing-china-russia-influence-biden-hopes-draw-africa-closer/10877757002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/11"},{"index":7,"title":"Nonfatal opioid overdoses by state: White House launches new data map","shortDescription":"The data dashboard on nonfatal opioid overdoses will target specific regions to help fight the epidemic, which left 81,000 dead in the US this year.","url":"https://www.usatoday.com/story/news/health/2022/12/08/opioid-epidemic-white-house-launches-dashboard-tracking-overdoses/10850708002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":8,"title":"Did Georgia voting law affect midterm election turnout? It's not clear.","shortDescription":"Civil rights groups said Georgia's new voting laws passed by the GOP-controlled legislature amounted to suppression, even as voter turnout peaked.","url":"https://www.usatoday.com/story/news/politics/2022/12/10/georgia-runoff-midterm-law-voting-changes/10871937002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/10"},{"index":10,"title":"Democrats in 'tight spot' after Sinema's departure from national party","shortDescription":"Political experts told USA TODAY that Sinema's move complicates Democrats' ability to hold onto the Arizona Senate seat, and Senate control, in 2024.","url":"https://www.usatoday.com/story/news/politics/2022/12/10/2024-senate-democrats-presidency-sinema/10865317002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/10"},{"index":12,"title":"Supreme Court to hear First Amendment case on immigration fraud","shortDescription":"The case arrives at the Supreme Court two years after the justices settled a similar dispute over the immigration law on procedural grounds.","url":"https://www.usatoday.com/story/news/politics/2022/12/09/supreme-court-first-amendment-immigration-fraud/10863828002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":14,"title":"Sam Bankman-Fried, ex-crypto exchange CEO, says he will testify before Congress","shortDescription":"Sam Bankman-Fried said he's willing to testify Tuesday before a key congressional committee investigating the collapse of crypto exchange FTX.","url":"https://www.usatoday.com/story/news/2022/12/09/sbf-ftx-congress-committee/10864901002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":15,"title":"Incoming member of Congress denied for DC apartment","shortDescription":"Maxwell Frost made history as the first member of Gen Z to be elected to Congress.  That didn’t help him get an apartment in the nation’s capital.","url":"https://www.usatoday.com/story/news/politics/2022/12/09/florida-congressman-maxwell-frost-washington-dc-apartment/10866222002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":16,"title":"What Sinema's announcement and Warnock's win mean for the Senate","shortDescription":"Democratic Sen. Raphael Warnock won a Georgia Senate runoff Tuesday. Days later, Arizona's Kyrsten Sinema said she was leaving the Democratic Party.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/09/senate-biden-warnock-manchin-sinema/10846300002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":20,"title":"A shakeup in the Senate; Sinema switches party from Dem to independent","shortDescription":"Sen. Kyrsten Sinema, who has voted with both parties, will keep her committee assignments, but wouldn't say if she will caucus with Democrats.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/09/senator-kyrsten-sinema-independent-senate-impact/10864561002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/09"},{"index":28,"title":"Biden criticized for Griner prison swap that left Paul Whelan in Russia","shortDescription":"Critics question why former Marine Paul Whelan wasn't included in prisoner swap that freed Brittney Griner from Russian prison.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/joe-biden-brittney-griner-prisoner-swap-criticism-paul-whelan/10858405002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":29,"title":"OnPolitics: House passes same-sex marriage bill, measure off to Biden","shortDescription":"The Respect for Marriage Act is headed to President Joe Biden's desk after garnering bipartisan support in both congressional chambers.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/onpolitics-same-sex-marriage-bill-passes-house-heads-biden/10859201002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":31,"title":"House passes same-sex marriage bill, measure goes to Biden - live updates","shortDescription":"The Respect for Marriage Act guarantees federal recognition of any marriage between two people if it was valid in the state where they were married.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/house-same-sex-marriage-vote/10839838002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":32,"title":"House passes defense bill scrapping COVID vaccine mandate","shortDescription":"The bill provides about $45 billion more for defense programs than Biden requested, the second year in a row Congress notably exceeded his request.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/house-defense-bill-covid-vaccine-mandate/10852558002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":2,"title":"Indian Country Needs Money to Protect Its Wildlife Heritage. Congress Must Help.","shortDescription":"Losses of animals and plants represent a fundamental threat to how Native peoples practice their religions and pass on their cultures.By Gloria Tom","url":"https://www.nytimes.com/2022/12/12/opinion/congress-native-american-widlife.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/12/multimedia/12tom-top-1-0848/12tom-top-1-0848-thumbWide.jpg","date":"2022/12/12"},{"index":5,"title":"Sinema Adds Intrigue and Democratic Fury to Arizona’s 2024 Senate Race","shortDescription":"Senator Kyrsten Sinema’s announcement that she would become an independent left Democrats in her state, many of whom have long wanted to defeat her in a primary, facing a new political calculus.By Reid J. Epstein, Jennifer Medina and Katie Glueck","url":"https://www.nytimes.com/2022/12/09/us/politics/kyrsten-sinema-arizona-senate-democrats.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/09/multimedia/09POL-ARIZONA-1-9ea1/09POL-ARIZONA-1-9ea1-thumbWide.jpg","date":"2022/12/09"},{"index":6,"title":"Leaders Back Away From Raising Debt Ceiling, Punting Clash to New Congress","shortDescription":"Some Democrats had hoped to act on the issue before their party loses unified control of Congress, but a lack of political will and time appears to have sapped momentum for doing so.By Emily Cochrane","url":"https://www.nytimes.com/2022/12/09/us/politics/congress-debt-ceiling.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/09/multimedia/09DC-DEBT-1-4dc5/09DC-DEBT-1-4dc5-thumbWide.jpg","date":"2022/12/09"},{"index":8,"title":"In D.C. With the First Gen-Z Congressman","shortDescription":"Last month, Maxwell Frost, 25, was elected as the youngest member of the House. I followed him around during his first few weeks in D.C. as he settled into the Beltway.By Stephanie Lai","url":"https://www.nytimes.com/interactive/2022/12/09/us/politics/maxwell-frost-genz-congress.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/00dc-frost-burst-1-fe26/00dc-frost-burst-1-fe26-thumbWide.jpg","date":"2022/12/07"},{"index":10,"title":"House Passes $858 Billion Defense Bill Repealing Vaccine Mandate for Troops","shortDescription":"The legislation would rescind the coronavirus vaccine mandate in defiance of the Biden administration’s wishes, and increase the defense budget $45 billion over the president’s request.By Catie Edmondson","url":"https://www.nytimes.com/2022/12/08/us/politics/house-defense-bill-covid-vaccine-mandate.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/07dc-defensebill-1-cd18/07dc-defensebill-1-cd18-thumbWide.jpg","date":"2022/12/07"},{"index":11,"title":"House Passes Bill to Protect Same-Sex Marriage","shortDescription":"The House gave final approval to the Respect for Marriage Act with both sides voting in favor of the legislation, which provides federal recognition for same-sex marriages.By Reuters","url":"https://www.nytimes.com/video/us/politics/100000008678738/congress-same-sex-marriage.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/08/multimedia/08vid-same-sex-marriage_promo2-1-6cad/08vid-same-sex-marriage_promo2-1-6cad-thumbWide.jpg","date":"2022/12/08"},{"index":0,"title":"Don’t worry, be a majority: Dems shrug off Sinema’s switch","shortDescription":"Hours after Kyrsten Sinema publicly declared she'd switch her party to Independent, Democrats were already back to feeling reassured in their 51-seat majority.","url":"https://www.politico.com/news/2022/12/09/kyrsten-sinemas-switch-democrats-00073327","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/09"},{"index":1,"title":"Trump who? GOP senators rave over a potential Tim Scott presidential run.","shortDescription":"","url":"https://www.politico.com/news/2022/12/12/trump-gop-senators-tim-scott-presidential-00073280","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/12"},{"index":2,"title":"Term-limit plan sparks generational battle among House Dems","shortDescription":"","url":"https://www.politico.com/news/2022/12/12/house-dems-term-limits-generational-shift-00073306","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/12"},{"index":3,"title":"What the Jan. 6 select committee’s final report will look like","shortDescription":"","url":"https://www.politico.com/news/2022/12/12/jan-6-select-committee-final-report-00073402","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/12"},{"index":4,"title":"‘It’s not a principle change’: Lawmakers dissect Sinema switch","shortDescription":"","url":"https://www.politico.com/news/2022/12/11/sinema-arizona-independent-party-switch-00073383","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/11"},{"index":5,"title":"Wanted by McCarthy critics: 1 qualified alternative speaker","shortDescription":"","url":"https://www.politico.com/news/2022/12/11/mccarthy-speaker-alternatives-republicans-00073319","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/11"},{"index":6,"title":"Sinema party switch jumpstarts Arizona's 2024 Senate battle","shortDescription":"","url":"https://www.politico.com/news/2022/12/09/sinema-party-arizona-senate-2024-00073301","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/09"},{"index":7,"title":"Top progressive firm drops Sinema as a client","shortDescription":"","url":"https://www.politico.com/news/2022/12/09/top-progressive-firm-drops-sinema-as-a-client-00073292","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/09"},{"index":9,"title":"Sinema switches to independent, shaking up the Senate","shortDescription":"","url":"https://www.politico.com/news/2022/12/09/sinema-arizona-senate-independent-00073216","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/09"},{"index":10,"title":"Why the Republican Party Just Can’t Quit Trump","shortDescription":"","url":"https://www.politico.com/news/magazine/2022/12/11/rnc-trump-mcdaniel-election-losses-00073343","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/11"},{"index":12,"title":"Christie blasts Trump over Georgia Senate loss","shortDescription":"","url":"https://www.politico.com/news/2022/12/11/christie-trump-herschel-walker-georgia-runoff-00073380","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/11"}]