[{"index":0,"title":"Biden approval, views of economy steady, sour: AP-NORC poll","shortDescription":"WASHINGTON (AP) — Fresh off his party’s better-than-anticipated performance in the midterm elections, President Joe Biden is facing consistent but critical assessments of his leadership and the national economy.","url":"https://www.apnews.com/article/biden-inflation-united-states-government-and-politics-afe0d0d66a1097b3defb7999b2b378f5","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":2,"title":"Georgia vote gives Harris reprieve as Senate tiebreaker","shortDescription":"WASHINGTON (AP) — Vice President Kamala Harris needed to get to the U.S. Senate to break a tie. But first she had to avoid causing a traffic jam. One more senator had to vote before Harris could end the impasse, and he was in Georgetown, on the opposite side of Washington.","url":"https://www.apnews.com/article/kamala-harris-united-states-government-and-politics-08422039c2b06b4d0ba746827dc2eb43","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":3,"title":"Warnock delivers 51-seat Senate for Democrats, and much more","shortDescription":"","url":"https://www.apnews.com/article/biden-georgia-united-states-government-and-politics-7933d36179597c5aa772bcf8d3fb97eb","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":4,"title":"Warnock win makes it official: Georgia is a ’24 battleground","shortDescription":"ATLANTA (AP) — Fresh off Democratic Sen.","url":"https://www.apnews.com/article/2022-midterm-elections-college-football-politics-united-states-government-c2fed7e298b9c19fa06a9f1140bb06c5","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":8,"title":"Report: Classified items found at Trump storage unit in Fla.","shortDescription":"WASHINGTON (AP) — At least two items marked as classified were found in a storage unit in West Palm Beach, Florida, after lawyers for former President Donald Trump arranged for a firm to search for additional classified material, according to a published report Wednesday.","url":"https://www.apnews.com/article/politics-donald-trump-virginia-west-palm-beach-0dea15da0365220d340f1f51a00b0a27","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":9,"title":"Biden speaks at vigil honoring victims of gun violence","shortDescription":"WASHINGTON (AP) — President Joe Biden called again Wednesday for a ban on so-called assault weapons as he spoke at a vigil honoring victims of gun violence, an event taking place nearly 10 years since the massacre at Sandy Hook Elementary School in Newtown, Connecticut, that spurred a new generation of advocacy for tougher firearms restrictions.","url":"https://www.apnews.com/article/biden-violence-united-states-government-and-politics-6293ffb41c0669f114a1ae18cbd93a2f","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":10,"title":"Oregon high court declines to overturn decision on gun law","shortDescription":"PORTLAND, Ore. (AP) — The Oregon Supreme Court late Wednesday declined to overturn a lower court judge’s decision and allow a tough new voter-approved gun law to take effect this week.Chief Justice Martha Walters denied the emergency motion to intervene filed earlier in the day by the state Attorney General Ellen Rosenbaum.","url":"https://www.apnews.com/article/oregon-united-states-government-and-politics-state-cf6c114146fe07b63768186adc4c2ece","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":11,"title":"Rapid fall from power, arrest for embattled Peru president","shortDescription":"LIMA, Peru (AP) — In just three tumultuous hours, President Pedro Castillo went from decreeing the dissolution of Peru’s Congress to being replaced by his vice president, but the threats against his government had been building throughout his nearly 17-month presidency.","url":"https://www.apnews.com/article/politics-peru-caribbean-government-and-ee258b8b8495c9ae06a43f6d3c906a7a","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":13,"title":"Peru’s president ousted by Congress in political crisis","shortDescription":"LIMA, Peru (AP) — The president of Peru was ousted by Congress and arrested on a charge of rebellion Wednesday after he sought to dissolve the legislative body and take unilateral control of the government, triggering a grave constitutional crisis.","url":"https://www.apnews.com/article/peru-caribbean-government-pedro-castillo-62923886f7c53b1dcceb0db84cb09888","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":15,"title":"Dem governor: Caring is key to connecting with rural voters","shortDescription":"FRANKFORT, Ky. (AP) — Kentucky Gov. Andy Beshear said Wednesday that Democrats have a better chance of connecting with rural voters in his home state and elsewhere when they talk about the things people need and the ways they can help them.","url":"https://www.apnews.com/article/2022-midterm-elections-kentucky-united-states-government-and-politics-42486a3be6621f2b54e39428c5d3f09d","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":17,"title":"US: Russia looking to Iran to supply more drones, missiles","shortDescription":"WASHINGTON (AP) — Struggling to maintain a steady supply of arms for its war in Ukraine, Moscow is looking to Iran once again to resupply the Russian military with drones and surface-to-surface missiles, according to two officials familiar with the matter.","url":"https://www.apnews.com/article/russia-ukraine-iran-government-united-states-034b4e4ae2e9a4cb0ec0922cac82dc54","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":18,"title":"Justices skeptical of elections case that could alter voting","shortDescription":"WASHINGTON (AP) — The Supreme Court on Wednesday seemed skeptical of making a broad ruling that would leave state legislatures virtually unchecked in making rules for congressional and presidential elections.","url":"https://www.apnews.com/article/us-supreme-court-north-carolina-5615105a88cedadcd2ce738f2cfe3a16","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":21,"title":"GOP Assembly winner could be ousted over Brooklyn residency","shortDescription":"ALBANY, N.Y. (AP) — In an election in which Republicans underperformed nationally, Lester Chang was a success story. He beat a New York City Democrat who’d been in office for almost 36 years, and in doing so became the first Asian American elected to represent Brooklyn’s growing Chinatown in the state Assembly.","url":"https://www.apnews.com/article/2022-midterm-elections-politics-new-york-united-states-government-and-4a498178fb87df3346070f4ac37ea591","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":22,"title":"Christmas ornament honors gingerbread White House tradition","shortDescription":"WASHINGTON (AP) — This year's Christmas ornament from the White House Historical Association honors the tradition of displaying a gingerbread model of the executive mansion as part of the holiday decorations at 1600 Pennsylvania Ave.","url":"https://www.apnews.com/article/richard-nixon-united-states-government-germany-0a4da2447882706dedf604a2d2ea91a3","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":23,"title":"Ukraine ex-lawmaker, alleged Russian agent, faces US charges","shortDescription":"NEW YORK (AP) — A former Ukrainian lawmaker who U.S. authorities say acted as a Russian agent for over a decade and tried to influence the 2020 presidential election through meetings with Rudy Giuliani has been criminally charged in New York in connection with purchases of luxury Beverly Hills real estate.","url":"https://www.apnews.com/article/biden-indictments-ukraine-government-united-states-and-politics-105c9d332a43192c7a8eb17b4a9e850a","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":24,"title":"Biden signs #MeToo law curbing confidentiality agreements","shortDescription":"President Joe Biden on Wednesday signed legislation curbing the use of confidentiality agreements that block victims of sexual harassment from speaking publicly about misconduct in the workplace.White House press secretary Karine Jean-Pierre said Biden had acted on the bipartisan Speak Out Act, which bars the use of nondisclosure agreements that employees or contractors are required to sign, often as a condition of employment.","url":"https://www.apnews.com/article/biden-business-kirsten-gillibrand-united-states-government-karine-jean-pierre-9be38e03abc6ba2382d386ef4e286776","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":25,"title":"Democrats move to take power with narrow Pa. House majority","shortDescription":"HARRISBURG, Pa. (AP) — Democrats who barely won back a majority of seats in the Pennsylvania House in November moved to take control of the chamber Wednesday and replace one of their incumbents who died and two others who won higher office.","url":"https://www.apnews.com/article/politics-pennsylvania-philadelphia-state-government-d8fa4790096fec4cbced12f16ae40c7f","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":26,"title":"EU eyes Russian officials, banks, industry for sanctions","shortDescription":"BRUSSELS (AP) — The European Union on Wednesday proposed travel bans and asset freezes on almost 200 more Russian officials and military officers as part of a new round of sanctions aimed at ramping up pressure on Moscow over its war in Ukraine.","url":"https://www.apnews.com/article/russia-ukraine-politics-ursula-von-der-leyen-government-and-357d4ab708e9a484558c5c4d4610f319","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":33,"title":"Congress set to rescind COVID-19 vaccine mandate for troops","shortDescription":"WASHINGTON (AP) — The COVID-19 vaccine mandate for members of the U.S. military would be rescinded under the annual defense bill heading for a vote this week in Congress, ending a directive that helped ensure the vast majority of troops were vaccinated but also raised concerns that it harmed recruitment and retention.","url":"https://www.apnews.com/article/biden-health-pandemics-covid-congress-3c63b5c67179228817bc98dc50d2e261","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":34,"title":"Trump’s Constitution remarks put McConnell, GOP on defense","shortDescription":"WASHINGTON (AP) — Senate Republican leader Mitch McConnell delivered another rebuke of former President Donald Trump on Tuesday, saying that anyone who thinks the Constitution can be suspended would have a “very hard time” becoming president in the United States.","url":"https://www.apnews.com/article/twitter-inc-donald-trump-united-states-constitutions-fae554328ba83d8b3dd90243dd98e7db","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":35,"title":"Garland: Justice Dept.’s civil rights work is key priority","shortDescription":"WASHINGTON (AP) — The early work of the Justice Department’s civil rights division meant confronting white supremacists who were intimidating Black voters, and 65 years later, its work is just as urgent amid a surge of hate crimes in the U.S., Attorney General Merrick Garland said Tuesday.","url":"https://www.apnews.com/article/abortion-ahmaud-arbery-shootings-race-and-ethnicity-racial-injustice-880a65c857bb137665867df6d7b1b5e4","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":36,"title":"US court dismisses suit against Saudi prince in killing","shortDescription":"WASHINGTON (AP) — A U.S. federal judge on Tuesday dismissed a lawsuit against Saudi Crown Prince Mohammed bin Salman in the killing of U.S.-based journalist Jamal Khashoggi, bowing to the Biden administration's insistence that the prince was legally immune in the case.","url":"https://www.apnews.com/article/lawsuits-journalists-jamal-khashoggi-district-of-columbia-government-and-politics-a1119915a12cbf7a3c57428fea1781f8","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":37,"title":"Biden visits Arizona computer chip site, highlights jobs","shortDescription":"PHOENIX (AP) — President Joe Biden on Tuesday visited the site for a new computer chip plant in Arizona, using it as a chance to emphasize how his policies are fostering job growth in what could be a challenge to the incoming Republican House majority.","url":"https://www.apnews.com/article/biden-science-technology-government-and-politics-arizona-8c764cdeed7e4917a3323f7f916bcd48","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":38,"title":"DOJ subpoenas election officials in states Trump disputed","shortDescription":"MADISON, Wis. (AP) — Special counsel Jack Smith has subpoenaed local election officials in Wisconsin, Michigan, Arizona and Pennsylvania, asking for communications with or involving former President Donald Trump, his 2020 campaign aides and a list of allies involved in his efforts to try to overturn the results of the election.","url":"https://www.apnews.com/article/wisconsin-arizona-donald-trump-0509a736c89010c0247a7b1428352689","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":39,"title":"Jan. 6 committee to issue criminal referrals, chairman says","shortDescription":"WASHINGTON (AP) — The House committee investigating the Jan. 6 attack on the U.S. Capitol will make criminal referrals to the Justice Department as it wraps up its probe and looks to publish a final report by the end of the year, the panel's chairman said Tuesday.","url":"https://www.apnews.com/article/capitol-siege-donald-trump-liz-cheney-bennie-thompson-government-and-politics-618aedf38a5d18f42ba096e9a20fb3a2","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":40,"title":"Outgoing elections head in key Nevada county details threats","shortDescription":"RENO, Nev. (AP) — Heading into this year’s midterms, the elections director in the largest county in one of the nation’s most important battleground states had a lot on his mind.","url":"https://www.apnews.com/article/business-las-vegas-nevada-7ed28eb920b9ae0e301d9ec9d5b7a947","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":41,"title":"Jan. 6 ‘heroes’ honored for defending Capitol from Trump mob","shortDescription":"WASHINGTON (AP) — Hailed as heroes, the law enforcement officers who defended the U.S. Capitol on Jan. 6, 2021, were honored Tuesday with Congressional Gold Medals and praised for securing democracy when they fought off a brutal and bloody attack by supporters of then-President Donald Trump.","url":"https://www.apnews.com/article/congressional-gold-medals-capitol-siege-officers-f43dc964b5fd14460900275ced64621d","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":42,"title":"US approves $4B sale of Abrams tanks to NATO ally Poland","shortDescription":"WASHINGTON (AP) — The Biden administration on Tuesday approved a nearly $4 billion sale of advanced tanks, other combat vehicles and a large amount of assorted weaponry to NATO ally Poland at a time of heightened security concerns because of the war in neighboring Ukraine.","url":"https://www.apnews.com/article/nato-poland-united-states-europe-national-security-68e959d619e9b164b49aafc087caa817","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":43,"title":"Nebraska Gov. Ricketts seeks appointment to US Senate seat","shortDescription":"OMAHA, Neb. (AP) — Outgoing Nebraska Gov. Pete Ricketts announced his intention Tuesday to seek appointment to the state’s U.S. Senate seat being vacated by fellow Republican Ben Sasse, who is leaving Congress to become president of the University of Florida.","url":"https://www.apnews.com/article/nebraska-pete-ricketts-ben-sasse-university-of-florida-b98fb03556cbb59008ca6dab2d09e9ae","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":44,"title":"Arizona certifies 2022 election despite GOP complaints","shortDescription":"PHOENIX (AP) — Arizona's top officials certified the midterm election results Monday, formalizing victories for Democrats over Republicans who falsely claimed the 2020 election was rigged.","url":"https://www.apnews.com/article/2022-midterm-elections-arizona-biden-cabinet-phoenix-government-and-politics-29f0883bf2a47743d55d1b45ec43cbbf","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":45,"title":"Biden’s efforts to protect abortion access hit roadblocks","shortDescription":"WASHINGTON (AP) — The Biden administration is still actively searching for ways to safeguard abortion access for millions of women, even as it bumps up against a complex web of strict new state laws enacted in the months after the Supreme Court stripped the constitutional right.","url":"https://www.apnews.com/article/abortion-us-supreme-court-health-travel-government-and-politics-c503469ac075698dee8fd951b067b967","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":46,"title":"EXPLAINER: How Supreme Court case could alter US House seats","shortDescription":"Partisan gerrymandering is back before the U.S. Supreme Court in a case stemming from the latest attempt by North Carolina's Republican-led legislature to draw U.S. House districts favoring GOP candidates.","url":"https://www.apnews.com/article/voting-rights-north-carolina-legislature-3d92b5079e7d66913a9a74678e0680d2","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":47,"title":"Ex-Miami US Rep. David Rivera arrested in Venezuela probe","shortDescription":"WASHINGTON (AP) — A former Miami congressman who signed a $50 million consulting contract with Venezuela’s socialist government was arrested Monday on charges of money laundering and representing a foreign government without registering.","url":"https://www.apnews.com/article/venezuela-miami-arrests-criminal-investigations-david-rivera-a81683364212d7c86068839290bd8630","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":48,"title":"Youngkin’s early shine faces test as he eyes White House bid","shortDescription":"RICHMOND, Va. (AP) — Glenn Youngkin swept into office as a Republican sensation with a fresh formula for victory as the GOP contemplated its future beyond Donald Trump.","url":"https://www.apnews.com/article/2022-midterm-elections-donald-trump-virginia-777765c6894f5277d91f055648c6b856","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":49,"title":"White House invites in state lawmakers before 2023 sessions","shortDescription":"WASHINGTON (AP) — The White House is playing host to roughly 50 Democratic state lawmakers from 31 states this week as legislatures prepare for their upcoming sessions, aiming to talk over strategy on top issues like climate change, gun violence, abortion rights and voting rights.","url":"https://www.apnews.com/article/voting-rights-gun-violence-government-and-politics-a92123285af7cb776d80d8b725114c9f","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":0,"title":"Peru president arrested after trying to dissolve Congress, start new government","shortDescription":"Peru President Pedro Castillo was voted out by Congress, shortly after he tried to dissolve the legislature and start a new emergency government.","url":"https://www.usatoday.com/story/news/world/2022/12/07/peru-president-pedro-castillo-tried-dissolve-congress/10852556002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":2,"title":"New search of Trump storage unit yields classified material: sources","shortDescription":"Sources declined to elaborate on the materials, which were retrieved from a West Palm Beach, Florida location, and turned over to federal authorities","url":"https://www.usatoday.com/story/news/politics/2022/12/07/trump-storage-unit-classified-material/10854872002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":3,"title":"Supreme Court spars over case with 'big consequences' for elections","shortDescription":"Voting rights groups say the case could upend federal elections but others say state courts have overstepped their authority over voting laws.","url":"https://www.usatoday.com/story/news/politics/2022/12/07/supreme-court-election-argument-independent-legislature/10835816002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":4,"title":"Supreme Court hears arguments on election laws","shortDescription":"The Supreme Court heard oral arguments for the Moore v. Harper case that could dramatically change local election laws.","url":"https://www.usatoday.com/videos/news/politics/2022/12/07/supreme-court-hears-arguments-could-change-election-laws/10854284002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":7,"title":"OnPolitics: How did Republicans lose Georgia? Walker, Trump and more","shortDescription":"Democrat Raphael Warnock's victory over Republican Herschel Walker expanded Democrats' hold over the Senate. Who's to blame for the GOP's loss?","url":"https://www.usatoday.com/story/news/politics/2022/12/07/walker-trump-lost-georgia-gop/10853261002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":8,"title":"How did Republicans lose Georgia? Walker, Trump's influence and more","shortDescription":"Voters who backed Sen. Raphael Warnock said they found Herschel Walker unqualified for the Senate - not unlike Trump candidates in other states.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/07/trump-warnock-walker-georgia-senate-runoff/10843758002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":12,"title":"Warnock win furthers Senate majority to 51","shortDescription":"Democrat Raphael Warnock won reelection against Republican Herschel Walker in Georgia. This gives Democrats 51 seats in the Senate.","url":"https://www.usatoday.com/videos/news/politics/2022/12/07/democrat-raphael-warnock-has-won-reelection-against-republican-herschel-walker-georgia/10850762002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":14,"title":"Trump companies convicted on all charges in NYC criminal tax fraud case","shortDescription":"Former President Donald Trump was not charged in the case, and did not appear in the courtroom during the trial.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/trump-companies-convicted-all-charges-criminal-tax-fraud-case/10772390002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":15,"title":"5 takeaways from the Georgia Senate runoff","shortDescription":"The Georgia Senate runoff race, which cost $380 million in total, underscored how deeply the country is divided going into 2023.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/06/takeaways-georgia-senate-runoff-warnock-walker/10847782002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":16,"title":"White House tackles antisemitism at forum led by Doug Emhoff","shortDescription":"Jewish groups hope a White House discussion on the rise in antisemitism will lead to a national strategy to combat the problem.","url":"https://www.usatoday.com/story/news/politics/2022/12/07/white-house-rise-antisemitism-doug-emhoff/10839023002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":17,"title":"Biden, Dems extend Senate majority with Georgia win","shortDescription":"Georgia voters give Joe Biden and Democrats a critical 51-seat edge in the Senate, which will no longer require a tie break vote to confirm judges.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/06/warnock-win-democrats-51-seats-senate-majority/10847260002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":18,"title":"Raphael Warnock wins in Georgia Senate race","shortDescription":"Georgia voters sent Democrat Raphael Warnock back to the United States Senate with a runoff win over Republican challenger Herschel Walker.","url":"https://www.usatoday.com/videos/news/politics/2022/12/07/people-have-spoken-democratic-sen-raphael-warnock-celebrates-georgia-runoff-win/10849890002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":19,"title":"Congress poised to rescind COVID-19 vaccine mandate for U.S. troops","shortDescription":"The COVID-19 vaccine mandate for members of the U.S. military would be rescinded under the annual defense bill heading for a vote in Congress","url":"https://www.usatoday.com/story/news/politics/2022/12/06/covid-19-vaccine-mandate-may-no-longer-required-u-s-troops/10849891002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":21,"title":"Biden stops in Arizona as Congress works on bipartisan immigration deal","shortDescription":"President Joe Biden has repeatedly called on Congress to pass immigration reform. This might be his last chance to do so before the next Congress.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/immigration-reform-sinema-tillis-bipartisan-deal/10844204002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":23,"title":"DOJ special counsel issues subpoenas in Trump probes","shortDescription":"Officials in Wisconsin, Michigan and Arizona confirmed Tuesday that subpoenas issued by the special counsel had been received by county authorities.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/doj-special-counsel-subpoenas-trump-probes/10846241002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":25,"title":"Family of deceased Jan. 6 officer refuse to shake hands with GOP leaders","shortDescription":"The family of deceased Jan. 6 police officer Brian Sicknick refused to shake hands with Sen. Mitch McConnell and Rep. Kevin McCarthy, R-Calif.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/jan-6-sicknick-family-refuse-shake-hands-mcconnell-mccarthy/10846247002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":26,"title":"Mitch McConnell hits Donald Trump on call for 'termination' of Constitution","shortDescription":"Senate Republican leader Mitch McConnell rebuked former President Donald Trump and said it will be harder for him to regain the presidency in 2024.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/mitch-mcconnell-donald-trump-terminate-constitution/10844648002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":28,"title":"Jan 6 officers receive Congressional Gold Medals","shortDescription":"The United States Capitol Police and D.C. Metropolitan Police were honored with Congressional Gold Medals for their efforts to defend the United States Capitol during the Jan. 6 insurrection.","url":"https://www.usatoday.com/videos/news/politics/2022/12/06/jan-6-officers-receive-congressional-gold-medals/10845562002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":29,"title":"South Carolina first to vote in presidential primary","shortDescription":"South Carolina will now be the first state to vote in presidential primaries with Democrats knocking Iowa out of its long-held spot.","url":"https://www.usatoday.com/videos/news/politics/2022/12/02/iowa-loses-its-first-spot-line-vote-presidential-primary-south-carolina/10820397002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/02"},{"index":32,"title":"Supreme Court to hear election case with major implications for voters, 2024","shortDescription":"The Supreme Court will hear arguments about whether the Constitution cuts state courts out of the mix for reviewing laws governing federal elections.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/supreme-court-election-independent-state-legislature-moore-harper/10835782002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":5,"title":"“Kids Seem to Be a Paycheck”: How a Billion-Dollar Corporation Exploits Washington’s Special Education System","shortDescription":"Universal Health Services collected more than $38 million in tax dollars for special education services that families and former teachers say it largely didn’t provide","url":"https://www.propublica.org/article/washington-special-education-schools-funding-abuse","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221204-npa-money.jpg","date":"Dec. 4"},{"index":11,"title":"St. Louis Can Banish People From Entire Neighborhoods. Police Can Arrest Them if They Come Back.","shortDescription":"Neighborhood orders of protection in St. Louis are intended to fight petty crime and nuisances but they raise constitutional questions.","url":"https://www.propublica.org/article/st-louis-can-banish-people-from-entire-neighborhoods","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/2022121-NOP-Lead.jpeg","date":"Dec. 1"},{"index":14,"title":"What’s Really at Stake in a Politically Charged Supreme Court Case on Elections","shortDescription":"Moore v. Harper could transform the law — but not in the way that many pundits, or even politicians, anticipate.","url":"https://www.propublica.org/article/moore-v-harper-explained-scotus-elections","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221129-Moore-v-Harper.jpg","date":"Nov. 30"},{"index":3,"title":"After Georgia Loss, G.O.P. Stares Down Its Trump Dilemma","shortDescription":"Republicans from Georgia to Washington traded blame for their bruising defeats in the Senate races. Much of it landed on Donald Trump.By Jonathan Weisman and Maya King","url":"https://www.nytimes.com/2022/12/07/us/politics/georgia-senate-republicans-trump.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/POL-GEORGIA--1-ec28/POL-GEORGIA--1-ec28-thumbWide.jpg","date":"2022/12/07"},{"index":4,"title":"How Can Democrats Use Their Final Weeks in Power?","shortDescription":"Next month, Democrats will lose the ability to pass major legislation for at least two years. By Spencer Bokat-Lindell","url":"https://www.nytimes.com/2022/12/07/opinion/democrats-lame-duck.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/opinion/07debatable-image/07debatable-image-thumbWide.jpg","date":"2022/12/07"},{"index":6,"title":"Trump Is Unraveling Before Our Eyes, but Will It Matter?","shortDescription":"“The Republican Party is in the midst of an identity crisis,” one scholar says. By Thomas B. Edsall","url":"https://www.nytimes.com/2022/12/07/opinion/trump-2024-republican-party.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/07edsall-740-1-8b9c/07edsall-740-1-8b9c-thumbWide.jpg","date":"2022/12/07"},{"index":7,"title":"Warnock Wins, and Once Again Trump Loses","shortDescription":"The Georgia runoff provided yet another case study in why the G.O.P. desperately needs to move on from Trump.By Ross Douthat","url":"https://www.nytimes.com/2022/12/07/opinion/warnock-walker-trump-georgia.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/07douthatNew-1-986a/07douthatNew-1-986a-thumbWide.jpg","date":"2022/12/07"},{"index":8,"title":"Why the Defeat of Herschel Walker, Trump’s Celebrity Pick, Matters","shortDescription":"Walker was a horrific candidate, but the Trump brand has also begun to sour in Georgia.By Charles M. Blow","url":"https://www.nytimes.com/2022/12/07/opinion/walker-georgia-senate-trump.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/09/multimedia/07blow-1-e1a2/07blow-1-e1a2-thumbWide.jpg","date":"2022/12/09"},{"index":11,"title":"Warnock Thanks Supporters After Election Win in Georgia","shortDescription":"Senator Raphael Warnock defeated his Republican challenger, Herschel Walker, in a runoff election and secured Democrats a 51-seat majority in the Senate.By Reuters","url":"https://www.nytimes.com/video/us/elections/100000008676324/warnock-georgia-runoff-speech.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/01/06/multimedia/06georgia-runoff-warnock-speech-01-1-c789/06georgia-runoff-warnock-speech-01-1-c789-thumbWide.jpg","date":"2022/01/06"},{"index":0,"title":"Dems plot their own government funding plan as talks stall","shortDescription":"The party's decision to release a proposal with no GOP buy-in comes as the two sides have made almost no progress on negotiations since last week.","url":"https://www.politico.com/news/2022/12/07/dems-government-funding-package-00072820","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/07"},{"index":2,"title":"‘Turn left, Republicans’: Schumer jokes after cellphone interruption","shortDescription":"","url":"https://www.politico.com/video/2022/12/07/turn-left-republicans-schumer-jokes-after-cellphone-interruption-788540","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/07"},{"index":3,"title":"Senate conservatives plot their second act after taking on McConnell","shortDescription":"","url":"https://www.politico.com/news/2022/12/07/after-fight-with-mcconnell-conservatives-quietly-plot-comeback-00072627","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/07"},{"index":4,"title":"McCarthy or bust? House GOP stuck in ‘burning building’ over speaker's gavel","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/mccarthy-house-gop-speakership-00072553","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":5,"title":"Fallen officer's family snubs McConnell and McCarthy at Jan. 6 gold medal ceremony","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/mcconnell-mccarthy-police-gold-medal-ceremony-00072546","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":7,"title":"Lawmakers labor to break impasses stalling massive spending bill","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/lawmakers-labor-impasses-spending-bill-00072529","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":8,"title":"GOP senators tune out House conservatives’ impeachment calls","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/republican-senators-mccarthy-impeachment-00072420","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":9,"title":"Senate Republicans turn on Trump over suspend-the-Constitution talk","shortDescription":"","url":"https://www.politico.com/news/2022/12/05/senate-republicans-trump-suspending-constitution-00072265","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/05"},{"index":12,"title":"Midterms deliver one last Trump loss: 3 takeaways from Georgia’s Senate runoff","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/trump-loses-again-georgia-runoff-results-00072685","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/06"}]