[{"index":0,"title":"Cambodian monks declare support for Trump to get Nobel Peace Prize","shortDescription":"President Donald Trump has been nominated for a Nobel Peace Prize in the past, but has never won. Cambodian Buddhist monks think he should.","url":"https://www.usatoday.com/story/news/politics/2025/08/21/cambodian-monks-trump/85754734007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/21"},{"index":1,"title":"Trump's $454 million civil fraud penalty thrown out by appeals court","shortDescription":"The $454 million penalty imposed against President Donald Trump in his New York civil fraud case has been thrown out by an appeals court.","url":"https://www.usatoday.com/story/news/politics/2025/08/21/donald-trump-civil-fraud-case-appeal-decision/85759082007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/21"},{"index":2,"title":"Trump's 2028 successor is a 'jump ball,' Republican senator says","shortDescription":"Vice President JD Vance shouldn't be considered the automatic MAGA heir to Donald Trump, Sen. Thom Tillis said.","url":"https://www.usatoday.com/story/news/politics/2025/08/21/trumps-2028-successor-a-jump-ball-republican-sen-thom-tillis-says/85756259007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/21"},{"index":3,"title":"White House suspends tours for Trump's ballroom construction","shortDescription":"The White House suspended tours indefinitely starting Sept. 1 for construction President Donald Trump's planned ballroom.","url":"https://www.usatoday.com/story/news/politics/2025/08/21/white-house-suspends-tours-public-ballroom/85757227007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/21"},{"index":6,"title":"See the Rose Garden's new look amid Trump's White House makeover","shortDescription":"See the Rose Garden's new look amid Trump's White House makeover.","url":"https://www.usatoday.com/picture-gallery/news/politics/2025/08/21/rose-garden-white-house-renovation-photos/85755409007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/21"},{"index":7,"title":"Trump says Ukraine may be his ticket into heaven. What religion is he?","shortDescription":"President Donald Trump spoke about his efforts at peace between Russia and Ukraine on Fox News. He talked about wanting to get into heaven for peace.","url":"https://www.usatoday.com/story/news/politics/2025/08/21/trump-heaven/85754921007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/21"},{"index":8,"title":"Police in Iowa charge man accused of ripping down Trump protest signs","shortDescription":"In a video, a man can be seen ripping placards spelling “TRUMP = HITLER”, that had been fastened to a bridge railing with bungee cords.","url":"https://www.usatoday.com/story/news/politics/2025/08/21/iowa-trump-sign-posters-protest/85754610007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/21"},{"index":14,"title":"Texas House passes Trump-backed map","shortDescription":"The Texas House GOP approved a Trump-backed congressional map. It still needs Senate approval and the Governor’s signature.","url":"https://www.usatoday.com/videos/news/politics/2025/08/20/texas-house-approves-trump-backed-congressional-map/85751119007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":22,"title":"Trump official lashes out at 'stupid white hippies' amid DC takeover","shortDescription":"Trump administration officials led by JD Vance fired back at protests targeting the federal takeover of D.C. during a wild scene at Union Station.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/stephen-miller-jd-vance-stupid-white-hippies-dc/85744097007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":23,"title":"Gov. Newsom Pushes To Redraw Maps To Counter Texas Republicans","shortDescription":"California Governor Gavin Newsom has unveiled a high-stakes plan to redraw voting districts in his state to counter similar efforts by Republicans in Texas.\nNewsom announced that California would hold a special election in November, in which voters would be asked to approve a mid-decade redistricting plan ahead of the 2026 national midterms.\n Newsom characterized the move as an emergency measure in response to a President Donald Trump-backed plan in Texas, which could allow Republicans to gain five more seats in the House. \nAnnouncing the plan at the Japanese American National Museum’s National Center for the Preservation of Democracy, Newsom vowed the move would “neuter and neutralize” Texas’s plan. \n“We're working through a very transparent, temporary, and public process. We're putting the maps on the ballot and empowering the people. We must recognize the cards we have been dealt and meet fire with fire,” Newsom said. \nIf successful, Newsom’s plan would allow California to retain its current congressional maps if Texas and other states withdraw from any changes.\nThe move comes amid ongoing Republican-led redistricting efforts in Florida and Ohio, as well as discussions to do the same in Indiana and Missouri.\nRepublicans in Texas have so far been blocked from approving new maps as House Democrats fled the state, preventing the chamber from reaching a quorum to proceed with a vote. \nTexas Governor Greg Abbott has threatened to arrest the Texas Democrats for fleeing, vowing to hold continuous special legislative sessions until the proposal passes.","url":"https://www.usatoday.com/videos/news/2025/08/20/gov-newsom-pushes-to-redraw-maps-to-counter-texas-republicans/85672379007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":26,"title":"Jack White blasts Donald Trump's Oval Office makeover","shortDescription":"Jack White has blasted Donald Trump’s Oval Office makeover, calling it “vulgar” and “gaudy.”","url":"https://www.usatoday.com/videos/news/2025/08/20/jack-white-blasts-donald-trumps-oval-office-makeover/85737925007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":27,"title":"What is Trump's approval rating this week? What the polling says.","shortDescription":"A succession of national polls released in August show a dip in public opinion of the president's job performance, with some marking record-lows.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/trump-approval-rating-august-putin-zelenskyy-meeting/85739159007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":28,"title":"Trump buys more than $100 million in bonds in office, disclosure shows","shortDescription":"Trump's financial disclosure shows corporate bond buys from Citigroup, Morgan Stanley, Wells Fargo, Meta, Qualcomm, T-Mobile USA and The Home Depot.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/trump-financial-disclosure-bonds/85743504007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":30,"title":"Texas Rep. Nicole Collier spends night on House floor","shortDescription":"Democrats in the Texas House of Representatives returned to Austin on Aug. 18, 2025, but their protest of redistricting efforts continues.","url":"https://www.usatoday.com/picture-gallery/news/politics/2025/08/20/texas-democrats-nicole-collier-protest-redistricting-photos/85742810007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":31,"title":"Trump calls for Fed governor to resign over alleged mortgage fraud","shortDescription":"President Donald Trump called for Lisa Cook to resign from the Federal Reserve's board after his administration accused her of engaging in mortgage fraud.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/trump-lisa-cook-fed-reserve-governor-resign-mortgage-fraud/85740719007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"}]