[{"index":0,"title":"Democratic Sen. Warnock wins Georgia runoff against Walker","shortDescription":"","url":"https://www.apnews.com/article/2022-midterm-elections-walker-warnock-runoff-3d4e4d1ab1760792454e1cbd618ce332","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":1,"title":"Justices take up elections case that could reshape voting","shortDescription":"WASHINGTON (AP) — The Supreme Court is taking up a case with the potential to fundamentally reshape elections for Congress and the presidency.The justices are hearing arguments Wednesday over the power of state courts to strike down congressional districts drawn by the legislature because they violate state constitutions.","url":"https://www.apnews.com/article/us-supreme-court-north-carolina-5615105a88cedadcd2ce738f2cfe3a16","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":3,"title":"Congress set to rescind COVID-19 vaccine mandate for troops","shortDescription":"WASHINGTON (AP) — The COVID-19 vaccine mandate for members of the U.S. military would be rescinded under the annual defense bill heading for a vote this week in Congress, ending a directive that helped ensure the vast majority of troops were vaccinated but also raised concerns that it harmed recruitment and retention.","url":"https://www.apnews.com/article/biden-health-pandemics-covid-congress-3c63b5c67179228817bc98dc50d2e261","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":4,"title":"DOJ subpoenas election officials in states Trump disputed","shortDescription":"MADISON, Wis. (AP) — Special counsel Jack Smith has subpoenaed local election officials in Wisconsin, Michigan, Arizona and Pennsylvania, asking for communications with or involving former President Donald Trump, his 2020 campaign aides and a list of allies involved in his efforts to try to overturn the results of the election.","url":"https://www.apnews.com/article/wisconsin-arizona-donald-trump-0509a736c89010c0247a7b1428352689","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":5,"title":"Jan. 6 committee to issue criminal referrals, chairman says","shortDescription":"WASHINGTON (AP) — The House committee investigating the Jan. 6 attack on the U.S. Capitol will make criminal referrals to the Justice Department as it wraps up its probe and looks to publish a final report by the end of the year, the panel's chairman said Tuesday.","url":"https://www.apnews.com/article/capitol-siege-donald-trump-liz-cheney-bennie-thompson-government-and-politics-618aedf38a5d18f42ba096e9a20fb3a2","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":6,"title":"Speedier drug approvals hit slowdown as FDA faces scrutiny","shortDescription":"WASHINGTON (AP) — Expedited drug approvals slowed this year as the Food and Drug Administration's controversial accelerated pathway came under new scrutiny from Congress, government watchdogs and some of the agency’s own leaders.","url":"https://www.apnews.com/article/health-cancer-business-congress-drug-approvals-e029b9f3f72b4282ad39d2d00902edfe","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":7,"title":"Jan. 6 ‘heroes’ honored for defending Capitol from Trump mob","shortDescription":"WASHINGTON (AP) — Hailed as heroes, the law enforcement officers who defended the U.S. Capitol on Jan. 6, 2021, were honored Tuesday with Congressional Gold Medals and praised for securing democracy when they fought off a brutal and bloody attack by supporters of then-President Donald Trump.","url":"https://www.apnews.com/article/congressional-gold-medals-capitol-siege-officers-f43dc964b5fd14460900275ced64621d","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":8,"title":"Trump’s Constitution remarks put McConnell, GOP on defense","shortDescription":"WASHINGTON (AP) — Senate Republican leader Mitch McConnell delivered another rebuke of former President Donald Trump on Tuesday, saying that anyone who thinks the Constitution can be suspended would have a “very hard time” becoming president in the United States.","url":"https://www.apnews.com/article/twitter-inc-donald-trump-united-states-constitutions-fae554328ba83d8b3dd90243dd98e7db","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":9,"title":"US approves $425 million in arms sales to Taiwan","shortDescription":"WASHINGTON (AP) — The Biden administration on Tuesday signed off on two new significant arms sales to Taiwan in approvals that are sure to rankle China.The State Department said it had okayed sales worth more than $425 million of spare aircraft parts to support Taiwan's fleet of F-16 fighters, C-130 transport planes and other U.S.-supplied weapons systems.","url":"https://www.apnews.com/article/biden-taiwan-business-china-xi-jinping-ee81302800a9121614140683ff31e0ca","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":11,"title":"Garland: Justice Dept.’s civil rights work is key priority","shortDescription":"WASHINGTON (AP) — The early work of the Justice Department’s civil rights division meant confronting white supremacists who were intimidating Black voters, and 65 years later, its work is just as urgent amid a surge of hate crimes in the U.S., Attorney General Merrick Garland said Tuesday.","url":"https://www.apnews.com/article/abortion-ahmaud-arbery-shootings-race-and-ethnicity-racial-injustice-880a65c857bb137665867df6d7b1b5e4","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":12,"title":"US court dismisses suit against Saudi prince in killing","shortDescription":"WASHINGTON (AP) — A U.S. federal judge on Tuesday dismissed a lawsuit against Saudi Crown Prince Mohammed bin Salman in the killing of U.S.-based journalist Jamal Khashoggi, bowing to the Biden administration's insistence that the prince was legally immune in the case.","url":"https://www.apnews.com/article/lawsuits-journalists-jamal-khashoggi-district-of-columbia-government-and-politics-a1119915a12cbf7a3c57428fea1781f8","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":13,"title":"Biden visits Arizona computer chip site, highlights jobs","shortDescription":"PHOENIX (AP) — President Joe Biden on Tuesday visited the site for a new computer chip plant in Arizona, using it as a chance to emphasize how his policies are fostering job growth in what could be a challenge to the incoming Republican House majority.","url":"https://www.apnews.com/article/biden-science-technology-government-and-politics-arizona-8c764cdeed7e4917a3323f7f916bcd48","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":14,"title":"Outgoing elections head in key Nevada county details threats","shortDescription":"RENO, Nev. (AP) — Heading into this year’s midterms, the elections director in the largest county in one of the nation’s most important battleground states had a lot on his mind.","url":"https://www.apnews.com/article/business-las-vegas-nevada-7ed28eb920b9ae0e301d9ec9d5b7a947","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":15,"title":"US approves $4B sale of Abrams tanks to NATO ally Poland","shortDescription":"WASHINGTON (AP) — The Biden administration on Tuesday approved a nearly $4 billion sale of advanced tanks, other combat vehicles and a large amount of assorted weaponry to NATO ally Poland at a time of heightened security concerns because of the war in neighboring Ukraine.","url":"https://www.apnews.com/article/nato-poland-united-states-europe-national-security-68e959d619e9b164b49aafc087caa817","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":16,"title":"Nebraska Gov. Ricketts seeks appointment to US Senate seat","shortDescription":"OMAHA, Neb. (AP) — Outgoing Nebraska Gov. Pete Ricketts announced his intention Tuesday to seek appointment to the state’s U.S. Senate seat being vacated by fellow Republican Ben Sasse, who is leaving Congress to become president of the University of Florida.","url":"https://www.apnews.com/article/nebraska-pete-ricketts-ben-sasse-university-of-florida-b98fb03556cbb59008ca6dab2d09e9ae","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":17,"title":"Arizona certifies 2022 election despite GOP complaints","shortDescription":"PHOENIX (AP) — Arizona's top officials certified the midterm election results Monday, formalizing victories for Democrats over Republicans who falsely claimed the 2020 election was rigged.","url":"https://www.apnews.com/article/2022-midterm-elections-arizona-biden-cabinet-phoenix-government-and-politics-29f0883bf2a47743d55d1b45ec43cbbf","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":18,"title":"Biden’s efforts to protect abortion access hit roadblocks","shortDescription":"WASHINGTON (AP) — The Biden administration is still actively searching for ways to safeguard abortion access for millions of women, even as it bumps up against a complex web of strict new state laws enacted in the months after the Supreme Court stripped the constitutional right.","url":"https://www.apnews.com/article/abortion-us-supreme-court-health-travel-government-and-politics-c503469ac075698dee8fd951b067b967","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":19,"title":"EXPLAINER: How Supreme Court case could alter US House seats","shortDescription":"Partisan gerrymandering is back before the U.S. Supreme Court in a case stemming from the latest attempt by North Carolina's Republican-led legislature to draw U.S. House districts favoring GOP candidates.","url":"https://www.apnews.com/article/voting-rights-north-carolina-legislature-3d92b5079e7d66913a9a74678e0680d2","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":20,"title":"Ex-Miami US Rep. David Rivera arrested in Venezuela probe","shortDescription":"WASHINGTON (AP) — A former Miami congressman who signed a $50 million consulting contract with Venezuela’s socialist government was arrested Monday on charges of money laundering and representing a foreign government without registering.","url":"https://www.apnews.com/article/venezuela-miami-arrests-criminal-investigations-david-rivera-a81683364212d7c86068839290bd8630","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":21,"title":"Youngkin’s early shine faces test as he eyes White House bid","shortDescription":"RICHMOND, Va. (AP) — Glenn Youngkin swept into office as a Republican sensation with a fresh formula for victory as the GOP contemplated its future beyond Donald Trump.","url":"https://www.apnews.com/article/2022-midterm-elections-donald-trump-virginia-777765c6894f5277d91f055648c6b856","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":22,"title":"White House invites in state lawmakers before 2023 sessions","shortDescription":"WASHINGTON (AP) — The White House is playing host to roughly 50 Democratic state lawmakers from 31 states this week as legislatures prepare for their upcoming sessions, aiming to talk over strategy on top issues like climate change, gun violence, abortion rights and voting rights.","url":"https://www.apnews.com/article/voting-rights-gun-violence-government-and-politics-a92123285af7cb776d80d8b725114c9f","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":23,"title":"US says it will expand, extend temporary status for Haitians","shortDescription":"SAN DIEGO (AP) — The Biden administration said Monday that it would expand temporary legal status for Haitians already living in the United States, determining conditions in the Caribbean nation were too dangerous for their forced return.","url":"https://www.apnews.com/article/caribbean-united-states-haiti-government-and-politics-631bf0be57496e06d2c586f4a4a5fcaf","source":"AP News","slug":"apnews","imageUrl":"","date":"December 6, 2022"},{"index":25,"title":"Warnock, Walker: Starkly different choices for Black voters","shortDescription":"ATLANTA (AP) — Raphael Warnock is the first Black U.S. senator from Georgia, having broken the color barrier for one of the original 13 states with a special election victory in January 2021, almost 245 years after the nation’s founding.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-college-football-sports-49815bbbd5d99540bed016c39d84040d","source":"AP News","slug":"apnews","imageUrl":"","date":"December 5, 2022"},{"index":29,"title":"Trump faces peril in docs probe after decades of scrutiny","shortDescription":"WASHINGTON (AP) — As a businessman and president, Donald Trump faced a litany of lawsuits and criminal investigations yet emerged from the legal scrutiny time and again with his public and political standing largely intact.","url":"https://www.apnews.com/article/lawsuits-donald-trump-mar-a-lago-b7fb8ad8b313a622b209708bb0b01d41","source":"AP News","slug":"apnews","imageUrl":"","date":"December 5, 2022"},{"index":31,"title":"EXPLAINER: Congress is acting on gay, interracial marriage","shortDescription":"CHICAGO (AP) — Legislation that ensures same-sex and interracial marriages are recognized as legal unions appears headed for final approval and President Joe Biden's signature, a bipartisan agreement that reflects a wider acceptance of gay rights in both Congress and the country.","url":"https://www.apnews.com/article/congress-gay-interracial-marriage-what-to-know-ad3988c74c639f79112befa18065d4b3","source":"AP News","slug":"apnews","imageUrl":"","date":"December 5, 2022"},{"index":32,"title":"What to watch in Tuesday’s Georgia Senate runoff election","shortDescription":"ATLANTA (AP) — The extended Senate campaign in Georgia gives Democratic Sen. Raphael Warnock and Republican challenger Herschel Walker a second chance to persuade voters to send them to Washington.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-general-congress-46c89ee59c4c344fbf61fafad371a9ae","source":"AP News","slug":"apnews","imageUrl":"","date":"December 5, 2022"},{"index":33,"title":"Supreme Court weighs ‘most important case’ on democracy","shortDescription":"WASHINGTON (AP) — The Supreme Court is about to confront a new elections case, a Republican-led challenge asking the justices for a novel ruling that could significantly increase the power of state lawmakers over elections for Congress and the presidency.","url":"https://www.apnews.com/article/us-supreme-court-north-carolina-legislature-50f99679939b5d69d321858066a94639","source":"AP News","slug":"apnews","imageUrl":"","date":"December 4, 2022"},{"index":34,"title":"Blinken vows US support for Israel despite unease over gov’t","shortDescription":"WASHINGTON (AP) — Secretary of State Antony Blinken said Sunday the U.S. will not shrink from its unwavering support for Israel despite stark differences with Prime Minister-elect Benjamin Netanyahu and concerns the Biden administration may have about potential members of his incoming right-wing government.","url":"https://www.apnews.com/article/iran-israel-middle-east-nuclear-antony-blinken-eb244d18da448b14cd9b2b6bb0e0dfec","source":"AP News","slug":"apnews","imageUrl":"","date":"December 4, 2022"},{"index":35,"title":"Trump rebuked for call to suspend Constitution over election","shortDescription":"WASHINGTON (AP) — Former President Donald Trump faced rebuke Sunday from officials in both parties after calling for the “termination” of parts of the Constitution over his lie that the 2020 election was stolen.","url":"https://www.apnews.com/article/social-media-donald-trump-8e6e2f0a092135428c82c0cfa6598444","source":"AP News","slug":"apnews","imageUrl":"","date":"December 4, 2022"},{"index":38,"title":"In Georgia, how sports explain a political battleground","shortDescription":"SMYRNA, Ga. (AP) — The reception area of a metro Atlanta office suite is a veritable museum of Herschel Walker’s football success for the University of Georgia Bulldogs and the NFL. The office is part of the Atlanta Braves' real estate development in the Major League Baseball franchise's new suburban home.","url":"https://www.apnews.com/article/herschel-walker-mlb-college-football-sports-soccer-b167dfa6b1eb7a1cba0cca4b5e518e37","source":"AP News","slug":"apnews","imageUrl":"","date":"December 4, 2022"},{"index":39,"title":"Longtime Arizona GOP Rep. Jim Kolbe dies at 80","shortDescription":"PHOENIX (AP) — Jim Kolbe, a Republican congressman who represented a heavily Democratic region of Arizona for more than two decades and was a proponent of gay rights, has died. He was 80.","url":"https://www.apnews.com/article/arizona-immigration-legislature-global-trade-business-1b9e69ed2f33ff5f13b6d8f59d0462b4","source":"AP News","slug":"apnews","imageUrl":"","date":"December 4, 2022"},{"index":42,"title":"Turkish strikes on US Kurd allies resonate in Ukraine war","shortDescription":"BUCHAREST, Romania (AP) — Biden administration officials are toughening their language toward NATO ally Turkey as they try to talk Turkish President Recep Erdogan out of launching a bloody and destabilizing ground offensive against American-allied Kurdish forces in neighboring Syria.","url":"https://www.apnews.com/article/islamic-state-group-nato-syria-bucharest-turkey-bb1980f532b5a44cbc693897c853d9f1","source":"AP News","slug":"apnews","imageUrl":"","date":"December 3, 2022"},{"index":44,"title":"Non-religious voters wield clout, tilt heavily Democratic","shortDescription":"When members of the small Pennsylvania chapter of Secular Democrats of America log on for their monthly meetings, they're not there for a virtual happy hour.“We don’t sit around at our meetings patting ourselves on the back for not believing in God together,” said David Brown, a founder from the Philadelphia suburb of Ardmore.","url":"https://www.apnews.com/article/abortion-pennsylvania-reproductive-rights-e5eb366a76995619a2c9bae200f414e6","source":"AP News","slug":"apnews","imageUrl":"","date":"December 3, 2022"},{"index":45,"title":"Defeated election conspiracists seek to lead Michigan GOP","shortDescription":"LANSING, Mich. (AP) — The Republicans who lost their races for Michigan's top three statewide offices after promoting falsehoods about the 2020 presidential election are not planning to go quietly.","url":"https://www.apnews.com/article/biden-michigan-0eeb4b49f135bcc5f5197168f1946f9b","source":"AP News","slug":"apnews","imageUrl":"","date":"December 3, 2022"},{"index":49,"title":"GOP’s Duarte takes California Central Valley US House seat","shortDescription":"LOS ANGELES (AP) — Republican John Duarte defeated Democrat Adam Gray on Friday in a new California U.S. House district in the Central Valley farm belt that produced the closest congressional contest in the state this year.","url":"https://www.apnews.com/article/2022-midterm-elections-california-race-and-ethnicity-congress-government-politics-a75c8a9b693ce9a39cce7be09eb124dc","source":"AP News","slug":"apnews","imageUrl":"","date":"December 3, 2022"},{"index":1,"title":"Warnock win furthers Senate majority to 51","shortDescription":"Democrat Raphael Warnock won reelection against Republican Herschel Walker in Georgia. This gives Democrats 51 seats in the Senate.","url":"https://www.usatoday.com/videos/news/politics/2022/12/07/democrat-raphael-warnock-has-won-reelection-against-republican-herschel-walker-georgia/10850762002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":3,"title":"Trump companies convicted on all charges in NYC criminal tax fraud case","shortDescription":"Former President Donald Trump was not charged in the case, and did not appear in the courtroom during the trial.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/trump-companies-convicted-all-charges-criminal-tax-fraud-case/10772390002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":4,"title":"5 takeaways from the Georgia Senate runoff","shortDescription":"The Georgia Senate runoff race, which cost $380 million in total, underscored how deeply the country is divided going into 2023.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/06/takeaways-georgia-senate-runoff-warnock-walker/10847782002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":6,"title":"White House tackles antisemitism at forum led by Doug Emhoff","shortDescription":"Jewish groups hope a White House discussion on the rise in antisemitism will lead to a national strategy to combat the problem.","url":"https://www.usatoday.com/story/news/politics/2022/12/07/white-house-rise-antisemitism-doug-emhoff/10839023002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":7,"title":"Biden, Dems extend Senate majority with Georgia win","shortDescription":"Georgia voters give Joe Biden and Democrats a critical 51-seat edge in the Senate, which will no longer require a tie break vote to confirm judges.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/06/warnock-win-democrats-51-seats-senate-majority/10847260002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":8,"title":"Raphael Warnock wins in Georgia Senate race","shortDescription":"Georgia voters sent Democrat Raphael Warnock back to the United States Senate with a runoff win over Republican challenger Herschel Walker.","url":"https://www.usatoday.com/videos/news/politics/2022/12/07/people-have-spoken-democratic-sen-raphael-warnock-celebrates-georgia-runoff-win/10849890002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":9,"title":"Congress poised to rescind COVID-19 vaccine mandate for U.S. troops","shortDescription":"The COVID-19 vaccine mandate for members of the U.S. military would be rescinded under the annual defense bill heading for a vote in Congress","url":"https://www.usatoday.com/story/news/politics/2022/12/06/covid-19-vaccine-mandate-may-no-longer-required-u-s-troops/10849891002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":11,"title":"Biden stops in Arizona as Congress works on bipartisan immigration deal","shortDescription":"President Joe Biden has repeatedly called on Congress to pass immigration reform. This might be his last chance to do so before the next Congress.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/immigration-reform-sinema-tillis-bipartisan-deal/10844204002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":13,"title":"DOJ special counsel issues subpoenas in Trump probes","shortDescription":"Officials in Wisconsin, Michigan and Arizona confirmed Tuesday that subpoenas issued by the special counsel had been received by county authorities.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/doj-special-counsel-subpoenas-trump-probes/10846241002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":15,"title":"Family of deceased Jan. 6 officer refuse to shake hands with GOP leaders","shortDescription":"The family of deceased Jan. 6 police officer Brian Sicknick refused to shake hands with Sen. Mitch McConnell and Rep. Kevin McCarthy, R-Calif.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/jan-6-sicknick-family-refuse-shake-hands-mcconnell-mccarthy/10846247002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":16,"title":"Mitch McConnell hits Donald Trump on call for 'termination' of Constitution","shortDescription":"Senate Republican leader Mitch McConnell rebuked former President Donald Trump and said it will be harder for him to regain the presidency in 2024.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/mitch-mcconnell-donald-trump-terminate-constitution/10844648002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":18,"title":"Jan 6 officers receive Congressional Gold Medals","shortDescription":"The United States Capitol Police and D.C. Metropolitan Police were honored with Congressional Gold Medals for their efforts to defend the United States Capitol during the Jan. 6 insurrection.","url":"https://www.usatoday.com/videos/news/politics/2022/12/06/jan-6-officers-receive-congressional-gold-medals/10845562002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":19,"title":"South Carolina first to vote in presidential primary","shortDescription":"South Carolina will now be the first state to vote in presidential primaries with Democrats knocking Iowa out of its long-held spot.","url":"https://www.usatoday.com/videos/news/politics/2022/12/02/iowa-loses-its-first-spot-line-vote-presidential-primary-south-carolina/10820397002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/02"},{"index":22,"title":"Supreme Court to hear election case with major implications for voters, 2024","shortDescription":"The Supreme Court will hear arguments about whether the Constitution cuts state courts out of the mix for reviewing laws governing federal elections.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/supreme-court-election-independent-state-legislature-moore-harper/10835782002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":23,"title":"Georgia 2022 Senate runoff: Democrat Raphael Warnock beats Herschel Walker","shortDescription":"Election results recap: Georgia gave Democratic incumbent Raphael Warnock the win over Republican Herschel Walker in a Senate runoff.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/06/georgia-senate-runoff-live-updates-warnock-walker/10839609002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":24,"title":"Election day in the Peach State: How the Georgia runoff works.","shortDescription":"Today in Georgia it's Walker vs. Warnock round two as the candidates face off in a closely watched senate runoff election.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/what-is-a-runoff-election/10844069002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":25,"title":"Walker, Sen. Warnock rally before final vote","shortDescription":"Herschel Walker and Senator Raphael Warnock hold final rallies before the last day to vote in the Georgia Senate run-off.","url":"https://www.usatoday.com/videos/news/politics/2022/12/06/herschel-walker-raphael-warnock-hold-final-rallies-before-run-off/10843352002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":26,"title":"Trump candidacy, controversies put Mar-a-Lago back in spotlight","shortDescription":"Mar-a-Lago has been Trump's MAGA mecca despite perceived conflicts of interests when Trump was in office and  self-dealing since.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/trumps-controversies-mar-lago-spotlight/10841535002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":27,"title":"Biden heads to AZ: Taiwan Semiconductor to vastly increase stake in Phoenix","shortDescription":"TMSC's original investment would more than triple and the $40 billion stake would represent the largest private-sector investment ever in Arizona.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/tsmc-announces-2nd-factory-in-phoenix-as-president-biden-visits-arizona/10843062002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":28,"title":"Chuck Schumer rips Trump's Constitution remarks","shortDescription":"Senate Majority Leader Schumer chided former president Donald Trump after he called for the “termination” of the Constitution over the 2020 election.","url":"https://www.usatoday.com/videos/news/politics/2022/12/06/chuck-schumer-rips-trump-termination-constitution-comments/10841702002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":29,"title":"Backlash grows over Democrats' plan to push back N.H. primary","shortDescription":"The Democratic National Committee’s move to push back New Hampshire’s 2024 presidential primary has drawn protests from Democrats and Republicans.","url":"https://www.usatoday.com/story/news/politics/2022/12/05/new-hampshire-republican-democrat-early-primary/10840646002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/05"},{"index":30,"title":"OnPolitics: Who will Georgia voters pick?","shortDescription":"Voters have broken early-voting turnout records. Here are the issues motivating Georgians.","url":"https://www.usatoday.com/story/news/politics/2022/12/05/tuesday-runoff-election-day-georgia/10839966002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/05"},{"index":31,"title":"Jury deliberates in criminal tax fraud trial of 2 Trump companies","shortDescription":"The panel of eight men and four women was reminded by the judge that former president was not charged in the case.","url":"https://www.usatoday.com/story/news/politics/2022/12/05/jury-deliberates-in-trump-companies-tax-fraud-trial/10837275002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/05"},{"index":32,"title":"Can Dems build on their Senate majority? Georgia runoff will decide.","shortDescription":"Incumbent Sen. Raphael Warnock and GOP challenger Herschel Walker are once again in a tight race ahead of Georgia's runoff Senate election.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/05/georgia-senate-race-walker-and-warnock-turnout/10797398002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/05"},{"index":4,"title":"“Kids Seem to Be a Paycheck”: How a Billion-Dollar Corporation Exploits Washington’s Special Education System","shortDescription":"Universal Health Services collected more than $38 million in tax dollars for special education services that families and former teachers say it largely didn’t provide","url":"https://www.propublica.org/article/washington-special-education-schools-funding-abuse","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221204-npa-money.jpg","date":"Dec. 4"},{"index":10,"title":"St. Louis Can Banish People From Entire Neighborhoods. Police Can Arrest Them if They Come Back.","shortDescription":"Neighborhood orders of protection in St. Louis are intended to fight petty crime and nuisances but they raise constitutional questions.","url":"https://www.propublica.org/article/st-louis-can-banish-people-from-entire-neighborhoods","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/2022121-NOP-Lead.jpeg","date":"Dec. 1"},{"index":13,"title":"What’s Really at Stake in a Politically Charged Supreme Court Case on Elections","shortDescription":"Moore v. Harper could transform the law — but not in the way that many pundits, or even politicians, anticipate.","url":"https://www.propublica.org/article/moore-v-harper-explained-scotus-elections","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221129-Moore-v-Harper.jpg","date":"Nov. 30"},{"index":2,"title":"Trump Is Unraveling Before Our Eyes, but Will It Matter?","shortDescription":"“The Republican Party is in the midst of an identity crisis,” one scholar says. By Thomas B. Edsall","url":"https://www.nytimes.com/2022/12/07/opinion/trump-2024-republican-party.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/07edsall-740-1-8b9c/07edsall-740-1-8b9c-thumbWide.jpg","date":"2022/12/07"},{"index":3,"title":"Warnock Wins, and Once Again Trump Loses","shortDescription":"The Georgia runoff provided yet another case study in why the G.O.P. desperately needs to move on from Trump.By Ross Douthat","url":"https://www.nytimes.com/2022/12/07/opinion/warnock-walker-trump-georgia.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/07douthatNew-1-986a/07douthatNew-1-986a-thumbWide.jpg","date":"2022/12/07"},{"index":4,"title":"Walker, Trump’s Celebrity Pick, Underscores Trump’s Fall","shortDescription":"Herschel Walker was a horrific candidate, but the Trump brand has also begun to sour in Georgia.By Charles M. Blow","url":"https://www.nytimes.com/2022/12/07/opinion/walker-georgia-senate-trump.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/07blow-1-e1a2/07blow-1-e1a2-thumbWide.jpg","date":"2022/12/07"},{"index":7,"title":"Warnock Thanks Supporters After Election Win in Georgia","shortDescription":"Senator Raphael Warnock defeated his Republican challenger, Herschel Walker, in a runoff election and secured Democrats a 51-seat majority in the Senate.By Reuters","url":"https://www.nytimes.com/video/us/elections/100000008676324/warnock-georgia-runoff-speech.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/01/06/multimedia/06georgia-runoff-warnock-speech-01-1-c789/06georgia-runoff-warnock-speech-01-1-c789-thumbWide.jpg","date":"2022/01/06"},{"index":8,"title":"5 Georgia Takeaways: Scandals Still Matter, and Trump Faces Blowback","shortDescription":"Herschel Walker’s loss to Senator Raphael Warnock showed that flawed candidates cannot always rely on partisan loyalties to lift them. And it is likely to deepen Republican infighting over Donald Trump’s drag on the party.By Blake Hounshell","url":"https://www.nytimes.com/2022/12/07/us/politics/takeaways-georgia-senate-runoff.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/06/us/politics/07pol-takeaways/live-blog-20221206-warnock-walker-georgia-senate-runoff-header-thumbWide.jpg","date":"2022/12/06"},{"index":9,"title":"Democrats Didn’t Just Win Georgia. They Secured a Firmer Grip on the Senate.","shortDescription":"Senator Raphael Warnock’s victory provides a real working majority for Democrats after two years of a tenuous 50-50 split.By Carl Hulse","url":"https://www.nytimes.com/2022/12/06/us/democrats-georgia-senate-majority.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/06/multimedia/07dc-senate/07dc-senate-thumbWide.jpg","date":"2022/12/06"},{"index":0,"title":"Fallen officer's family snubs McConnell and McCarthy at Jan. 6 gold medal ceremony","shortDescription":"Officers who responded to the Capitol attack pointedly refused to shake hands with the two GOP leaders as they received top honors from Congress Tuesday.","url":"https://www.politico.com/news/2022/12/06/mcconnell-mccarthy-police-gold-medal-ceremony-00072546","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":1,"title":"Senate conservatives plot their second act after taking on McConnell","shortDescription":"","url":"https://www.politico.com/news/2022/12/07/after-fight-with-mcconnell-conservatives-quietly-plot-comeback-00072627","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/07"},{"index":2,"title":"McCarthy or bust? House GOP stuck in ‘burning building’ over speaker's gavel","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/mccarthy-house-gop-speakership-00072553","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":4,"title":"Lawmakers labor to break impasses stalling massive spending bill","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/lawmakers-labor-impasses-spending-bill-00072529","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":5,"title":"GOP senators tune out House conservatives’ impeachment calls","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/republican-senators-mccarthy-impeachment-00072420","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":6,"title":"Senate Republicans turn on Trump over suspend-the-Constitution talk","shortDescription":"","url":"https://www.politico.com/news/2022/12/05/senate-republicans-trump-suspending-constitution-00072265","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/05"},{"index":7,"title":"Jeffries and Schumer begin their Dem buddy act","shortDescription":"","url":"https://www.politico.com/news/2022/12/05/jeffries-schumer-democrats-new-york-00071726","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/05"},{"index":8,"title":"Longtime Arizona GOP Rep. Jim Kolbe dies at 80","shortDescription":"","url":"https://www.politico.com/news/2022/12/04/arizona-jim-kolbe-dies-at-80-00072089","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/04"},{"index":9,"title":"Virulently antisemitic comments by Kanye West spark new GOP criticism","shortDescription":"","url":"https://www.politico.com/news/2022/12/01/ye-antisemitism-republicans-hitler-00071695","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/01"},{"index":11,"title":"Trump Org. guilty on all counts in New York criminal tax fraud trial","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/trump-org-guilty-on-all-counts-in-new-york-criminal-tax-fraud-trial-00072609","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/06"},{"index":12,"title":"Senate Republicans turn on Trump over suspend-the-Constitution talk","shortDescription":"","url":"https://www.politico.com/news/2022/12/05/senate-republicans-trump-suspending-constitution-00072265","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/05"},{"index":13,"title":"Midterms deliver one last Trump loss: 3 takeaways from Georgia's Senate runoff","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/trump-loses-again-georgia-runoff-results-00072685","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/06"},{"index":14,"title":"Warnock beats Walker in Georgia, padding Dems’ Senate edge","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/georgia-runoff-election-results-warnock-walker-00072601","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/06"}]