[{"index":0,"title":"How senators ‘defied political gravity’ on same-sex marriage","shortDescription":"WASHINGTON (AP) — Wisconsin Sen. Tammy Baldwin was on the Senate floor, but her mind was on the other side of the Capitol. The House was voting that July afternoon on Democratic legislation to protect same-sex and interracial marriages in the wake of the Supreme Court’s decision to overturn the federal right to an abortion.","url":"https://www.apnews.com/article/politics-wisconsin-rob-portman-marriage-tammy-baldwin-91b12650871afaa87a479d3018a4fded","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":1,"title":"House passes defense bill scrapping COVID vaccine mandate","shortDescription":"WASHINGTON (AP) — A bill to rescind the COVID-19 vaccine mandate for members of the U.S. military and provide nearly $858 billion for national defense passed the House on Thursday as lawmakers scratch off one of the final items on their yearly to-do list.","url":"https://www.apnews.com/article/biden-covid-lloyd-austin-china-government-united-states-eeda05bfffadd83d050b5f573352082f","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":3,"title":"Bill protecting same-sex, interracial unions clears Congress","shortDescription":"WASHINGTON (AP) — The House gave final approval Thursday to legislation protecting same-sex marriages, a monumental step in a decadeslong battle for nationwide recognition that reflects a stark turnaround in societal attitudes.","url":"https://www.apnews.com/article/biden-marriage-united-states-government-and-politics-1cb2d3f4ae76528c0f7d43daceeba974","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":4,"title":"Griner swap wasn’t what US hoped for, but what it could get","shortDescription":"WASHINGTON (AP) — Secretary of State Antony Blinken’s surprise announcement last July lacked any detail, but its meaning was crystal clear.In a rare comment on secret talks, he said the Biden administration had made a “substantial proposal” to Russia to end the imprisonment of two Americans: WNBA star Brittney Griner and Paul Whelan.","url":"https://www.apnews.com/article/brittney-griner-prisons-antony-blinken-united-states-government-and-politics-975a9e0cccd5d6a8ee74925f9eb3f352","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":6,"title":"Biden approval, views of economy steady, sour: AP-NORC poll","shortDescription":"WASHINGTON (AP) — Fresh off his party’s better-than-anticipated performance in the midterm elections, President Joe Biden is facing consistent but critical assessments of his leadership and the national economy.","url":"https://www.apnews.com/article/biden-inflation-united-states-government-and-politics-afe0d0d66a1097b3defb7999b2b378f5","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":7,"title":"Yellen, Malerba become 1st female pair to sign US currency","shortDescription":"FORT WORTH, Texas (AP) — Treasury Secretary Janet Yellen on Thursday helped mark a milestone in U.S. history when she held up a newly minted $5 bill signed for the first time ever by two women. Yellen's signature will appear alongside that of U.S.","url":"https://www.apnews.com/article/russia-ukraine-inflation-politics-government-janet-yellen-9175f4272bf3cf890b44eec0fec87a6b","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":8,"title":"Georgia vote gives Harris reprieve as Senate tiebreaker","shortDescription":"WASHINGTON (AP) — Vice President Kamala Harris needed to get to the U.S. Senate to break a tie. But first she had to avoid causing a traffic jam. One more senator had to vote before Harris could end the impasse, and he was in Georgetown, on the opposite side of Washington.","url":"https://www.apnews.com/article/kamala-harris-united-states-government-and-politics-08422039c2b06b4d0ba746827dc2eb43","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":10,"title":"New Peru president vows to finish term, others want election","shortDescription":"LIMA, Peru (AP) — Peru's first female president is pushing to cement her hold on power, saying she expects to complete the term of her ousted predecessor and buck the trend of presidential failures blighting the Andean nation.","url":"https://www.apnews.com/article/politics-peru-caribbean-government-2dcd7cb27395fce8d6cca3966d9706fc","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":12,"title":"Peru president’s power grab recalls country’s dark past","shortDescription":"LIMA, Peru (AP) — Peru's ousted President Pedro Castillo rose to power 17 months ago as a populist outsider. But he squandered what little popularity he had when he stunned the nation by dissolving Congress in an act of political suicide that recalled some of the darkest days of the nation's anti-democratic past.","url":"https://www.apnews.com/article/politics-peru-caribbean-government-and-ee258b8b8495c9ae06a43f6d3c906a7a","source":"AP News","slug":"apnews","imageUrl":"","date":"December 9, 2022"},{"index":15,"title":"Biden releasing nearly $36B to aid pensions of union workers","shortDescription":"WASHINGTON (AP) — President Joe Biden's administration on Thursday announced the infusion of nearly $36 billion to shore up a financially troubled union pension plan, preventing severe cuts to the retirement incomes of about 350,000 Teamster workers and retirees across the United States.","url":"https://www.apnews.com/article/biden-business-united-states-government-and-politics-retirees-09d93d2af8cc68de47eccda4a9ef0250","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":16,"title":"Michael Flynn testifies in Georgia election probe","shortDescription":"ATLANTA (AP) — Former national security adviser Michael Flynn was at a downtown Atlanta courthouse Thursday to testify before a special grand jury that's investigating whether then-President Donald Trump and others illegally tried to influence the 2020 election in Georgia.","url":"https://www.apnews.com/article/donald-trump-georgia-atlanta-michael-flynn-united-states-government-b70496141955732d4509949d4eee8c62","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":17,"title":"Schumer reelected Senate leader after Dems expand majority","shortDescription":"WASHINGTON (AP) — Sen. Chuck Schumer was unanimously elected Thursday for another term as Senate Democratic leader, helming a bolstered 51-seat majority for a new era of divided government in Congress but intent on “getting things done” for the country.","url":"https://www.apnews.com/article/politics-georgia-united-states-senate-government-and-bd94028010934f20252b7e51ea373e96","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":20,"title":"US hits prominent Turkish executive with Iran oil sanctions","shortDescription":"WASHINGTON (AP) — The Biden administration is imposing sanctions on a prominent Turkish businessman reportedly close to Turkey’s President Recep Tayyip Erdogan for violations of U.S.","url":"https://www.apnews.com/article/iran-turkey-business-united-states-government-us-department-of-the-treasury-1b158be638f1209afa64b4b6a9d7e81a","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":21,"title":"DOJ subpoenas Michigan elections department regarding Trump","shortDescription":"LANSING, Mich. (AP) — Michigan Secretary of State Jocelyn Benson confirmed Thursday that her office has been served a subpoena in connection with special counsel Jack Smith’s investigation of former President Donald Trump.","url":"https://www.apnews.com/article/politics-donald-trump-michigan-jocelyn-benson-subpoenas-5aef3e21ba783083451a0f7319357a19","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":23,"title":"Kentucky Gov. Beshear criticizes Trump, gently knocks Biden","shortDescription":"FRANKFORT, Ky. (AP) — Democratic Gov. Andy Beshear, of Kentucky, criticized former President Donald Trump for dining with a white nationalist and gently distanced himself from current President Joe Biden as he tries to make own way in his 2023 bid for reelection in his Republican-dominated state.","url":"https://www.apnews.com/article/2022-midterm-elections-biden-politics-kentucky-united-states-government-e4c5b875dee8205d920685620ad66bc1","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":24,"title":"Sioux City still trying to get paid $11,000 for Trump rally","shortDescription":"SIOUX CITY, Iowa (AP) — After a fair amount of haggling, Sioux City officials were able to get the people planning a rally featuring former President Donald Trump to pay a $5,000 bill the day before last month's event, but the city is still waiting on the U.S.","url":"https://www.apnews.com/article/politics-donald-trump-business-chuck-grassley-sioux-city-677bdac0b1f5a2c4263c0d801d26e5bb","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":25,"title":"Trump allies aim to capture his philosophy in policy book","shortDescription":"NEW YORK (AP) — Former President Donald Trump arrived in Washington with a hodgepodge of ideas developed over decades in business and television that were far outside the Republican mainstream.","url":"https://www.apnews.com/article/donald-trump-united-states-government-and-politics-5c6ba68dbd9b2ee86bc77faad6936cf6","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":28,"title":"Oregon high court won’t let voter gun control measure begin","shortDescription":"PORTLAND, Ore. (AP) — Oregon’s tough, voter-approved gun control law remains temporarily blocked after the Oregon Supreme Court declined to overturn an earlier decision preventing the measure from taking effect Thursday.","url":"https://www.apnews.com/article/oregon-united-states-government-and-politics-state-cf6c114146fe07b63768186adc4c2ece","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":29,"title":"Trump blowback could carry less bite in 2024 for some in GOP","shortDescription":"HARRISBURG, Pa. (AP) — Donald Trump's attacks on fellow Republican David McCormick contributed to the former hedge fund manager's loss in Pennsylvania's Senate primary. Now, as McCormick considers running again for the Senate, Trump's derision may not be such a liability.","url":"https://www.apnews.com/article/2022-midterm-elections-politics-pennsylvania-donald-trump-china-government-61fbbac33ccd718005c472481ed4425c","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":30,"title":"Zelenskyy quip, Trump conspiracy top 2022 notable quote list","shortDescription":"NEW HAVEN, Conn. (AP) — A tart retort by Ukrainian President Volodymyr Zelenskyy to a U.S. offer of help and a call by former U.S. President Donald Trump for the “termination” of parts of the Constitution top a Yale Law School librarian's list of the most notable quotations of 2022.","url":"https://www.apnews.com/article/zelenskyy-chris-rock-donald-trump-united-states-government-and-politics-c54468c28c11662041ef5daa6ad34957","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":32,"title":"Biden speaks at vigil honoring victims of gun violence","shortDescription":"WASHINGTON (AP) — President Joe Biden called again Wednesday for a ban on so-called assault weapons as he spoke at a vigil honoring victims of gun violence, an event taking place nearly 10 years since the massacre at Sandy Hook Elementary School in Newtown, Connecticut, that spurred a new generation of advocacy for tougher firearms restrictions.","url":"https://www.apnews.com/article/biden-violence-united-states-government-and-politics-6293ffb41c0669f114a1ae18cbd93a2f","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":35,"title":"Peru’s president ousted by Congress in political crisis","shortDescription":"LIMA, Peru (AP) — The president of Peru was ousted by Congress and arrested on a charge of rebellion Wednesday after he sought to dissolve the legislative body and take unilateral control of the government, triggering a grave constitutional crisis.","url":"https://www.apnews.com/article/peru-caribbean-government-pedro-castillo-62923886f7c53b1dcceb0db84cb09888","source":"AP News","slug":"apnews","imageUrl":"","date":"December 8, 2022"},{"index":37,"title":"Dem governor: Caring is key to connecting with rural voters","shortDescription":"FRANKFORT, Ky. (AP) — Kentucky Gov. Andy Beshear said Wednesday that Democrats have a better chance of connecting with rural voters in his home state and elsewhere when they talk about the things people need and the ways they can help them.","url":"https://www.apnews.com/article/2022-midterm-elections-kentucky-united-states-government-and-politics-42486a3be6621f2b54e39428c5d3f09d","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":38,"title":"Warnock win makes it official: Georgia is a ’24 battleground","shortDescription":"ATLANTA (AP) — Fresh off Democratic Sen.","url":"https://www.apnews.com/article/2022-midterm-elections-college-football-politics-united-states-government-c2fed7e298b9c19fa06a9f1140bb06c5","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":40,"title":"Report: Classified items found at Trump storage unit in Fla.","shortDescription":"WASHINGTON (AP) — At least two items marked as classified were found in a storage unit in West Palm Beach, Florida, after lawyers for former President Donald Trump arranged for a firm to search for additional classified material, according to a published report Wednesday.","url":"https://www.apnews.com/article/politics-donald-trump-virginia-west-palm-beach-0dea15da0365220d340f1f51a00b0a27","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":41,"title":"Warnock delivers 51-seat Senate for Democrats, and much more","shortDescription":"","url":"https://www.apnews.com/article/biden-georgia-united-states-government-and-politics-7933d36179597c5aa772bcf8d3fb97eb","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":43,"title":"US: Russia looking to Iran to supply more drones, missiles","shortDescription":"WASHINGTON (AP) — Struggling to maintain a steady supply of arms for its war in Ukraine, Moscow is looking to Iran once again to resupply the Russian military with drones and surface-to-surface missiles, according to two officials familiar with the matter.","url":"https://www.apnews.com/article/russia-ukraine-iran-government-united-states-034b4e4ae2e9a4cb0ec0922cac82dc54","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":44,"title":"Justices skeptical of elections case that could alter voting","shortDescription":"WASHINGTON (AP) — The Supreme Court on Wednesday seemed skeptical of making a broad ruling that would leave state legislatures virtually unchecked in making rules for congressional and presidential elections.","url":"https://www.apnews.com/article/us-supreme-court-north-carolina-5615105a88cedadcd2ce738f2cfe3a16","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":46,"title":"Ukraine ex-lawmaker, alleged Russian agent, faces US charges","shortDescription":"NEW YORK (AP) — A former Ukrainian lawmaker who U.S. authorities say acted as a Russian agent for over a decade and tried to influence the 2020 presidential election through meetings with Rudy Giuliani has been criminally charged in New York in connection with purchases of luxury Beverly Hills real estate.","url":"https://www.apnews.com/article/biden-indictments-ukraine-government-united-states-and-politics-105c9d332a43192c7a8eb17b4a9e850a","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":47,"title":"Biden signs #MeToo law curbing confidentiality agreements","shortDescription":"President Joe Biden on Wednesday signed legislation curbing the use of confidentiality agreements that block victims of sexual harassment from speaking publicly about misconduct in the workplace.White House press secretary Karine Jean-Pierre said Biden had acted on the bipartisan Speak Out Act, which bars the use of nondisclosure agreements that employees or contractors are required to sign, often as a condition of employment.","url":"https://www.apnews.com/article/biden-business-kirsten-gillibrand-united-states-government-karine-jean-pierre-9be38e03abc6ba2382d386ef4e286776","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":48,"title":"Democrats move to take power with narrow Pa. House majority","shortDescription":"HARRISBURG, Pa. (AP) — Democrats who barely won back a majority of seats in the Pennsylvania House in November moved to take control of the chamber Wednesday and replace one of their incumbents who died and two others who won higher office.","url":"https://www.apnews.com/article/politics-pennsylvania-philadelphia-state-government-d8fa4790096fec4cbced12f16ae40c7f","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":49,"title":"EU eyes Russian officials, banks, industry for sanctions","shortDescription":"BRUSSELS (AP) — The European Union on Wednesday proposed travel bans and asset freezes on almost 200 more Russian officials and military officers as part of a new round of sanctions aimed at ramping up pressure on Moscow over its war in Ukraine.","url":"https://www.apnews.com/article/russia-ukraine-politics-ursula-von-der-leyen-government-and-357d4ab708e9a484558c5c4d4610f319","source":"AP News","slug":"apnews","imageUrl":"","date":"December 7, 2022"},{"index":2,"title":"Biden criticized for Griner prison swap that left Paul Whelan in Russia","shortDescription":"Critics question why former Marine Paul Whelan wasn't included in prisoner swap that freed Brittney Griner from Russian prison.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/joe-biden-brittney-griner-prisoner-swap-criticism-paul-whelan/10858405002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":3,"title":"OnPolitics: House passes same-sex marriage bill, measure off to Biden","shortDescription":"The Respect for Marriage Act is headed to President Joe Biden's desk after garnering bipartisan support in both congressional chambers.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/onpolitics-same-sex-marriage-bill-passes-house-heads-biden/10859201002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":6,"title":"House passes same-sex marriage bill, measure goes to Biden - live updates","shortDescription":"The Respect for Marriage Act guarantees federal recognition of any marriage between two people if it was valid in the state where they were married.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/house-same-sex-marriage-vote/10839838002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":7,"title":"House passes defense bill scrapping COVID vaccine mandate","shortDescription":"The bill provides about $45 billion more for defense programs than Biden requested, the second year in a row Congress notably exceeded his request.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/house-defense-bill-covid-vaccine-mandate/10852558002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":8,"title":"Nonfatal opioid overdoses by state: White House launches new data map","shortDescription":"The data dashboard on nonfatal opioid overdoses will target specific regions to help fight the epidemic, which left 81,000 dead in the US this year.","url":"https://www.usatoday.com/story/news/health/2022/12/08/opioid-epidemic-white-house-launches-dashboard-tracking-overdoses/10850708002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":9,"title":"Schumer reelected as Senate majority leader","shortDescription":"In a unanimous vote by Democrats, New York Sen. Chuck Schumer was chosen to lead what he called a \"diverse\" leadership team in the Senate.","url":"https://www.usatoday.com/videos/news/politics/2022/12/08/sen-chuck-schumer-reelected-senate-majority-leader-dems/10858564002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":10,"title":"Dems reelect Sen. Chuck Schumer as Senate majority leader","shortDescription":"Senate Democrats met Thursday to unanimously reelect Sen. Chuck Shumer Senate majority leader, days after the party expanded their majority 51-49.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/schumer-reelected-senate-majority-leader/10858241002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":12,"title":"New search of Trump storage unit yields classified material: sources","shortDescription":"Sources declined to elaborate on the materials, which were retrieved from a West Palm Beach, Florida location, and turned over to federal authorities","url":"https://www.usatoday.com/story/news/politics/2022/12/07/trump-storage-unit-classified-material/10854872002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":13,"title":"Biden announces federal bailout for troubled union pension fund","shortDescription":"A $36 billion bailout for a troubled pension fund will help more than 350,000 truck drivers, warehouse workers, construction workers and others.","url":"https://www.usatoday.com/story/news/politics/2022/12/08/biden-teamster-federal-bailout-pension-fund/10855066002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/08"},{"index":14,"title":"Supreme Court hears arguments on election laws","shortDescription":"The Supreme Court heard oral arguments for the Moore v. Harper case that could dramatically change local election laws.","url":"https://www.usatoday.com/videos/news/politics/2022/12/07/supreme-court-hears-arguments-could-change-election-laws/10854284002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":15,"title":"Peru president arrested after trying to dissolve Congress, start new government","shortDescription":"Peru President Pedro Castillo was voted out by Congress, shortly after he tried to dissolve the legislature and start a new emergency government.","url":"https://www.usatoday.com/story/news/world/2022/12/07/peru-president-pedro-castillo-tried-dissolve-congress/10852556002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":17,"title":"Supreme Court spars over case with 'big consequences' for elections","shortDescription":"Voting rights groups say the case could upend federal elections but others say state courts have overstepped their authority over voting laws.","url":"https://www.usatoday.com/story/news/politics/2022/12/07/supreme-court-election-argument-independent-legislature/10835816002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":19,"title":"OnPolitics: How did Republicans lose Georgia? Walker, Trump and more","shortDescription":"Democrat Raphael Warnock's victory over Republican Herschel Walker expanded Democrats' hold over the Senate. Who's to blame for the GOP's loss?","url":"https://www.usatoday.com/story/news/politics/2022/12/07/walker-trump-lost-georgia-gop/10853261002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":20,"title":"How did Republicans lose Georgia? Walker, Trump's influence and more","shortDescription":"Voters who backed Sen. Raphael Warnock said they found Herschel Walker unqualified for the Senate - not unlike Trump candidates in other states.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/07/trump-warnock-walker-georgia-senate-runoff/10843758002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":24,"title":"Warnock win furthers Senate majority to 51","shortDescription":"Democrat Raphael Warnock won reelection against Republican Herschel Walker in Georgia. This gives Democrats 51 seats in the Senate.","url":"https://www.usatoday.com/videos/news/politics/2022/12/07/democrat-raphael-warnock-has-won-reelection-against-republican-herschel-walker-georgia/10850762002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":26,"title":"Trump companies convicted on all charges in NYC criminal tax fraud case","shortDescription":"Former President Donald Trump was not charged in the case, and did not appear in the courtroom during the trial.","url":"https://www.usatoday.com/story/news/politics/2022/12/06/trump-companies-convicted-all-charges-criminal-tax-fraud-case/10772390002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":27,"title":"5 takeaways from the Georgia Senate runoff","shortDescription":"The Georgia Senate runoff race, which cost $380 million in total, underscored how deeply the country is divided going into 2023.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/06/takeaways-georgia-senate-runoff-warnock-walker/10847782002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":28,"title":"White House tackles antisemitism at forum led by Doug Emhoff","shortDescription":"Jewish groups hope a White House discussion on the rise in antisemitism will lead to a national strategy to combat the problem.","url":"https://www.usatoday.com/story/news/politics/2022/12/07/white-house-rise-antisemitism-doug-emhoff/10839023002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":29,"title":"Biden, Dems extend Senate majority with Georgia win","shortDescription":"Georgia voters give Joe Biden and Democrats a critical 51-seat edge in the Senate, which will no longer require a tie break vote to confirm judges.","url":"https://www.usatoday.com/story/news/politics/elections/2022/12/06/warnock-win-democrats-51-seats-senate-majority/10847260002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":30,"title":"Raphael Warnock wins in Georgia Senate race","shortDescription":"Georgia voters sent Democrat Raphael Warnock back to the United States Senate with a runoff win over Republican challenger Herschel Walker.","url":"https://www.usatoday.com/videos/news/politics/2022/12/07/people-have-spoken-democratic-sen-raphael-warnock-celebrates-georgia-runoff-win/10849890002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/07"},{"index":31,"title":"Congress poised to rescind COVID-19 vaccine mandate for U.S. troops","shortDescription":"The COVID-19 vaccine mandate for members of the U.S. military would be rescinded under the annual defense bill heading for a vote in Congress","url":"https://www.usatoday.com/story/news/politics/2022/12/06/covid-19-vaccine-mandate-may-no-longer-required-u-s-troops/10849891002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/12/06"},{"index":9,"title":"“Kids Seem to Be a Paycheck”: How a Billion-Dollar Corporation Exploits Washington’s Special Education System","shortDescription":"Universal Health Services collected more than $38 million in tax dollars for special education services that families and former teachers say it largely didn’t provide","url":"https://www.propublica.org/article/washington-special-education-schools-funding-abuse","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221204-npa-money.jpg","date":"Dec. 4"},{"index":2,"title":"House Passes $858 Billion Defense Bill Repealing Vaccine Mandate for Troops","shortDescription":"The legislation would rescind the coronavirus vaccine mandate in defiance of the Biden administration’s wishes, and increase the defense budget $45 billion over the president’s request.By Catie Edmondson","url":"https://www.nytimes.com/2022/12/08/us/politics/house-defense-bill-covid-vaccine-mandate.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/07dc-defensebill-1-cd18/07dc-defensebill-1-cd18-thumbWide.jpg","date":"2022/12/07"},{"index":3,"title":"Congress Says Dan Snyder and the N.F.L. Impeded Sexual Harassment Investigation","shortDescription":"A congressional committee said the N.F.L. “has not protected workers from sexual harassment and abuse” and found that Snyder, the Commanders owner, went to great lengths to interfere in workplace inquiries.By Ken Belson and Katherine Rosman","url":"https://www.nytimes.com/2022/12/08/sports/football/dan-snyder-nfl-commanders-congress-investigation.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/00NFL-Snyder-Congress-1-b691/00NFL-Snyder-Congress-1-b691-thumbWide.jpg","date":"2022/12/07"},{"index":4,"title":"Bill to Protect Same-Sex Marriage Rights Clears Congress","shortDescription":"The House gave final approval to the measure, with lawmakers from both parties voting in favor. It now heads to President Biden to be signed into law.By Annie Karni","url":"https://www.nytimes.com/2022/12/08/us/politics/same-sex-marriage-congress.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/08/multimedia/08dc-cong-marriage-1-c6fd/08dc-cong-marriage-1-c6fd-thumbWide.jpg","date":"2022/12/08"},{"index":5,"title":"‘Systemic Problems’ Hindered Government’s Pandemic Response, Senate Report Says","shortDescription":"An examination by the Democratic staff of the Senate homeland security committee portrayed a government wholly unprepared for the arrival of the coronavirus.By Sheryl Gay Stolberg","url":"https://www.nytimes.com/2022/12/08/us/politics/senate-covid-report.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/08/multimedia/08dc-virus-report-1-14d1/08dc-virus-report-1-14d1-thumbWide.jpg","date":"2022/12/08"},{"index":6,"title":"Ruing Senate Loss, Georgia G.O.P. Asks if Runoff Rule Changes Backfired","shortDescription":"Some in the party said that additional changes to election rules were likely, after Senator Raphael Warnock’s victory put a new spotlight on a major 2021 voting law passed by the G.O.P.By Reid J. Epstein","url":"https://www.nytimes.com/2022/12/08/us/politics/georgia-runoff-rules.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/08/multimedia/08pol-runoff-01-1-15f4/08pol-runoff-01-1-15f4-thumbWide.jpg","date":"2022/12/08"},{"index":7,"title":"Prominent Gay Republicans Helped Smooth the Way for Marriage Bill","shortDescription":"Behind the success of the Respect for Marriage Act was a group of prominent Republicans, some of them gay, who worked to persuade G.O.P. senators that embracing it was a political winner.By Annie Karni","url":"https://www.nytimes.com/2022/12/08/us/politics/marriage-bill-gay-republicans.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/08/multimedia/08dc-marriage-2-1-b2c2/08dc-marriage-2-1-b2c2-thumbWide.jpg","date":"2022/12/08"},{"index":9,"title":"Turnout by Republicans Was Great. It’s Just That Many of Them Didn’t Vote for Republicans.","shortDescription":"No, the main G.O.P. problem wasn’t prioritizing Election Day voting over early voting.By Nate Cohn","url":"https://www.nytimes.com/2022/12/08/upshot/georgia-voter-turnout-republicans.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/07up-herschel1-1-c03c/07up-herschel1-1-c03c-thumbWide.jpg","date":"2022/12/07"},{"index":10,"title":"Donald Trump and His Terrible, Horrible, No Good, Very Bad 3 Weeks","shortDescription":"For the former president, who raced to announce his third run for the White House in hopes of clearing the Republican field, the losses, legal setbacks and embarrassments are rapidly piling up.By Maggie Haberman and Michael C. Bender","url":"https://www.nytimes.com/2022/12/07/us/politics/donald-trump-republicans-turmoil.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/12/07/multimedia/POL-TRUMP-1-4677/POL-TRUMP-1-4677-thumbWide.jpg","date":"2022/12/07"},{"index":0,"title":"Jan. 6 panel plans weekend meeting to consider criminal referrals","shortDescription":"Members also intend to hold a public meeting on Dec. 21 to vote on the release of their report and any associated referrals.","url":"https://www.politico.com/news/2022/12/08/jan-6-panel-plans-weekend-meeting-to-consider-criminal-referrals-00073122","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/08"},{"index":2,"title":"House GOP’s help-wanted sign: One border funding chief","shortDescription":"","url":"https://www.politico.com/news/2022/12/08/house-republicans-homeland-security-spending-panel-00072778","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/08"},{"index":3,"title":"As same-sex marriage protections pass Congress, House GOP support decreases","shortDescription":"","url":"https://www.politico.com/news/2022/12/08/house-gop-support-decreases-for-same-sex-marriage-protections-00073027","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/08"},{"index":4,"title":"Dems plot their own government funding plan as talks stall","shortDescription":"","url":"https://www.politico.com/news/2022/12/07/dems-government-funding-package-00072820","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/07"},{"index":6,"title":"‘Turn left, Republicans’: Schumer jokes after cellphone interruption","shortDescription":"","url":"https://www.politico.com/video/2022/12/07/turn-left-republicans-schumer-jokes-after-cellphone-interruption-788540","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/07"},{"index":7,"title":"Senate conservatives plot their second act after taking on McConnell","shortDescription":"","url":"https://www.politico.com/news/2022/12/07/after-fight-with-mcconnell-conservatives-quietly-plot-comeback-00072627","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/07"},{"index":8,"title":"McCarthy or bust? House GOP stuck in ‘burning building’ over speaker's gavel","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/mccarthy-house-gop-speakership-00072553","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":9,"title":"Fallen officer's family snubs McConnell and McCarthy at Jan. 6 gold medal ceremony","shortDescription":"","url":"https://www.politico.com/news/2022/12/06/mcconnell-mccarthy-police-gold-medal-ceremony-00072546","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/12/06"},{"index":11,"title":"Elon Musk’s release of Twitter documents on Hunter Biden has slowed. Here’s why.","shortDescription":"","url":"https://www.politico.com/news/2022/12/08/twitter-files-hunter-biden-laptop-00072919","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/08"},{"index":12,"title":"Republicans have a post-election epiphany on mail voting","shortDescription":"","url":"https://www.politico.com/news/2022/12/08/republicans-have-a-post-election-epiphany-on-mail-voting-00072956","source":"Politico","slug":"politico","imageUrl":"","date":"2022/12/08"}]