[{"index":4,"title":"Texas House passes Trump-backed map","shortDescription":"The Texas House GOP approved a Trump-backed congressional map. It still needs Senate approval and the Governor’s signature.","url":"https://www.usatoday.com/videos/news/politics/2025/08/20/texas-house-approves-trump-backed-congressional-map/85751119007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":12,"title":"Trump official lashes out at 'stupid white hippies' amid DC takeover","shortDescription":"Trump administration officials led by JD Vance fired back at protests targeting the federal takeover of D.C. during a wild scene at Union Station.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/stephen-miller-jd-vance-stupid-white-hippies-dc/85744097007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":13,"title":"Gov. Newsom Pushes To Redraw Maps To Counter Texas Republicans","shortDescription":"California Governor Gavin Newsom has unveiled a high-stakes plan to redraw voting districts in his state to counter similar efforts by Republicans in Texas.\nNewsom announced that California would hold a special election in November, in which voters would be asked to approve a mid-decade redistricting plan ahead of the 2026 national midterms.\n Newsom characterized the move as an emergency measure in response to a President Donald Trump-backed plan in Texas, which could allow Republicans to gain five more seats in the House. \nAnnouncing the plan at the Japanese American National Museum’s National Center for the Preservation of Democracy, Newsom vowed the move would “neuter and neutralize” Texas’s plan. \n“We're working through a very transparent, temporary, and public process. We're putting the maps on the ballot and empowering the people. We must recognize the cards we have been dealt and meet fire with fire,” Newsom said. \nIf successful, Newsom’s plan would allow California to retain its current congressional maps if Texas and other states withdraw from any changes.\nThe move comes amid ongoing Republican-led redistricting efforts in Florida and Ohio, as well as discussions to do the same in Indiana and Missouri.\nRepublicans in Texas have so far been blocked from approving new maps as House Democrats fled the state, preventing the chamber from reaching a quorum to proceed with a vote. \nTexas Governor Greg Abbott has threatened to arrest the Texas Democrats for fleeing, vowing to hold continuous special legislative sessions until the proposal passes.","url":"https://www.usatoday.com/videos/news/2025/08/20/gov-newsom-pushes-to-redraw-maps-to-counter-texas-republicans/85672379007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":16,"title":"Jack White blasts Donald Trump's Oval Office makeover","shortDescription":"Jack White has blasted Donald Trump’s Oval Office makeover, calling it “vulgar” and “gaudy.”","url":"https://www.usatoday.com/videos/news/2025/08/20/jack-white-blasts-donald-trumps-oval-office-makeover/85737925007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":17,"title":"What is Trump's approval rating this week? What the polling says.","shortDescription":"A succession of national polls released in August show a dip in public opinion of the president's job performance, with some marking record-lows.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/trump-approval-rating-august-putin-zelenskyy-meeting/85739159007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":18,"title":"Trump buys more than $100 million in bonds in office, disclosure shows","shortDescription":"Trump's financial disclosure shows corporate bond buys from Citigroup, Morgan Stanley, Wells Fargo, Meta, Qualcomm, T-Mobile USA and The Home Depot.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/trump-financial-disclosure-bonds/85743504007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":20,"title":"Texas Rep. Nicole Collier spends night on House floor","shortDescription":"Democrats in the Texas House of Representatives returned to Austin on Aug. 18, 2025, but their protest of redistricting efforts continues.","url":"https://www.usatoday.com/picture-gallery/news/politics/2025/08/20/texas-democrats-nicole-collier-protest-redistricting-photos/85742810007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":21,"title":"Trump calls for Fed governor to resign over alleged mortgage fraud","shortDescription":"President Donald Trump called for Lisa Cook to resign from the Federal Reserve's board after his administration accused her of engaging in mortgage fraud.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/trump-lisa-cook-fed-reserve-governor-resign-mortgage-fraud/85740719007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":24,"title":"Voters split on Trump DC police takeover, National Guard deployment","shortDescription":"The poll by progressive outfit Data for Progress also said only 11% of voters think President Donald Trump will limit National Guard deployment to DC.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/trump-takeover-national-guard-washington-dc-voters-split/85739056007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":25,"title":"Sen. Adam Schiff creates legal defense fund to fight Trump accusations","shortDescription":"Democratic Sen. Adam Schiff creates a legal defense fund amid GOP Trump administration investigations.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/sen-adam-schiff-legal-defense-trump-accusations/85738895007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":27,"title":"Texas Democrats spend night on House floor","shortDescription":"Texas Democrats are not done protesting the GOP's plan to draw a new congressional map that favors Republicans in the midterm elections.","url":"https://www.usatoday.com/videos/news/politics/2025/08/20/texas-democrats-protest-ahead-of-redistricting-vote/85739154007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":28,"title":"Newsom tops Harris in 2028 presidential poll of California Democrats","shortDescription":"A new 2028 presidential poll found Gavin Newsom is the top choice of 25% of California's Democratic voters, followed by Kamala Harris at 19%.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/gavin-newsom-harris-2028-democrat-primary-california-poll/85738411007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":30,"title":"California redistricting vote has major support: Newsom pollster","shortDescription":"A poll taken by Gov. Gavin Newsom's pollster found 57% of California voters back a plan to redraw the state's congressional maps to boost Democrats.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/california-redistricting-newsom-poll/85737469007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":31,"title":"What ‘6 wars in 6 months’ is Trump referring to? List of peace agreements","shortDescription":"Did Trump settle six wars in six months? He claimed to in a Truth Social post. He has been involved in several peace agreements, but not quite six.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/donald-trump-six-wars/85721555007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"},{"index":32,"title":"Texas GOP approves Trump-backed congressional map","shortDescription":"The gambit has triggered a national redistricting war, as governors from both major parties threaten to initiate similar efforts in other states.","url":"https://www.usatoday.com/story/news/politics/2025/08/20/texas-trump-congress-map-redistricting/85737401007/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2025/08/20"}]