[{"index":0,"title":"Doubts about candidates tipped the scales in tightest races","shortDescription":"ATLANTA (AP) — Casting his vote this month in one of the most politically competitive states in the U.S., Seung Lee happily backed Georgia Republican Gov. Brian Kemp's reelection.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-atlanta-congress-6313787298bbd5102435ae1228045ab2","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":1,"title":"US sending Ukraine $400 million in ammunition, generators","shortDescription":"WASHINGTON (AP) — The U.S. is sending another $400 million in ammunition and generators to Ukraine, the White House announced Wednesday, and is pulling the gear from its own stockpiles to get the support to Kyiv as fast as possible as Russia continues to target Ukraine's energy sources and winter sets in.","url":"https://www.apnews.com/article/russia-ukraine-kyiv-europe-government-and-politics-06f7d7958e3a0f44746918c2d6c5dab1","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":2,"title":"Georgia high court allows Saturday voting for Senate runoff","shortDescription":"ATLANTA (AP) — Georgia counties will be allowed to hold early voting this Saturday in the U.S. Senate runoff election between Democratic incumbent Raphael Warnock and Republican challenger Herschel Walker, under a Wednesday ruling from the state Supreme Court.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-georgia-atlanta-a870eec371b1713c8b71dd12518114fc","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":5,"title":"Supreme Court OKs handover of Trump tax returns to Congress","shortDescription":"WASHINGTON (AP) — The Supreme Court on Tuesday cleared the way for the imminent handover of former President Donald Trump's tax returns to a congressional committee after a three-year legal fight.","url":"https://www.apnews.com/article/us-supreme-court-donald-trump-business-john-roberts-congress-8ea516dace48875ad7c5dd472dd16dcf","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":7,"title":"Republicans try to stop Saturday voting in Georgia runoff","shortDescription":"ATLANTA (AP) — Republican groups appealed to Georgia's highest court Tuesday in an attempt to prohibit early voting this Saturday in the U.S.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-georgia-atlanta-83f554285f2740a6fb8b97a862632150","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":9,"title":"Oath Keepers jury home for weekend after deliberations start","shortDescription":"WASHINGTON (AP) — Jurors have gone home for the long Thanksgiving weekend after deliberating most of Tuesday in the Jan. 6 Capitol riot case accusing Oath Keepers founder Stewart Rhodes and four of his extremist group associates of a violent plot to stop the transfer of presidential power from Republican Donald Trump to Democrat Joe Biden.","url":"https://www.apnews.com/article/capitol-siege-biden-donald-trump-conspiracy-congress-92a75247892d2985f0091e31cb8402ca","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":10,"title":"GOP’s McCarthy threatens to impeach Mayorkas over border","shortDescription":"WASHINGTON (AP) — House Republican leader Kevin McCarthy on Tuesday called on Homeland Security Secretary Alejandro Mayorkas to resign over management of the U.S.","url":"https://www.apnews.com/article/biden-kevin-mccarthy-impeachments-alejandro-mayorkas-border-security-5b2a8fa00a8cc724922b89c328fe6609","source":"AP News","slug":"apnews","imageUrl":"","date":"November 23, 2022"},{"index":16,"title":"US Sen. Lindsey Graham questioned in Georgia election probe","shortDescription":"ATLANTA (AP) — U.S. Sen. Lindsey Graham testified Tuesday before a special grand jury that's investigating whether President Donald Trump and others illegally meddled in the 2020 election in Georgia.","url":"https://www.apnews.com/article/donald-trump-georgia-atlanta-88095d01932c62ee4a6dc2db1786ada9","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":19,"title":"Flip of Michigan Legislature highlights role of fair maps","shortDescription":"Democratic candidates for the Michigan House and Senate won a majority of votes this year, translating into their party winning control of both legislative chambers.","url":"https://www.apnews.com/article/michigan-legislature-government-and-politics-1dedf1cfb97cfee9c03d6a96c46fa126","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":20,"title":"In California, 10% of Legislature now identifies as LGBTQ","shortDescription":"SACRAMENTO, Calif. (AP) — While LGBTQ candidates and their supporters celebrated several milestone victories around the nation in this year's midterm elections, California quietly reached its own: At least 10% of its state lawmakers identify publicly as LGBTQ, believed to be a first for any U.S.","url":"https://www.apnews.com/article/2022-midterm-elections-california-legislature-gender-identity-gay-rights-888ff8d45b817800e4c2231f6bb22377","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":21,"title":"Georgia runoff: Why one Senate seat is crucial for Democrats","shortDescription":"WASHINGTON (AP) — Democrats have secured their majority in the Senate for the next two years. But holding on to Democratic Sen.","url":"https://www.apnews.com/article/herschel-walker-georgia-kamala-harris-congress-government-and-politics-0f6cc74d575921e13c19d7569e4e5382","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":22,"title":"Biden opens holidays, pardons turkeys Chocolate and Chip","shortDescription":"WASHINGTON (AP) — President Joe Biden continued a 75-year tradition Monday and pardoned a pair of Thanksgiving turkeys named after his favorite flavor of ice cream while cracking jokes about his political party's better-than-expected performance in this month's midterm elections.","url":"https://www.apnews.com/article/biden-holidays-obituaries-christmas-c98e1ce25e97dbe097f2ed37d9c7a4c2","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":23,"title":"2nd Arizona county delays certifying election, for now","shortDescription":"PHOENIX (AP) — A second Republican-controlled Arizona county on Monday delayed certifying the results of this month's election as a protest against voting issues in Maricopa County that some GOP officials have blamed for their losses in top races including the contest for governor.","url":"https://www.apnews.com/article/2022-midterm-elections-arizona-phoenix-83aa473b9c0549c87d1c2125ddcfb655","source":"AP News","slug":"apnews","imageUrl":"","date":"November 22, 2022"},{"index":24,"title":"Georgia court declines to halt Saturday early runoff voting","shortDescription":"ATLANTA (AP) — A Georgia appeals court ruling on Monday means that counties can offer early voting this coming Saturday in the U.S. Senate runoff election between Democratic Sen. Raphael Warnock and Republican Herschel Walker.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-georgia-af163db41a5c4075310f2f00921611b5","source":"AP News","slug":"apnews","imageUrl":"","date":"November 21, 2022"},{"index":25,"title":"Jan. 6 sedition trial of Oath Keepers founder goes to jury","shortDescription":"WASHINGTON (AP) — As angry supporters of President Donald Trump stormed the U.S. Capitol, ready to smash through windows and beat police officers, Oath Keepers founder Stewart Rhodes extolled them as patriots and harkened back to the battle that kicked off the American Revolutionary War.","url":"https://www.apnews.com/article/capitol-siege-biden-government-and-politics-d18cc28d78f0644c967551ba6b429f7c","source":"AP News","slug":"apnews","imageUrl":"","date":"November 21, 2022"},{"index":30,"title":"GOP’s lackluster fundraising spurs post-election infighting","shortDescription":"WASHINGTON (AP) — Trailing badly in his Arizona Senate race as votes poured in, Republican Blake Masters went on Tucker Carlson’s Fox News program and assigned blame to one person: Senate Minority Leader Mitch McConnell.","url":"https://www.apnews.com/article/2022-midterm-elections-mitch-mcconnell-tucker-carlson-government-and-politics-3c7479c6bd7abf922dcc3aae2e3ae16c","source":"AP News","slug":"apnews","imageUrl":"","date":"November 21, 2022"},{"index":31,"title":"Obama to campaign for Warnock on Dec. 1 before Ga. runoff","shortDescription":"ATLANTA (AP) — Former President Barack Obama, reprising his battleground blitz ahead of the midterm elections, will campaign again for Sen. Raphael Warnock as the Georgia Democrat tries to withstand a strong challenge from Republican Herschel Walker before their Dec.","url":"https://www.apnews.com/article/2022-midterm-elections-herschel-walker-entertainment-georgia-5d5f069b504e2dfa29de5fcbf162cf0d","source":"AP News","slug":"apnews","imageUrl":"","date":"November 21, 2022"},{"index":33,"title":"Lawmakers urge action after report of other high court leak","shortDescription":"WASHINGTON (AP) — The chairman of the Senate Judiciary Committee said his panel is reviewing “serious allegations” in a report that a former anti-abortion leader knew in advance the outcome of a 2014 Supreme Court case involving health care coverage of contraception.","url":"https://www.apnews.com/article/abortion-us-supreme-court-health-samuel-alito-business-1ba9b0b0ed4a826fcee19a35987a1d4d","source":"AP News","slug":"apnews","imageUrl":"","date":"November 20, 2022"},{"index":35,"title":"Trump’s growing GOP challengers revive fears of 2016 repeat","shortDescription":"LAS VEGAS (AP) — Memories of the tumultuous 2016 Republican primary hung over the Las Vegas ballroom this weekend during the first major gathering of the party's potential contenders for the 2024 nomination.","url":"https://www.apnews.com/article/2022-midterm-elections-las-vegas-donald-trump-2a4caff793c65878204d210bc740cadf","source":"AP News","slug":"apnews","imageUrl":"","date":"November 20, 2022"},{"index":37,"title":"GOP sees slight Latino vote gains, painful candidate losses","shortDescription":"MIAMI (AP) — Republicans had placed hopes on a roster of Latina candidates around the country as they looked to make gains with Latino voters in a midterm election that some had predicted would yield sweeping GOP victories.","url":"https://www.apnews.com/article/2022-midterm-elections-miami-race-and-ethnicity-racial-injustice-cbf587e647900019b502a9cfbf93ac6d","source":"AP News","slug":"apnews","imageUrl":"","date":"November 20, 2022"},{"index":39,"title":"Democratic U.S. Rep. Gomez triumphs in California district","shortDescription":"LOS ANGELES (AP) — Democratic U.S. Rep. Jimmy Gomez defeated rival Democrat David Kim on Saturday in a Los Angeles district after a battle on the party’s progressive flank.With nearly all the ballots counted, Gomez had 51.3% to 48.7% for Kim, or a margin of about 3,000 votes.","url":"https://www.apnews.com/article/2022-midterm-elections-california-los-angeles-government-and-politics-faa076855197ae17f0fa26a635acb367","source":"AP News","slug":"apnews","imageUrl":"","date":"November 20, 2022"},{"index":41,"title":"Walker, Kemp campaign in Ga. together for the 1st time","shortDescription":"SMYRNA, Ga. (AP) — Fresh off his commanding reelection, Georgia Gov. Brian Kemp on Saturday played the role of dutiful Republican soldier as he campaigned for the first time alongside Senate hopeful Herschel Walker after spending months steering clear of his ticket-mate.","url":"https://www.apnews.com/article/herschel-walker-entertainment-celebrity-georgia-1a8149ae499eb1fd49f9aa11cd8eb3df","source":"AP News","slug":"apnews","imageUrl":"","date":"November 19, 2022"},{"index":43,"title":"NC Democrats’ parity in Congress delegation may be fleeting","shortDescription":"RALEIGH, N.C. (AP) — Democrats celebrated winning what was billed as North Carolina's lone toss-up race for the U.S. House this month, as state Sen. Wiley Nickel’s narrow victory over Republican Bo Hines in the 13th Congressional District helped weaken any national GOP midterm wave.","url":"https://www.apnews.com/article/2022-midterm-elections-us-supreme-court-legislature-raleigh-redistricting-2bbf72f5161344750c54aa965f211aa9","source":"AP News","slug":"apnews","imageUrl":"","date":"November 19, 2022"},{"index":44,"title":"House GOP pushes Hunter Biden probe despite thin majority","shortDescription":"","url":"https://www.apnews.com/article/biden-inflation-donald-trump-business-9af868065b776b21f81fa73e7bafb97d","source":"AP News","slug":"apnews","imageUrl":"","date":"November 19, 2022"},{"index":45,"title":"Officials: Georgia audit confirms secretary of state winner","shortDescription":"ATLANTA (AP) — A hand count of random batches of votes in Georgia's recent election for secretary of state has confirmed Republican Brad Raffensperger's victory, state election officials said.The audit — required by state law — turned up a small difference in votes from the machine count used during the election, but the difference was well within the expected margin of error, the Secretary of State's office announced Friday.","url":"https://www.apnews.com/article/georgia-state-elections-biden-cabinet-legislature-9008e59a281bc0f98f659c0a440a5618","source":"AP News","slug":"apnews","imageUrl":"","date":"November 19, 2022"},{"index":47,"title":"Jeffries makes historic bid to lead House Dems after Pelosi","shortDescription":"NEW YORK (AP) — A day after Speaker Nancy Pelosi announced she would step aside, Rep.","url":"https://www.apnews.com/article/nancy-pelosi-hakeem-jeffries-congress-government-and-politics-f898cc1a7c59c8f42f669b5f0f167385","source":"AP News","slug":"apnews","imageUrl":"","date":"November 19, 2022"},{"index":49,"title":"Election conspiracists claim some races for local offices","shortDescription":"As voting experts cheered the losses of election conspiracy theorists in numerous high-profile races on Election Day, Paddy McGuire prepared to hand over his office to one of them.","url":"https://www.apnews.com/article/2022-midterm-elections-donald-trump-14ee28226986b6b4fb554aa3919d1525","source":"AP News","slug":"apnews","imageUrl":"","date":"November 19, 2022"},{"index":1,"title":"Ilhan Omar blasts GOP leader McCarthy on vow to remove her from committee","shortDescription":"Rep. Ilhan Omar, D-Minn., hits back after House GOP leader Kevin McCarthy vows to strip her of her House committee assignments if elected speaker.","url":"https://www.usatoday.com/story/news/politics/2022/11/22/ilhan-omar-mccarthy-committee-greene-republicans/10756857002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":3,"title":"Young voter advocates urge parties to take them seriously after midterms","shortDescription":"Youth voter experts and advocates on both sides of the aisle say the midterm elections prove political parties can't keep discounting the nation's youngest voters.","url":"https://www.usatoday.com/story/news/politics/2022/11/23/gen-z-republican-democrat-midterms/10670331002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/23"},{"index":10,"title":"Supreme Court denies Trump effort to keep tax returns from House panel","shortDescription":"Trump's record at the Supreme Court is not particularly good, even though he nominated three of the court's current associate justices.","url":"https://www.usatoday.com/story/news/politics/2022/11/22/supreme-court-trump-tax-returns-ways-and-means/8256849001/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":15,"title":"Michigan GOP leader rebuffs request for election inquiry, calling it a 'stunt'","shortDescription":"The letter shredded the request, using a hypothetical question to suggest the effort is a \"shameless and half-baked political stunt.\"","url":"https://www.usatoday.com/story/news/politics/elections/2022/11/22/michigan-gop-speaker-election-inquiry-request-stunt/10756437002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":17,"title":"Four states voted to ban slavery; activists want other states to do so","shortDescription":"After four out of five states passed a constitutional amendment banning slavery this year, abolitionists say they have hope more states will soon follow.","url":"https://www.usatoday.com/story/news/politics/2022/11/22/slavery-ballot-states-initiatives-constitution-midterm/8323964001/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/22"},{"index":21,"title":"OnPolitics Q&A: McCarthy's promise to keep 3 Dems out of committees","shortDescription":"McCarthy has targeted Reps. Ilhan Omar (House Foreign Affairs Committee), Adam Schiff and Eric Swalwell (House Intelligence Committee).","url":"https://www.usatoday.com/story/news/politics/2022/11/21/why-mccarthy-promising-keep-3-democrats-off-house-committees/10750524002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/21"},{"index":22,"title":"Campaign shift? U.S. Senate candidates Warnock, Walker adjust messages","shortDescription":"With just weeks allotted for the Georgia runoff, Raphael Warnock and Herschel Walker are adjusting their strategies for the final leg of the campaign.","url":"https://www.usatoday.com/story/news/politics/elections/2022/11/21/raphael-warnock-herschel-walker-get-personal-georgia-senate-runoff/10751727002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/21"},{"index":30,"title":"McCarthy wants to block 3 Democrats from committees if he becomes speaker","shortDescription":"Democrats said McCarthy will do whatever his right wing wants him to do because he still lacks the votes to land the speaker's job.","url":"https://www.usatoday.com/story/news/politics/2022/11/20/krbin-mccarthy-keep-democrats-off-committees/10744512002/","source":"USA Today","slug":"usatoday","imageUrl":"","date":"2022/11/20"},{"index":5,"title":"More Senate Democrats Seek Investigation of Tech Firm Accused of Colluding With Landlords to Hike Apartment Rents","shortDescription":"Sen. Amy Klobuchar and other leading Democrats have asked the Department of Justice to examine Texas-based RealPage, which sells software to help landlords set apartment rental prices across the country.","url":"https://www.propublica.org/article/yieldstar-rent-increase-realpage-rent-klobuchar","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221116-Rent-Barons-Klobuchar.jpg","date":"Nov. 17"},{"index":6,"title":"Public Schools Are NYC’s Main Youth Mental Health System — and They’re Devastatingly Unequal","shortDescription":"Most kids labeled as having an “emotional disability” and shunted into public special education schools are Black or Latino, and low income — while wealthier families more often access a taxpayer-funded free private education.","url":"https://www.propublica.org/article/nyc-schools-kids-mental-health-special-education","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/ProPublica_Opener_Final_Stapleton.jpg","date":"Nov. 17"},{"index":11,"title":"“We Need to Defend This Law”: Inside an Anti-Abortion Meeting With Tennessee’s GOP Lawmakers","shortDescription":"Anti-abortion groups helped write and pass laws that kicked in to ban abortion when Roe v. Wade was overturned. The groups see Tennessee’s ban as the country’s strongest — and they want to keep it that way, according to audio reviewed by ProPublica.","url":"https://www.propublica.org/article/inside-anti-abortion-meeting-with-tennessee-republican-lawmakers","source":"Propublica","slug":"propublica","imageUrl":"https://img.assets-d.propublica.org/v5/images/20221114-Tennessee-Abortion-Lead-01.JPG","date":"Nov. 15"},{"index":5,"title":"Senate Announces Hearing After Chaos Over Taylor Swift Ticket Sales","shortDescription":"A committee led by Senator Amy Klobuchar of Minnesota will examine the ticketing industry after failures last week frustrated millions of the superstar’s fans.By Lora Kelley","url":"https://www.nytimes.com/2022/11/22/business/senate-antitrust-ticketmaster-taylor-swift.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/22/multimedia/22ticketmaster-pic-1-0a03/22ticketmaster-pic-1-0a03-thumbWide.jpg","date":"2022/11/22"},{"index":6,"title":"David Valadao, a Republican Who Voted to Impeach Trump, Wins Re-election","shortDescription":"His victory, which came after nearly two weeks of vote-counting, made the congressman one of just two House Republicans who supported impeaching the former president to remain in Congress.By Stephanie Lai","url":"https://www.nytimes.com/2022/11/21/us/politics/valadao-salas-california-house.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/08/us/politics/08election-day-valadao-val/08election-day-valadeo-val-thumbWide.jpg","date":"2022/11/08"},{"index":8,"title":"How Democrats Can Fight This G.O.P.","shortDescription":"They can forestall sabotage and make saboteurs pay a price.By Paul Krugman","url":"https://www.nytimes.com/2022/11/21/opinion/democrats-republicans-political-fight.html","source":"New York Times","slug":"nytimes","imageUrl":"https://static01.nyt.com/images/2022/11/21/opinion/21krugman-SWAP/21krugman-SWAP-thumbWide.jpg","date":"2022/11/21"},{"index":0,"title":"GOP downplays its Trump wing on the world stage","shortDescription":"Congressional Republican leaders at the Halifax International Security Forum sound like they're ignoring colleagues who have called for limiting further Ukraine aid.","url":"https://www.politico.com/news/2022/11/22/gop-ukraine-aid-halifax-00069709","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/22"},{"index":4,"title":"Democrats confront bleak odds for immigration deal before 2023","shortDescription":"","url":"https://www.politico.com/news/2022/11/21/democrats-immigration-deal-00069464","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/21"},{"index":5,"title":"GOP centrists prepare to ‘flex our muscles’","shortDescription":"","url":"https://www.politico.com/news/2022/11/21/gop-centrists-flex-muscles-00069541","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/21"},{"index":9,"title":"Dems get in array on future leadership after Pelosi departs","shortDescription":"","url":"https://www.politico.com/news/2022/11/18/house-dems-leadership-roles-pelosi-00069334","source":"Politico","slug":"politico","imageUrl":"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==","date":"2022/11/18"},{"index":12,"title":"Supreme Court backs House effort to obtain Trump tax returns","shortDescription":"","url":"https://www.politico.com/news/2022/11/22/supreme-court-backs-house-effort-to-obtain-trump-tax-returns-00070530","source":"Politico","slug":"politico","imageUrl":"","date":"2022/11/22"},{"index":13,"title":"How Panic on the Left Could Spark a Constitutional Crisis","shortDescription":"","url":"https://www.politico.com/news/magazine/2022/11/22/constitutional-crisis-panic-supreme-court-00069713","source":"Politico","slug":"politico","imageUrl":"","date":"2022/11/22"}]